In [1]:
#!pip install -U accelerate bitsandbytes peft transformers datasets trl git-lfs wandb flash-attn sql-metadata

In [2]:
import torch
import re
import pandas as pd
from transformers import AutoTokenizer, BitsAndBytesConfig
from transformers import AutoModelForCausalLM
from peft import PeftModel
from torch import cuda
from tqdm import tqdm
from modelscope import AutoModelForCausalLM, AutoTokenizer

/hpc2hdd/home/jzhao815/.conda/envs/dtssql/lib/python3.9/site-packages/tqdm/auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm
2024-04-25 19:37:51,756 - modelscope - INFO - PyTorch version 2.2.2 Found.
2024-04-25 19:37:51,758 - modelscope - INFO - Loading ast index from /hpc2hdd/home/jzhao815/.cache/modelscope/ast_indexer
2024-04-25 19:37:52,036 - modelscope - INFO - Loading done! Current index file version is 1.13.3, with md5 2bbcf3979e8ce95c88f5a68d5ba83352 and a total number of 972 components indexed

In [3]:
device = torch.device("cuda" if torch.cuda.is_available() else "cpu")
model_name = "qwen/CodeQwen1.5-7B-Chat"
# model_name = "mistralai/Mistral-7B-Instruct-v0.2"
bnb_config = BitsAndBytesConfig(
    load_in_8bit=True,
    bnb_4bit_compute_dtype = torch.float16,
    bnb_4bit_quant_type='nf4',
    bnb_4bit_use_double_quant=True,
)
model = AutoModelForCausalLM.from_pretrained(
    model_name,
    attn_implementation="flash_attention_2", # use with amper architecture
    torch_dtype=torch.bfloat16,
    #quantization_config=bnb_config, # use when low on memory
    device_map = "auto"
)

Loading checkpoint shards: 100%|██████████| 4/4 [00:11<00:00,  2.94s/it]

In [4]:
model = PeftModel.from_pretrained(model, "./final_checkpoint_codeQwen",torch_dtype = torch.bfloat16)
model = model.merge_and_unload()
model.to(device)
tokenizer = AutoTokenizer.from_pretrained(model_name)
tokenizer.pad_token = tokenizer.eos_token
tokenizer.pad_token_id = tokenizer.eos_token_id

In [5]:
tokenizer.encode(' ;')

[5106]

In [6]:
from transformers import StoppingCriteria
class EosListStoppingCriteria(StoppingCriteria):
    def __init__(self, eos_sequence = [6203]):
        self.eos_sequence = eos_sequence

    def __call__(self, input_ids: torch.LongTensor, scores: torch.FloatTensor, **kwargs) -> bool:
        last_ids = input_ids[:,-len(self.eos_sequence):].tolist()
        return self.eos_sequence in last_ids
    
def append_string_to_file(text, file_path):
  with open(file_path, 'a') as file:
      file.write(text + '\n')

def remove_spaces(text):
  return re.sub(r'\s+', ' ', text)

def call_mistral(inputs):
  output_tokens = model.generate(inputs, max_new_tokens=250, do_sample=False, pad_token_id=tokenizer.eos_token_id, eos_token_id=tokenizer.eos_token_id, stopping_criteria = [EosListStoppingCriteria()])
  return tokenizer.decode(output_tokens[0][len(inputs[0]):], skip_special_tokens=True)

In [7]:
df = pd.read_csv("useful_val_dataset3.csv")
results = []
for index, row in tqdm(df.iterrows(), total=len(df)):
  question = row['question']
  query = row['query']
  database_schema = row['filtered_database_schema']
  db_id = row['db_id']
  user_message = f"""Given the following SQL tables, your job is to generate the Sqlite SQL query given the user's question. Please pay special attention to the choice of table names and column names.
Put your answer inside the ```sql and ``` tags.
{database_schema}
###
Question: {question}
"""
  messages = [
      {"role": "user", "content": user_message.strip()}
  ]
  inputs = tokenizer.apply_chat_template(messages, return_tensors="pt",add_generation_prompt=True,tokenize = True).to(model.device)
  response = call_mistral(inputs)
  if ";" in response:
    response = response.split(";")[0]
    if "```sql" in response:
      response = response.split("```sql")[1]
  response = re.sub(r'\s+', ' ', response).strip()
  print("\n")
  print(response)
  print(query)
  print("============================")
  results.append([response, query,row['question'],row['db_id']])
  new_df = pd.DataFrame(results, columns = ['generated_query','reference_query','question','db_id'])

  0%|          | 0/1034 [00:00<?, ?it/s]/hpc2hdd/home/jzhao815/.conda/envs/dtssql/lib/python3.9/site-packages/transformers/generation/configuration_utils.py:497: UserWarning: `do_sample` is set to `False`. However, `top_p` is set to `0.95` -- this flag is only used in sample-based generation modes. You should set `do_sample=True` or unset `top_p`.
  warnings.warn(
  0%|          | 1/1034 [00:10<2:53:16, 10.06s/it]

SELECT COUNT(*) FROM singer
SELECT count(*) FROM singer
============================

  0%|          | 2/1034 [00:17<2:23:20,  8.33s/it]

SELECT COUNT(*) FROM singer
SELECT count(*) FROM singer
============================

  0%|          | 3/1034 [00:24<2:13:41,  7.78s/it]

SELECT name , country , age FROM singer ORDER BY age DESC
SELECT name ,  country ,  age FROM singer ORDER BY age DESC
============================

  0%|          | 4/1034 [00:31<2:09:04,  7.52s/it]

SELECT name , country , age FROM singer ORDER BY age DESC
SELECT name ,  country ,  age FROM singer ORDER BY age DESC
============================

  0%|          | 5/1034 [00:38<2:06:20,  7.37s/it]

SELECT AVG(age) , MIN(age) , MAX(age) FROM singer WHERE country = "France"
SELECT avg(age) ,  min(age) ,  max(age) FROM singer WHERE country  =  'France'
============================

  1%|          | 6/1034 [00:45<2:04:44,  7.28s/it]

SELECT AVG(age) , MIN(age) , MAX(age) FROM singer WHERE country = "France"
SELECT avg(age) ,  min(age) ,  max(age) FROM singer WHERE country  =  'France'
============================

  1%|          | 7/1034 [00:52<2:03:42,  7.23s/it]

SELECT song_name , song_release_year FROM singer ORDER BY age ASC LIMIT 1
SELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1
============================

  1%|          | 8/1034 [00:59<2:02:54,  7.19s/it]

SELECT song_name , song_release_year FROM singer ORDER BY age ASC LIMIT 1
SELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1
============================

  1%|          | 9/1034 [01:07<2:02:40,  7.18s/it]

SELECT DISTINCT country FROM singer WHERE age > 20
SELECT DISTINCT country FROM singer WHERE age  >  20
============================

  1%|          | 10/1034 [01:14<2:02:44,  7.19s/it]

SELECT DISTINCT country FROM singer WHERE age > 20
SELECT DISTINCT country FROM singer WHERE age  >  20
============================

  1%|          | 11/1034 [01:21<2:02:42,  7.20s/it]

SELECT country , COUNT(*) FROM singer GROUP BY country
SELECT country ,  count(*) FROM singer GROUP BY country
============================

  1%|          | 12/1034 [01:28<2:03:17,  7.24s/it]

SELECT country , COUNT(*) FROM singer GROUP BY country
SELECT country ,  count(*) FROM singer GROUP BY country
============================

  1%|▏         | 13/1034 [01:35<2:02:26,  7.20s/it]

SELECT song_name FROM singer WHERE age > (SELECT AVG(age) FROM singer)
SELECT song_name FROM singer WHERE age  >  (SELECT avg(age) FROM singer)
============================

  1%|▏         | 14/1034 [01:43<2:02:07,  7.18s/it]

SELECT song_name FROM singer WHERE age > (SELECT AVG(age) FROM singer)
SELECT song_name FROM singer WHERE age  >  (SELECT avg(age) FROM singer)
============================

  1%|▏         | 15/1034 [01:50<2:01:26,  7.15s/it]

SELECT location , name FROM stadium WHERE capacity BETWEEN 5000 AND 10000
SELECT LOCATION ,  name FROM stadium WHERE capacity BETWEEN 5000 AND 10000
============================

  2%|▏         | 16/1034 [01:57<2:00:55,  7.13s/it]

SELECT location , name FROM stadium WHERE capacity BETWEEN 5000 AND 10000
SELECT LOCATION ,  name FROM stadium WHERE capacity BETWEEN 5000 AND 10000
============================

  2%|▏         | 17/1034 [02:04<2:00:31,  7.11s/it]

SELECT MAX(capacity) , AVG(capacity) FROM stadium
select max(capacity), average from stadium
============================

  2%|▏         | 18/1034 [02:11<2:00:29,  7.12s/it]

SELECT AVG(capacity) , MAX(capacity) FROM stadium
select avg(capacity) ,  max(capacity) from stadium
============================

  2%|▏         | 19/1034 [02:18<2:00:09,  7.10s/it]

SELECT name , capacity FROM stadium ORDER BY average DESC LIMIT 1
SELECT name ,  capacity FROM stadium ORDER BY average DESC LIMIT 1
============================

  2%|▏         | 20/1034 [02:25<2:00:04,  7.11s/it]

SELECT name , capacity FROM stadium ORDER BY average DESC LIMIT 1
SELECT name ,  capacity FROM stadium ORDER BY average DESC LIMIT 1
============================

  2%|▏         | 21/1034 [02:32<2:00:20,  7.13s/it]

SELECT COUNT(*) FROM concert WHERE year = 2014 OR year = 2015
SELECT count(*) FROM concert WHERE YEAR  =  2014 OR YEAR  =  2015
============================

  2%|▏         | 22/1034 [02:39<2:00:30,  7.14s/it]

SELECT COUNT(*) FROM concert WHERE year = 2014 OR year = 2015
SELECT count(*) FROM concert WHERE YEAR  =  2014 OR YEAR  =  2015
============================

  2%|▏         | 23/1034 [02:47<2:00:44,  7.17s/it]

SELECT t2.name , COUNT(*) FROM concert as t1 JOIN stadium as t2 ON t1.stadium_id = t2.stadium_id GROUP BY t2.name
SELECT T2.name ,  count(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id GROUP BY T1.stadium_id
============================

  2%|▏         | 24/1034 [02:54<2:00:45,  7.17s/it]

SELECT COUNT(*) , t2.name FROM concert as t1 JOIN stadium as t2 ON t1.stadium_id = t2.stadium_id GROUP BY t2.name
SELECT T2.name ,  count(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id GROUP BY T1.stadium_id
============================

  2%|▏         | 25/1034 [03:01<2:00:42,  7.18s/it]

SELECT t2.name , t2.capacity FROM concert as t1 JOIN stadium as t2 ON t1.stadium_id = t2.stadium_id WHERE t1.year >= 2014 GROUP BY t2.stadium_id ORDER BY COUNT(*) DESC LIMIT 1
SELECT T2.name ,  T2.capacity FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  >=  2014 GROUP BY T2.stadium_id ORDER BY count(*) DESC LIMIT 1
============================

  3%|▎         | 26/1034 [03:08<2:01:04,  7.21s/it]

SELECT t2.name , t2.capacity FROM concert as t1 JOIN stadium as t2 ON t1.stadium_id = t2.stadium_id WHERE t1.year > 2013 GROUP BY t2.stadium_id ORDER BY COUNT(*) DESC LIMIT 1
select t2.name ,  t2.capacity from concert as t1 join stadium as t2 on t1.stadium_id  =  t2.stadium_id where t1.year  >  2013 group by t2.stadium_id order by count(*) desc limit 1
============================

  3%|▎         | 27/1034 [03:15<2:00:19,  7.17s/it]

SELECT year FROM concert GROUP BY year ORDER BY COUNT(*) DESC LIMIT 1
SELECT YEAR FROM concert GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1
============================

  3%|▎         | 28/1034 [03:22<1:59:47,  7.15s/it]

SELECT year FROM concert GROUP BY year ORDER BY COUNT(*) DESC LIMIT 1
SELECT YEAR FROM concert GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1
============================

  3%|▎         | 29/1034 [03:30<1:59:39,  7.14s/it]

SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert)
SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert)
============================

  3%|▎         | 30/1034 [03:37<1:59:24,  7.14s/it]

SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert)
SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert)
============================

  3%|▎         | 31/1034 [03:44<1:59:11,  7.13s/it]

SELECT country FROM singer WHERE age > 40 INTERSECT SELECT country FROM singer WHERE age < 30
SELECT country FROM singer WHERE age  >  40 INTERSECT SELECT country FROM singer WHERE age  <  30
============================

  3%|▎         | 32/1034 [03:51<1:59:08,  7.13s/it]

SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert WHERE year = 2014)
SELECT name FROM stadium EXCEPT SELECT T2.name FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  =  2014
============================

  3%|▎         | 33/1034 [03:58<1:59:06,  7.14s/it]

SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert WHERE year = 2014)
SELECT name FROM stadium EXCEPT SELECT T2.name FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  =  2014
============================

  3%|▎         | 34/1034 [04:05<1:59:18,  7.16s/it]

SELECT t1.concert_name , t1.theme , COUNT(*) FROM concert as t1 JOIN singer_in_concert as t2 ON t1.concert_id = t2.concert_id GROUP BY t1.concert_id
SELECT T2.concert_name ,  T2.theme ,  count(*) FROM singer_in_concert AS T1 JOIN concert AS T2 ON T1.concert_id  =  T2.concert_id GROUP BY T2.concert_id
============================

  3%|▎         | 35/1034 [04:13<1:59:13,  7.16s/it]

SELECT t2.concert_name , t2.theme , COUNT(*) FROM singer_in_concert as t1 JOIN concert as t2 ON t1.concert_id = t2.concert_id GROUP BY t2.concert_name
select t2.concert_name ,  t2.theme ,  count(*) from singer_in_concert as t1 join concert as t2 on t1.concert_id  =  t2.concert_id group by t2.concert_id
============================

  3%|▎         | 36/1034 [04:20<1:58:53,  7.15s/it]

SELECT t1.name , COUNT(*) FROM singer AS t1 JOIN singer_in_concert AS t2 ON t1.singer_id = t2.singer_id GROUP BY t1.name
SELECT T2.name ,  count(*) FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id GROUP BY T2.singer_id
============================

  4%|▎         | 37/1034 [04:27<1:59:12,  7.17s/it]

SELECT t1.name , COUNT(*) FROM singer as t1 JOIN singer_in_concert as t2 ON t1.singer_id = t2.singer_id GROUP BY t1.name
SELECT T2.name ,  count(*) FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id GROUP BY T2.singer_id
============================

  4%|▎         | 38/1034 [04:34<1:59:42,  7.21s/it]

SELECT t2.name FROM concert as t1 JOIN singer_in_concert as t3 ON t1.concert_id = t3.concert_id JOIN singer as t2 ON t3.singer_id = t2.singer_id WHERE t1.year = 2014
SELECT T2.name FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id JOIN concert AS T3 ON T1.concert_id  =  T3.concert_id WHERE T3.year  =  2014
============================

  4%|▍         | 39/1034 [04:41<1:59:10,  7.19s/it]

SELECT t1.name FROM singer as t1 JOIN singer_in_concert as t3 ON t1.singer_id = t3.singer_id JOIN concert as t2 ON t3.concert_id = t2.concert_id WHERE t2.year = 2014
SELECT T2.name FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id JOIN concert AS T3 ON T1.concert_id  =  T3.concert_id WHERE T3.year  =  2014
============================

  4%|▍         | 40/1034 [04:48<1:58:45,  7.17s/it]

SELECT name , country FROM singer WHERE song_name LIKE '%Hey%'
SELECT name ,  country FROM singer WHERE song_name LIKE '%Hey%'
============================

  4%|▍         | 41/1034 [04:56<1:58:21,  7.15s/it]

SELECT name , country FROM singer WHERE song_name LIKE '%Hey%'
SELECT name ,  country FROM singer WHERE song_name LIKE '%Hey%'
============================

  4%|▍         | 42/1034 [05:03<1:57:54,  7.13s/it]

SELECT t2.name , t2.location FROM concert as t1 JOIN stadium as t2 ON t1.stadium_id = t2.stadium_id WHERE t1.year = 2014 INTERSECT SELECT t2.name , t2.location FROM concert as t1 JOIN stadium as t2 ON t1.stadium_id = t2.stadium_id WHERE t1.year = 2015
SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2014 INTERSECT SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2015
============================

  4%|▍         | 43/1034 [05:10<1:58:18,  7.16s/it]

SELECT t2.name , t2.location FROM concert as t1 JOIN stadium as t2 ON t1.stadium_id = t2.stadium_id WHERE t1.year = 2014 INTERSECT SELECT t2.name , t2.location FROM concert as t1 JOIN stadium as t2 ON t1.stadium_id = t2.stadium_id WHERE t1.year = 2015
SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2014 INTERSECT SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2015
============================

  4%|▍         | 44/1034 [05:17<1:58:13,  7.17s/it]

SELECT COUNT(*) FROM concert JOIN stadium ON concert.stadium_id = stadium.stadium_id ORDER BY stadium.capacity DESC LIMIT 1
select count(*) from concert where stadium_id = (select stadium_id from stadium order by capacity desc limit 1)
============================

  4%|▍         | 45/1034 [05:24<1:58:58,  7.22s/it]

SELECT COUNT(*) FROM stadium WHERE capacity = (SELECT MAX(capacity) FROM stadium)
select count(*) from concert where stadium_id = (select stadium_id from stadium order by capacity desc limit 1)
============================

  4%|▍         | 46/1034 [05:32<1:58:44,  7.21s/it]

SELECT COUNT(*) FROM Pets WHERE weight > 10
SELECT count(*) FROM pets WHERE weight  >  10
============================

  5%|▍         | 47/1034 [05:39<1:58:32,  7.21s/it]

SELECT COUNT(*) FROM Pets WHERE weight > 10
SELECT count(*) FROM pets WHERE weight  >  10
============================

  5%|▍         | 48/1034 [05:46<1:58:10,  7.19s/it]

SELECT weight FROM pets WHERE pettype = "dog" ORDER BY pet_age ASC LIMIT 1
SELECT weight FROM pets ORDER BY pet_age LIMIT 1
============================

  5%|▍         | 49/1034 [05:53<1:57:41,  7.17s/it]

SELECT weight FROM pets WHERE pettype = "dog" ORDER BY pet_age ASC LIMIT 1
SELECT weight FROM pets ORDER BY pet_age LIMIT 1
============================

  5%|▍         | 50/1034 [06:00<1:57:19,  7.15s/it]

SELECT MAX(weight) , pettype FROM pets GROUP BY pettype
SELECT max(weight) ,  petType FROM pets GROUP BY petType
============================

  5%|▍         | 51/1034 [06:07<1:57:13,  7.16s/it]

SELECT MAX(weight) , pettype FROM pets GROUP BY pettype
SELECT max(weight) ,  petType FROM pets GROUP BY petType
============================

  5%|▌         | 52/1034 [06:15<1:57:25,  7.17s/it]

SELECT COUNT(*) FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid WHERE t1.age > 20
SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.age  >  20
============================

  5%|▌         | 53/1034 [06:22<1:57:43,  7.20s/it]

SELECT COUNT(*) FROM student as t1 JOIN has_pet as t2 ON t1.stuid = t2.stuid WHERE t1.age > 20
SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.age  >  20
============================

  5%|▌         | 54/1034 [06:29<1:57:49,  7.21s/it]

SELECT COUNT(*) FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid JOIN pets AS t3 ON t2.petid = t3.petid WHERE t1.sex = "F" AND t3.pettype = "dog"
SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T2.petid  =  T3.petid WHERE T1.sex  =  'F' AND T3.pettype  =  'dog'
============================

  5%|▌         | 55/1034 [06:36<1:58:15,  7.25s/it]

SELECT COUNT(*) FROM pet AS t1 JOIN student AS t2 ON t1.owner_id = t2.student_id WHERE t1.species = "dog" AND t2.gender = "female"
SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T2.petid  =  T3.petid WHERE T1.sex  =  'F' AND T3.pettype  =  'dog'
============================

  5%|▌         | 56/1034 [06:44<1:58:01,  7.24s/it]

SELECT COUNT(DISTINCT pettype) FROM pets
SELECT count(DISTINCT pettype) FROM pets
============================

  6%|▌         | 57/1034 [06:51<1:57:55,  7.24s/it]

SELECT COUNT(DISTINCT pettype) FROM pets
SELECT count(DISTINCT pettype) FROM pets
============================

  6%|▌         | 58/1034 [06:58<1:57:46,  7.24s/it]

SELECT t1.fname FROM student as t1 JOIN has_pet as t3 ON t1.stuid = t3.stuid JOIN pets as t2 ON t3.petid = t2.petid WHERE t2.pettype = "cat" OR t2.pettype = "dog"
SELECT DISTINCT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' OR T3.pettype  =  'dog'
============================

  6%|▌         | 59/1034 [07:05<1:57:07,  7.21s/it]

SELECT t1.fname FROM student as t1 JOIN has_pet as t3 ON t1.stuid = t3.stuid JOIN pets as t2 ON t3.petid = t2.petid WHERE t2.pettype = "cat" OR t2.pettype = "dog"
SELECT DISTINCT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' OR T3.pettype  =  'dog'
============================

  6%|▌         | 60/1034 [07:12<1:56:33,  7.18s/it]

SELECT t1.fname FROM student as t1 JOIN has_pet as t3 ON t1.stuid = t3.stuid JOIN pets as t2 ON t3.petid = t2.petid WHERE t2.pettype = "cat" INTERSECT SELECT t1.fname FROM student as t1 JOIN has_pet as t3 ON t1.stuid = t3.stuid JOIN pets as t2 ON t3.petid = t2.petid WHERE t2.pettype = "dog"
select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'cat' intersect select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'dog'
============================

  6%|▌         | 61/1034 [07:19<1:56:04,  7.16s/it]

SELECT t1.fname FROM student as t1 JOIN has_pet as t3 ON t1.stuid = t3.stuid JOIN pets as t2 ON t3.petid = t2.petid WHERE t2.pettype = "cat" INTERSECT SELECT t1.fname FROM student as t1 JOIN has_pet as t3 ON t1.stuid = t3.stuid JOIN pets as t2 ON t3.petid = t2.petid WHERE t2.pettype = "dog"
SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog'
============================

  6%|▌         | 62/1034 [07:27<1:55:43,  7.14s/it]

SELECT major , age FROM student WHERE stuid NOT IN (SELECT t1.stuid FROM has_pet as t1 JOIN pets as t2 ON t1.petid = t2.petid WHERE t2.pettype = "cat")
SELECT major ,  age FROM student WHERE stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')
============================

  6%|▌         | 63/1034 [07:34<1:55:57,  7.17s/it]

SELECT major , age FROM student WHERE stuid NOT IN (SELECT t1.stuid FROM has_pet as t1 JOIN pets as t2 ON t1.petid = t2.petid WHERE t2.pettype = "cat")
SELECT major ,  age FROM student WHERE stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')
============================

  6%|▌         | 64/1034 [07:41<1:56:05,  7.18s/it]

SELECT stuid FROM has_pet EXCEPT SELECT t1.stuid FROM has_pet as t1 JOIN pets as t2 ON t1.petid = t2.petid WHERE t2.pettype = "cat"
SELECT stuid FROM student EXCEPT SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat'
============================

  6%|▋         | 65/1034 [07:48<1:55:56,  7.18s/it]

SELECT stuid FROM has_pet EXCEPT SELECT t1.stuid FROM has_pet as t1 JOIN pets as t2 ON t1.petid = t2.petid WHERE t2.pettype = "cat"
SELECT stuid FROM student EXCEPT SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat'
============================

  6%|▋         | 66/1034 [07:55<1:55:43,  7.17s/it]

SELECT t1.fname , t1.age FROM student as t1 JOIN has_pet as t3 ON t1.stuid = t3.stuid JOIN pets as t2 ON t3.petid = t2.petid WHERE t2.pettype = "dog" EXCEPT SELECT t1.fname , t1.age FROM student as t1 JOIN has_pet as t3 ON t1.stuid = t3.stuid JOIN pets as t2 ON t3.petid = t2.petid WHERE t2.pettype = "cat"
SELECT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog' AND T1.stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')
============================

  6%|▋         | 67/1034 [08:03<1:55:54,  7.19s/it]

SELECT t1.fname FROM student as t1 JOIN has_pet as t3 ON t1.stuid = t3.stuid JOIN pets as t2 ON t3.petid = t2.petid WHERE t2.pettype = "dog" EXCEPT SELECT t1.fname FROM student as t1 JOIN has_pet as t3 ON t1.stuid = t3.stuid JOIN pets as t2 ON t3.petid = t2.petid WHERE t2.pettype = "cat"
SELECT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog' AND T1.stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')
============================

  7%|▋         | 68/1034 [08:10<1:55:28,  7.17s/it]

SELECT type , weight FROM pets ORDER BY age ASC LIMIT 1
SELECT pettype ,  weight FROM pets ORDER BY pet_age LIMIT 1
============================

  7%|▋         | 69/1034 [08:17<1:55:03,  7.15s/it]

SELECT pettype , weight FROM pets ORDER BY pet_age ASC LIMIT 1
SELECT pettype ,  weight FROM pets ORDER BY pet_age LIMIT 1
============================

  7%|▋         | 70/1034 [08:24<1:54:49,  7.15s/it]

SELECT petid , weight FROM pets WHERE pet_age > 1
SELECT petid ,  weight FROM pets WHERE pet_age  >  1
============================

  7%|▋         | 71/1034 [08:31<1:54:38,  7.14s/it]

SELECT petid , weight FROM pets WHERE pet_age > 1
SELECT petid ,  weight FROM pets WHERE pet_age  >  1
============================

  7%|▋         | 72/1034 [08:38<1:54:25,  7.14s/it]

SELECT pettype , AVG(pet_age) , MAX(pet_age) FROM pets GROUP BY pettype
SELECT avg(pet_age) ,  max(pet_age) ,  pettype FROM pets GROUP BY pettype
============================

  7%|▋         | 73/1034 [08:45<1:54:41,  7.16s/it]

SELECT pettype , AVG(pet_age) , MAX(pet_age) FROM pets GROUP BY pettype
SELECT avg(pet_age) ,  max(pet_age) ,  pettype FROM pets GROUP BY pettype
============================

  7%|▋         | 74/1034 [08:53<1:55:11,  7.20s/it]

SELECT AVG(weight) , pettype FROM pets GROUP BY pettype
SELECT avg(weight) ,  pettype FROM pets GROUP BY pettype
============================

  7%|▋         | 75/1034 [09:00<1:55:10,  7.21s/it]

SELECT pettype , AVG(weight) FROM pets GROUP BY pettype
SELECT avg(weight) ,  pettype FROM pets GROUP BY pettype
============================

  7%|▋         | 76/1034 [09:07<1:54:43,  7.19s/it]

SELECT t1.fname , t1.age FROM student as t1 JOIN has_pet as t2 ON t1.stuid = t2.stuid
SELECT DISTINCT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid
============================

  7%|▋         | 77/1034 [09:14<1:54:23,  7.17s/it]

SELECT DISTINCT t1.fname , t1.age FROM student as t1 JOIN has_pet as t2 ON t1.stuid = t2.stuid
SELECT DISTINCT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid
============================

  8%|▊         | 78/1034 [09:21<1:54:06,  7.16s/it]

SELECT t2.petid FROM student as t1 JOIN has_pet as t3 ON t1.stuid = t3.stuid JOIN pets as t2 ON t3.petid = t2.petid WHERE t1.lname = 'Smith'
SELECT T2.petid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.Lname  =  'Smith'
============================

  8%|▊         | 79/1034 [09:29<1:54:19,  7.18s/it]

SELECT t2.petid FROM student as t1 JOIN has_pet as t3 ON t1.stuid = t3.stuid JOIN pets as t2 ON t3.petid = t2.petid WHERE t1.lname = 'Smith'
SELECT T2.petid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.Lname  =  'Smith'
============================

  8%|▊         | 80/1034 [09:36<1:54:15,  7.19s/it]

SELECT COUNT(*) , t1.stuid FROM has_pet as t1 JOIN pets as t2 ON t1.petid = t2.petid GROUP BY t1.stuid
SELECT count(*) ,  T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid GROUP BY T1.stuid
============================

  8%|▊         | 81/1034 [09:43<1:54:47,  7.23s/it]

SELECT stuid , COUNT(*) FROM has_pet GROUP BY stuid
select count(*) ,  t1.stuid from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid group by t1.stuid
============================

  8%|▊         | 82/1034 [09:50<1:54:59,  7.25s/it]

SELECT t1.fname , t1.sex FROM student as t1 JOIN has_pet as t2 ON t1.stuid = t2.stuid GROUP BY t1.stuid HAVING COUNT(*) > 1
SELECT T1.fname ,  T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid GROUP BY T1.stuid HAVING count(*)  >  1
============================

  8%|▊         | 83/1034 [09:58<1:54:54,  7.25s/it]

SELECT t1.fname , t1.sex FROM student as t1 JOIN has_pet as t2 ON t1.stuid = t2.stuid GROUP BY t1.stuid HAVING COUNT(*) > 1
SELECT T1.fname ,  T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid GROUP BY T1.stuid HAVING count(*)  >  1
============================

  8%|▊         | 84/1034 [10:05<1:55:22,  7.29s/it]

SELECT t1.lname FROM student as t1 JOIN has_pet as t3 ON t1.stuid = t3.stuid JOIN pets as t2 ON t3.petid = t2.petid WHERE t2.pettype = "cat" AND t2.pet_age = 3
SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pet_age  =  3 AND T3.pettype  =  'cat'
============================

  8%|▊         | 85/1034 [10:12<1:55:14,  7.29s/it]

SELECT t1.lname FROM student as t1 JOIN has_pet as t3 ON t1.stuid = t3.stuid JOIN pets as t2 ON t3.petid = t2.petid WHERE t2.pettype = "cat" AND t2.pet_age = 3
SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pet_age  =  3 AND T3.pettype  =  'cat'
============================

  8%|▊         | 86/1034 [10:19<1:54:45,  7.26s/it]

SELECT AVG(age) FROM student WHERE stuid NOT IN (SELECT stuid FROM has_pet)
select avg(age) from student where stuid not in (select stuid from has_pet)
============================

  8%|▊         | 87/1034 [10:27<1:54:47,  7.27s/it]

SELECT AVG(age) FROM students WHERE pet_owner = 0
select avg(age) from student where stuid not in (select stuid from has_pet)
============================

  9%|▊         | 88/1034 [10:34<1:54:08,  7.24s/it]

SELECT COUNT(*) FROM continents
SELECT count(*) FROM CONTINENTS;
============================

  9%|▊         | 89/1034 [10:41<1:53:29,  7.21s/it]

SELECT COUNT(*) FROM continents
SELECT count(*) FROM CONTINENTS;
============================

  9%|▊         | 90/1034 [10:48<1:53:00,  7.18s/it]

SELECT t2.continent , t2.contid , COUNT(*) FROM countries as t1 JOIN continents as t2 ON t1.continent = t2.contid GROUP BY t2.continent
SELECT T1.ContId ,  T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.Continent GROUP BY T1.ContId;
============================

  9%|▉         | 91/1034 [10:55<1:52:30,  7.16s/it]

SELECT t2.contid , t2.continent , COUNT(*) FROM countries as t1 JOIN continents as t2 ON t1.continent = t2.contid GROUP BY t2.continent
SELECT T1.ContId ,  T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.Continent GROUP BY T1.ContId;
============================

  9%|▉         | 92/1034 [11:03<1:53:41,  7.24s/it]

SELECT COUNT(*) FROM countries
SELECT count(*) FROM COUNTRIES;
============================

  9%|▉         | 93/1034 [11:10<1:53:17,  7.22s/it]

SELECT COUNT(*) FROM countries
SELECT count(*) FROM COUNTRIES;
============================

  9%|▉         | 94/1034 [11:17<1:53:02,  7.22s/it]

SELECT t2.fullname , t2.id , COUNT(*) FROM model_list as t1 JOIN car_makers as t2 ON t1.maker = t2.id GROUP BY t2.id
SELECT T1.FullName ,  T1.Id ,  count(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker GROUP BY T1.Id;
============================

  9%|▉         | 95/1034 [11:24<1:52:41,  7.20s/it]

SELECT t2.fullname , t2.id , COUNT(*) FROM model_list as t1 JOIN car_makers as t2 ON t1.maker = t2.id GROUP BY t2.id
SELECT T1.FullName ,  T1.Id ,  count(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker GROUP BY T1.Id;
============================

  9%|▉         | 96/1034 [11:32<1:53:11,  7.24s/it]

SELECT model FROM model_list ORDER BY horsepower LIMIT 1
SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id ORDER BY T2.horsepower ASC LIMIT 1;
============================

  9%|▉         | 97/1034 [11:39<1:53:28,  7.27s/it]

SELECT t1.model FROM car_names as t1 JOIN model_list as t2 ON t1.model = t2.model ORDER BY t2.horsepower LIMIT 1
SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id ORDER BY T2.horsepower ASC LIMIT 1;
============================

  9%|▉         | 98/1034 [11:46<1:53:16,  7.26s/it]

SELECT model FROM car_names WHERE weight < (SELECT AVG(weight) FROM car_names)
SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id WHERE T2.Weight  <  (SELECT avg(Weight) FROM CARS_DATA)
============================

 10%|▉         | 99/1034 [11:53<1:53:13,  7.27s/it]

SELECT model FROM car_names WHERE weight < (SELECT AVG(weight) FROM car_names)
SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id WHERE T2.Weight  <  (SELECT avg(Weight) FROM CARS_DATA)
============================

 10%|▉         | 100/1034 [12:01<1:53:09,  7.27s/it]

SELECT DISTINCT t3.maker FROM car_names as t1 JOIN cars_data as t2 ON t1.makeid = t2.id JOIN car_makers as t3 ON t1.makeid = t3.id WHERE t2.year = 1970
SELECT DISTINCT T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker JOIN CAR_NAMES AS T3 ON T2.model  =  T3.model JOIN CARS_DATA AS T4 ON T3.MakeId  =  T4.id WHERE T4.year  =  '1970';
============================

 10%|▉         | 101/1034 [12:08<1:52:55,  7.26s/it]

SELECT DISTINCT t2.maker FROM cars_data AS t1 JOIN car_names AS t3 ON t1.id = t3.makeid JOIN car_makers AS t2 ON t3.make = t2.maker WHERE t1.year = 1970
SELECT DISTINCT T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker JOIN CAR_NAMES AS T3 ON T2.model  =  T3.model JOIN CARS_DATA AS T4 ON T3.MakeId  =  T4.id WHERE T4.year  =  '1970';
============================

 10%|▉         | 102/1034 [12:15<1:52:47,  7.26s/it]

SELECT make , year FROM car_names JOIN cars_data ON car_names.makeid = cars_data.id ORDER BY cars_data.year LIMIT 1
SELECT T2.Make ,  T1.Year FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id  =  T2.MakeId WHERE T1.Year  =  (SELECT min(YEAR) FROM CARS_DATA);
============================

 10%|▉         | 103/1034 [12:22<1:52:37,  7.26s/it]

SELECT t1.maker , MIN(t2.year) FROM car_makers as t1 JOIN cars_data as t2 ON t1.id = t2.id GROUP BY t1.maker ORDER BY MIN(t2.year) LIMIT 1
SELECT T2.Make ,  T1.Year FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id  =  T2.MakeId WHERE T1.Year  =  (SELECT min(YEAR) FROM CARS_DATA);
============================

 10%|█         | 104/1034 [12:30<1:52:13,  7.24s/it]

SELECT DISTINCT t2.model FROM cars_data as t1 JOIN model_list as t2 ON t1.id = t2.modelid WHERE t1.year > 1980
SELECT DISTINCT T1.model FROM MODEL_LIST AS T1 JOIN CAR_NAMES AS T2 ON T1.model  =  T2.model JOIN CARS_DATA AS T3 ON T2.MakeId  =  T3.id WHERE T3.year  >  1980;
============================

 10%|█         | 105/1034 [12:37<1:52:02,  7.24s/it]

SELECT DISTINCT t2.model FROM cars_data as t1 JOIN model_list as t2 ON t1.id = t2.modelid WHERE t1.year > 1980
SELECT DISTINCT T1.model FROM MODEL_LIST AS T1 JOIN CAR_NAMES AS T2 ON T1.model  =  T2.model JOIN CARS_DATA AS T3 ON T2.MakeId  =  T3.id WHERE T3.year  >  1980;
============================

 10%|█         | 106/1034 [12:44<1:51:54,  7.24s/it]

SELECT t3.continent , COUNT(*) FROM car_makers as t1 JOIN countries as t2 ON t1.country = t2.countryid JOIN continents as t3 ON t2.continent = t3.contid GROUP BY t3.continent
SELECT T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.continent JOIN car_makers AS T3 ON T2.CountryId  =  T3.Country GROUP BY T1.Continent;
============================

 10%|█         | 107/1034 [12:51<1:51:50,  7.24s/it]

SELECT t2.continent , COUNT(*) FROM car_makers as t1 JOIN continents as t2 ON t1.country = t2.contid GROUP BY t2.continent
SELECT T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.continent JOIN car_makers AS T3 ON T2.CountryId  =  T3.Country GROUP BY T1.Continent;
============================

 10%|█         | 108/1034 [12:59<1:51:22,  7.22s/it]

SELECT T2.countryname FROM car_makers as T1 JOIN countries as T2 ON T1.country = T2.countryid GROUP BY T2.countryname ORDER BY COUNT(*) DESC LIMIT 1
SELECT T2.CountryName FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country  =  T2.CountryId GROUP BY T1.Country ORDER BY Count(*) DESC LIMIT 1;
============================

 11%|█         | 109/1034 [13:06<1:50:52,  7.19s/it]

SELECT T2.countryname FROM car_makers as T1 JOIN countries as T2 ON T1.country = T2.countryid GROUP BY T2.countryname ORDER BY COUNT(*) DESC LIMIT 1
SELECT T2.CountryName FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country  =  T2.CountryId GROUP BY T1.Country ORDER BY Count(*) DESC LIMIT 1;
============================

 11%|█         | 110/1034 [13:13<1:50:26,  7.17s/it]

SELECT COUNT(*) , T2.fullname FROM model_list as T1 JOIN car_makers as T2 ON T1.maker = T2.id GROUP BY T2.fullname
select count(*) ,  t2.fullname from model_list as t1 join car_makers as t2 on t1.maker  =  t2.id group by t2.id;
============================

 11%|█         | 111/1034 [13:20<1:50:04,  7.16s/it]

SELECT COUNT(*) , T2.maker , T1.id , T1.fullname FROM car_makers as T1 JOIN model_list as T2 ON T1.id = T2.maker GROUP BY T2.maker , T1.id , T1.fullname
SELECT Count(*) ,  T2.FullName ,  T2.id FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker  =  T2.Id GROUP BY T2.id;
============================

 11%|█         | 112/1034 [13:27<1:49:52,  7.15s/it]

SELECT t4.accelerate FROM countries as t1 JOIN car_makers as t2 ON t1.countryid = t2.country JOIN model_list as t3 ON t2.id = t3.maker JOIN car_names as t4 ON t3.model = t4.model JOIN cars_data as t5 ON t4.makeid = t5.id WHERE t2.maker = "amc" AND t4.make = "hornet sportabout (sw)"
SELECT T1.Accelerate FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id  =  T2.MakeId WHERE T2.Make  =  'amc hornet sportabout (sw)';
============================

 11%|█         | 113/1034 [13:34<1:49:54,  7.16s/it]

SELECT t4.accelerate FROM car_names as t1 JOIN model_list as t2 ON t1.model = t2.model JOIN car_makers as t3 ON t2.maker = t3.id JOIN cars_data as t4 ON t1.makeid = t4.id WHERE t1.make = "amc" AND t1.model = "hornet sportabout (sw)"
SELECT T1.Accelerate FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id  =  T2.MakeId WHERE T2.Make  =  'amc hornet sportabout (sw)';
============================

 11%|█         | 114/1034 [13:41<1:49:48,  7.16s/it]

SELECT COUNT(*) FROM car_makers WHERE country = "france"
SELECT count(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country  =  T2.CountryId WHERE T2.CountryName  =  'france';
============================

 11%|█         | 115/1034 [13:49<1:49:56,  7.18s/it]

SELECT COUNT(*) FROM car_makers WHERE country = "France"
SELECT count(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country  =  T2.CountryId WHERE T2.CountryName  =  'france';
============================

 11%|█         | 116/1034 [13:56<1:50:06,  7.20s/it]

SELECT COUNT(*) FROM car_makers AS t1 JOIN countries AS t2 ON t1.country = t2.countryid WHERE t2.countryname = "usa"
SELECT count(*) FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker  =  T2.Id JOIN COUNTRIES AS T3 ON T2.Country  =  T3.CountryId WHERE T3.CountryName  =  'usa';
============================

 11%|█▏        | 117/1034 [14:03<1:50:11,  7.21s/it]

SELECT COUNT(*) FROM car_makers AS t1 JOIN countries AS t2 ON t1.country = t2.countryid WHERE t2.countryname = "usa"
SELECT count(*) FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker  =  T2.Id JOIN COUNTRIES AS T3 ON T2.Country  =  T3.CountryId WHERE T3.CountryName  =  'usa';
============================

 11%|█▏        | 118/1034 [14:10<1:50:11,  7.22s/it]

SELECT AVG(mpg) FROM cars_data WHERE cylinders = 4
SELECT avg(mpg) FROM CARS_DATA WHERE Cylinders  =  4;
============================

 12%|█▏        | 119/1034 [14:18<1:50:13,  7.23s/it]

SELECT AVG(mpg) FROM cars_data WHERE cylinders = 4
SELECT avg(mpg) FROM CARS_DATA WHERE Cylinders  =  4;
============================

 12%|█▏        | 120/1034 [14:25<1:50:09,  7.23s/it]

SELECT weight FROM cars_data WHERE cylinders = 8 AND year = 1974 ORDER BY weight ASC LIMIT 1
select min(weight) from cars_data where cylinders  =  8 and year  =  1974
============================

 12%|█▏        | 121/1034 [14:32<1:50:09,  7.24s/it]

SELECT MIN(weight) FROM cars_data WHERE cylinders = 8 AND year = 1974
select min(weight) from cars_data where cylinders  =  8 and year  =  1974
============================

 12%|█▏        | 122/1034 [14:39<1:49:27,  7.20s/it]

SELECT maker , model FROM model_list
SELECT Maker ,  Model FROM MODEL_LIST;
============================

 12%|█▏        | 123/1034 [14:46<1:49:30,  7.21s/it]

SELECT maker , model FROM model_list
SELECT Maker ,  Model FROM MODEL_LIST;
============================

 12%|█▏        | 124/1034 [14:54<1:49:17,  7.21s/it]

SELECT country , id FROM car_makers GROUP BY country HAVING COUNT(*) >= 1
SELECT T1.CountryName ,  T1.CountryId FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId  =  T2.Country GROUP BY T1.CountryId HAVING count(*)  >=  1;
============================

 12%|█▏        | 125/1034 [15:01<1:48:53,  7.19s/it]

SELECT DISTINCT t2.countryname , t2.countryid FROM car_makers as t1 JOIN countries as t2 ON t1.country = t2.countryid
SELECT T1.CountryName ,  T1.CountryId FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId  =  T2.Country GROUP BY T1.CountryId HAVING count(*)  >=  1;
============================

 12%|█▏        | 126/1034 [15:08<1:48:43,  7.18s/it]

SELECT COUNT(*) FROM cars_data WHERE horsepower > 150
SELECT count(*) FROM CARS_DATA WHERE horsepower  >  150;
============================

 12%|█▏        | 127/1034 [15:15<1:48:22,  7.17s/it]

SELECT COUNT(*) FROM cars_data WHERE horsepower > 150
SELECT count(*) FROM CARS_DATA WHERE horsepower  >  150;
============================

 12%|█▏        | 128/1034 [15:22<1:48:09,  7.16s/it]

SELECT AVG(weight) , year FROM cars_data GROUP BY year
SELECT avg(Weight) ,  YEAR FROM CARS_DATA GROUP BY YEAR;
============================

 12%|█▏        | 129/1034 [15:29<1:47:51,  7.15s/it]

SELECT AVG(weight) , AVG(year) FROM cars_data GROUP BY year
SELECT avg(Weight) ,  YEAR FROM CARS_DATA GROUP BY YEAR;
============================

 13%|█▎        | 130/1034 [15:37<1:48:14,  7.18s/it]

SELECT t2.countryname FROM car_makers as t1 JOIN countries as t2 ON t1.country = t2.countryid JOIN continents as t3 ON t2.continent = t3.contid WHERE t3.continent = "europe" GROUP BY t2.countryname HAVING COUNT(*) >= 3
SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CONTINENTS AS T2 ON T1.Continent  =  T2.ContId JOIN CAR_MAKERS AS T3 ON T1.CountryId  =  T3.Country WHERE T2.Continent  =  'europe' GROUP BY T1.CountryName HAVING count(*)  >=  3;
============================

 13%|█▎        | 131/1034 [15:44<1:48:30,  7.21s/it]

SELECT t3.countryname FROM car_makers as t1 JOIN countries as t3 ON t1.country = t3.countryid JOIN continents as t2 ON t3.continent = t2.contid WHERE t2.continent = "europe" GROUP BY t3.countryname HAVING COUNT(*) >= 3
SELECT T1.CountryName FROM COUNTRIES AS T1 JOIN CONTINENTS AS T2 ON T1.Continent  =  T2.ContId JOIN CAR_MAKERS AS T3 ON T1.CountryId  =  T3.Country WHERE T2.Continent  =  'europe' GROUP BY T1.CountryName HAVING count(*)  >=  3;
============================

 13%|█▎        | 132/1034 [15:51<1:48:36,  7.22s/it]

SELECT MAX(T2.horsepower) , T1.make FROM car_names as T1 JOIN cars_data as T2 ON T1.makeid = T2.id WHERE T2.cylinders = 3
SELECT T2.horsepower ,  T1.Make FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id WHERE T2.cylinders  =  3 ORDER BY T2.horsepower DESC LIMIT 1;
============================

 13%|█▎        | 133/1034 [15:59<1:49:13,  7.27s/it]

SELECT t1.maker , MAX(t2.horsepower) FROM car_makers as t1 JOIN model_list as t2 ON t1.id = t2.maker JOIN horsepower as t3 ON t2.model = t3.model WHERE t3.cylinders = 3
SELECT T2.horsepower ,  T1.Make FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id WHERE T2.cylinders  =  3 ORDER BY T2.horsepower DESC LIMIT 1;
============================

 13%|█▎        | 134/1034 [16:06<1:48:53,  7.26s/it]

SELECT t2.model FROM cars_data as t1 JOIN model_list as t2 ON t1.id = t2.modelid ORDER BY t1.mpg DESC LIMIT 1
SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id ORDER BY T2.mpg DESC LIMIT 1;
============================

 13%|█▎        | 135/1034 [16:13<1:48:33,  7.25s/it]

SELECT model FROM car_names ORDER BY mpg DESC LIMIT 1
select t1.model from car_names as t1 join cars_data as t2 on t1.makeid  =  t2.id order by t2.mpg desc limit 1;
============================

 13%|█▎        | 136/1034 [16:20<1:48:17,  7.24s/it]

SELECT AVG(horsepower) FROM cars_data WHERE year < 1980
SELECT avg(horsepower) FROM CARS_DATA WHERE YEAR  <  1980;
============================

 13%|█▎        | 137/1034 [16:27<1:48:03,  7.23s/it]

SELECT AVG(horsepower) FROM cars WHERE production_year < 1980
select avg(horsepower) from cars_data where year  <  1980;
============================

 13%|█▎        | 138/1034 [16:35<1:48:03,  7.24s/it]

SELECT AVG(t1.edispl) FROM cars_data as t1 JOIN model_list as t2 ON t1.id = t2.modelid JOIN car_makers as t3 ON t2.maker = t3.id WHERE t3.maker = "volvo"
SELECT avg(T2.edispl) FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id WHERE T1.Model  =  'volvo';
============================

 13%|█▎        | 139/1034 [16:42<1:48:06,  7.25s/it]

SELECT AVG(edispl) FROM cars WHERE maker = (SELECT id FROM car_makers WHERE maker = "volkswagen")
SELECT avg(T2.edispl) FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id WHERE T1.Model  =  'volvo';
============================

 14%|█▎        | 140/1034 [16:49<1:47:41,  7.23s/it]

SELECT MAX(accelerate) , cylinders FROM cars_data GROUP BY cylinders
SELECT max(Accelerate) ,  Cylinders FROM CARS_DATA GROUP BY Cylinders;
============================

 14%|█▎        | 141/1034 [16:56<1:47:27,  7.22s/it]

SELECT MAX(accelerate) , cylinders FROM cars_data GROUP BY cylinders
SELECT max(Accelerate) ,  Cylinders FROM CARS_DATA GROUP BY Cylinders;
============================

 14%|█▎        | 142/1034 [17:03<1:46:58,  7.20s/it]

SELECT model FROM model_list GROUP BY model ORDER BY COUNT(*) DESC LIMIT 1
SELECT Model FROM CAR_NAMES GROUP BY Model ORDER BY count(*) DESC LIMIT 1;
============================

 14%|█▍        | 143/1034 [17:11<1:46:44,  7.19s/it]

SELECT model FROM model_list GROUP BY model ORDER BY COUNT(*) DESC LIMIT 1
SELECT Model FROM CAR_NAMES GROUP BY Model ORDER BY count(*) DESC LIMIT 1;
============================

 14%|█▍        | 144/1034 [17:18<1:46:31,  7.18s/it]

SELECT COUNT(*) FROM cars_data WHERE cylinders > 4
SELECT count(*) FROM CARS_DATA WHERE Cylinders  >  4;
============================

 14%|█▍        | 145/1034 [17:25<1:46:19,  7.18s/it]

SELECT COUNT(*) FROM cars_data WHERE cylinders > 4
SELECT count(*) FROM CARS_DATA WHERE Cylinders  >  4;
============================

 14%|█▍        | 146/1034 [17:32<1:46:06,  7.17s/it]

```sql SELECT COUNT(*) FROM car_names WHERE make IN ( SELECT make FROM car_names WHERE model = "malibu" ) AND make IN ( SELECT make FROM car_names WHERE model = "satellite" ) AND make IN ( SELECT make FROM car_names WHERE model = "accord" ) AND make IN ( SELECT make FROM car_names WHERE model = "civic" ) AND make IN ( SELECT make FROM car_names WHERE model = "cr-v" ) AND make IN ( SELECT make FROM car_names WHERE model = "corolla" ) AND make IN ( SELECT make FROM car_names WHERE model = "camry" ) AND make IN ( SELECT make FROM car_names WHERE model = "prius" ) AND make IN ( SELECT make FROM car_names WHERE model = "4runner" ) AND make IN ( SELECT make FROM car_names WHERE model = "highlander" ) AND make IN ( SELECT make FROM car_names WHERE model = "rav4" ) AND make IN ( SELECT make FROM car_names WHERE
SELECT count(*) FROM CARS_DATA WHERE YEAR  =  1980;
============================

 14%|█▍        | 147/1034 [17:39<1:46:06,  7.18s/it]

SELECT COUNT(*) FROM cars_data WHERE year = 1980
SELECT count(*) FROM CARS_DATA WHERE YEAR  =  1980;
============================

 14%|█▍        | 148/1034 [17:47<1:46:06,  7.19s/it]

SELECT COUNT(*) FROM model_list as t1 JOIN car_makers as t2 ON t1.maker = t2.id WHERE t2.fullname = "American Motor Company"
SELECT count(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker WHERE T1.FullName  =  'American Motor Company';
============================

 14%|█▍        | 149/1034 [17:54<1:46:00,  7.19s/it]

SELECT COUNT(*) FROM model_list as t1 JOIN car_makers as t2 ON t1.maker = t2.id WHERE t2.maker = "amc"
SELECT count(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker WHERE T1.FullName  =  'American Motor Company';
============================

 15%|█▍        | 150/1034 [18:01<1:46:00,  7.19s/it]

SELECT fullname , id FROM car_makers WHERE id IN ( SELECT maker FROM car_models GROUP BY maker HAVING COUNT(*) > 3 )
SELECT T1.FullName ,  T1.Id FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker GROUP BY T1.Id HAVING count(*)  >  3;
============================

 15%|█▍        | 151/1034 [18:08<1:45:51,  7.19s/it]

SELECT maker , COUNT(*) FROM model_list GROUP BY maker HAVING COUNT(*) > 3
SELECT T1.FullName ,  T1.Id FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker GROUP BY T1.Id HAVING count(*)  >  3;
============================

 15%|█▍        | 152/1034 [18:15<1:45:49,  7.20s/it]

SELECT DISTINCT t2.model FROM car_makers as t1 JOIN model_list as t2 ON t1.id = t2.maker JOIN cars_data as t3 ON t2.modelid = t3.id WHERE t1.fullname = "General Motors" OR t3.weight > 3500
SELECT DISTINCT T2.Model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.Model  =  T2.Model JOIN CAR_MAKERS AS T3 ON T2.Maker  =  T3.Id JOIN CARS_DATA AS T4 ON T1.MakeId  =  T4.Id WHERE T3.FullName  =  'General Motors' OR T4.weight  >  3500;
============================

 15%|█▍        | 153/1034 [18:23<1:46:11,  7.23s/it]

SELECT DISTINCT t1.model FROM car_names as t1 JOIN model_list as t2 ON t1.model = t2.model JOIN cars_data as t3 ON t2.modelid = t3.id JOIN car_makers as t4 ON t2.maker = t4.id WHERE t4.maker = "General Motors" OR t3.weight > 3500
SELECT DISTINCT T2.Model FROM CAR_NAMES AS T1 JOIN MODEL_LIST AS T2 ON T1.Model  =  T2.Model JOIN CAR_MAKERS AS T3 ON T2.Maker  =  T3.Id JOIN CARS_DATA AS T4 ON T1.MakeId  =  T4.Id WHERE T3.FullName  =  'General Motors' OR T4.weight  >  3500;
============================

 15%|█▍        | 154/1034 [18:30<1:46:55,  7.29s/it]

SELECT year FROM cars_data WHERE weight >= 3000 AND weight <= 4000
select distinct year from cars_data where weight between 3000 and 4000;
============================

 15%|█▍        | 155/1034 [18:37<1:46:48,  7.29s/it]

SELECT DISTINCT year FROM cars_data WHERE weight < 4000 INTERSECT SELECT DISTINCT year FROM cars_data WHERE weight > 3000
select distinct year from cars_data where weight between 3000 and 4000;
============================

 15%|█▌        | 156/1034 [18:45<1:46:35,  7.28s/it]

SELECT horsepower FROM cars_data ORDER BY accelerate DESC LIMIT 1
SELECT T1.horsepower FROM CARS_DATA AS T1 ORDER BY T1.accelerate DESC LIMIT 1;
============================

 15%|█▌        | 157/1034 [18:52<1:46:21,  7.28s/it]

SELECT horsepower FROM cars_data ORDER BY accelerate DESC LIMIT 1
SELECT T1.horsepower FROM CARS_DATA AS T1 ORDER BY T1.accelerate DESC LIMIT 1;
============================

 15%|█▌        | 158/1034 [18:59<1:46:23,  7.29s/it]

SELECT t3.cylinders FROM car_names as t1 JOIN model_list as t2 ON t1.makeid = t2.modelid JOIN cars_data as t3 ON t1.makeid = t3.id WHERE t1.model = "volvo" ORDER BY t3.accelerate LIMIT 1
SELECT T1.cylinders FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id  =  T2.MakeId WHERE T2.Model  =  'volvo' ORDER BY T1.accelerate ASC LIMIT 1;
============================

 15%|█▌        | 159/1034 [19:06<1:45:36,  7.24s/it]

SELECT t3.cylinders FROM car_makers as t1 JOIN model_list as t2 ON t1.id = t2.maker JOIN cars_data as t3 ON t2.modelid = t3.id WHERE t1.maker = "volkswagen" AND t2.model = "volvo" ORDER BY t3.accelerate LIMIT 1
SELECT T1.cylinders FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id  =  T2.MakeId WHERE T2.Model  =  'volvo' ORDER BY T1.accelerate ASC LIMIT 1;
============================

 15%|█▌        | 160/1034 [19:13<1:45:09,  7.22s/it]

SELECT COUNT(*) FROM cars_data WHERE accelerate > (SELECT MAX(horsepower) FROM cars_data)
SELECT COUNT(*) FROM CARS_DATA WHERE Accelerate  >  ( SELECT Accelerate FROM CARS_DATA ORDER BY Horsepower DESC LIMIT 1 );
============================

 16%|█▌        | 161/1034 [19:21<1:44:39,  7.19s/it]

SELECT COUNT(*) FROM cars_data WHERE accelerate > (SELECT MAX(horsepower) FROM cars_data)
SELECT COUNT(*) FROM CARS_DATA WHERE Accelerate  >  ( SELECT Accelerate FROM CARS_DATA ORDER BY Horsepower DESC LIMIT 1 );
============================

 16%|█▌        | 162/1034 [19:28<1:44:17,  7.18s/it]

SELECT COUNT(DISTINCT country) FROM car_makers GROUP BY country HAVING COUNT(*) > 2
select count(*) from countries as t1 join car_makers as t2 on t1.countryid  =  t2.country group by t1.countryid having count(*)  >  2
============================

 16%|█▌        | 163/1034 [19:35<1:44:00,  7.16s/it]

SELECT COUNT(country) FROM ( SELECT country FROM car_makers GROUP BY country HAVING COUNT(*) > 2 )
select count(*) from countries as t1 join car_makers as t2 on t1.countryid  =  t2.country group by t1.countryid having count(*)  >  2
============================

 16%|█▌        | 164/1034 [19:42<1:44:01,  7.17s/it]

SELECT COUNT(*) FROM cars_data WHERE cylinders > 6
SELECT COUNT(*) FROM CARS_DATA WHERE Cylinders  >  6;
============================

 16%|█▌        | 165/1034 [19:49<1:43:41,  7.16s/it]

SELECT COUNT(*) FROM cars_data WHERE cylinders > 6
SELECT COUNT(*) FROM CARS_DATA WHERE Cylinders  >  6;
============================

 16%|█▌        | 166/1034 [19:56<1:43:23,  7.15s/it]

SELECT model FROM car_names as t1 JOIN cars_data as t2 ON t1.makeid = t2.id WHERE cylinders = 4 ORDER BY horsepower DESC LIMIT 1
SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id WHERE T2.Cylinders  =  4 ORDER BY T2.horsepower DESC LIMIT 1;
============================

 16%|█▌        | 167/1034 [20:03<1:43:07,  7.14s/it]

SELECT model FROM car_names as t1 JOIN cars_data as t2 ON t1.makeid = t2.id WHERE cylinders = 4 ORDER BY horsepower DESC LIMIT 1
SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id WHERE T2.Cylinders  =  4 ORDER BY T2.horsepower DESC LIMIT 1;
============================

 16%|█▌        | 168/1034 [20:11<1:42:55,  7.13s/it]

SELECT t1.makeid , t1.make FROM car_names as t1 JOIN cars_data as t2 ON t1.makeid = t2.id WHERE t2.horsepower > (SELECT MIN(horsepower) FROM cars_data) AND t2.cylinders <= 3
SELECT T2.MakeId ,  T2.Make FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id  =  T2.MakeId WHERE T1.Horsepower  >  (SELECT min(Horsepower) FROM CARS_DATA) AND T1.Cylinders  <=  3;
============================

 16%|█▋        | 169/1034 [20:18<1:42:48,  7.13s/it]

SELECT t1.makeid , t1.make FROM car_names as t1 JOIN cars_data as t2 ON t1.makeid = t2.id WHERE t2.horsepower < ( SELECT MIN(horsepower) FROM cars_data ) AND t2.cylinders < 4
select t2.makeid ,  t2.make from cars_data as t1 join car_names as t2 on t1.id  =  t2.makeid where t1.horsepower  >  (select min(horsepower) from cars_data) and t1.cylinders  <  4;
============================

 16%|█▋        | 170/1034 [20:25<1:42:36,  7.13s/it]

SELECT MAX(mpg) FROM cars_data WHERE cylinders = 8 OR year < 1980
select max(mpg) from cars_data where cylinders  =  8 or year  <  1980
============================

 17%|█▋        | 171/1034 [20:32<1:42:44,  7.14s/it]

SELECT MAX(mpg) FROM cars_data WHERE cylinders = 8 OR year < 1980
select max(mpg) from cars_data where cylinders  =  8 or year  <  1980
============================

 17%|█▋        | 172/1034 [20:39<1:43:00,  7.17s/it]

SELECT t1.model FROM car_names as t1 JOIN model_list as t2 ON t1.model = t2.model JOIN car_makers as t3 ON t2.maker = t3.id JOIN cars_data as t4 ON t1.makeid = t4.id WHERE t4.weight < 3500 AND t3.maker != 'ford motor company'
SELECT DISTINCT T1.model FROM MODEL_LIST AS T1 JOIN CAR_NAMES AS T2 ON T1.Model  =  T2.Model JOIN CARS_DATA AS T3 ON T2.MakeId  =  T3.Id JOIN CAR_MAKERS AS T4 ON T1.Maker  =  T4.Id WHERE T3.weight  <  3500 AND T4.FullName != 'Ford Motor Company';
============================

 17%|█▋        | 173/1034 [20:46<1:43:22,  7.20s/it]

SELECT DISTINCT t1.model FROM car_names as t1 JOIN model_list as t2 ON t1.model = t2.model JOIN car_makers as t3 ON t2.maker = t3.id JOIN cars_data as t4 ON t1.makeid = t4.id WHERE t4.weight < 3500 AND t3.maker != "ford"
SELECT DISTINCT T1.model FROM MODEL_LIST AS T1 JOIN CAR_NAMES AS T2 ON T1.Model  =  T2.Model JOIN CARS_DATA AS T3 ON T2.MakeId  =  T3.Id JOIN CAR_MAKERS AS T4 ON T1.Maker  =  T4.Id WHERE T3.weight  <  3500 AND T4.FullName != 'Ford Motor Company';
============================

 17%|█▋        | 174/1034 [20:54<1:43:38,  7.23s/it]

SELECT countryname FROM countries WHERE countryid NOT IN (SELECT country FROM car_makers)
SELECT CountryName FROM countries EXCEPT SELECT T1.CountryName FROM countries AS T1 JOIN CAR_MAKERS AS T2 ON T1.countryId  =  T2.Country;
============================

 17%|█▋        | 175/1034 [21:01<1:43:36,  7.24s/it]

SELECT countryname FROM countries WHERE countryid NOT IN (SELECT country FROM car_makers)
SELECT CountryName FROM countries EXCEPT SELECT T1.CountryName FROM countries AS T1 JOIN CAR_MAKERS AS T2 ON T1.countryId  =  T2.Country;
============================

 17%|█▋        | 176/1034 [21:08<1:43:25,  7.23s/it]

SELECT id , maker FROM car_makers GROUP BY maker HAVING COUNT(*) >= 2 AND COUNT(*) >= 3
select t1.id ,  t1.maker from car_makers as t1 join model_list as t2 on t1.id  =  t2.maker group by t1.id having count(*)  >=  2 intersect select t1.id ,  t1.maker from car_makers as t1 join model_list as t2 on t1.id  =  t2.maker join car_names as t3 on t2.model  =  t3.model group by t1.id having count(*)  >  3;
============================

 17%|█▋        | 177/1034 [21:16<1:43:20,  7.24s/it]

SELECT t1.id , t1.maker FROM car_makers as t1 JOIN model_list as t2 ON t1.id = t2.maker GROUP BY t2.maker HAVING COUNT(*) >= 2 AND COUNT(model) > 3
SELECT T1.Id ,  T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker GROUP BY T1.Id HAVING count(*)  >=  2 INTERSECT SELECT T1.Id ,  T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker JOIN CAR_NAMES AS T3 ON T2.model  =  T3.model GROUP BY T1.Id HAVING count(*)  >  3;
============================

 17%|█▋        | 178/1034 [21:23<1:43:08,  7.23s/it]

SELECT t3.countryid , t3.countryname FROM model_list as t1 JOIN car_makers as t2 ON t1.maker = t2.id JOIN countries as t3 ON t2.country = t3.countryid GROUP BY t3.countryid HAVING COUNT(*) > 3 UNION SELECT t3.countryid , t3.countryname FROM model_list as t1 JOIN car_makers as t2 ON t1.maker = t2.id JOIN countries as t3 ON t2.country = t3.countryid WHERE t1.model = "fiat" GROUP BY t3.countryid HAVING COUNT(*) > 3
SELECT T1.countryId ,  T1.CountryName FROM Countries AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId  =  T2.Country GROUP BY T1.countryId HAVING count(*)  >  3 UNION SELECT T1.countryId ,  T1.CountryName FROM Countries AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId  =  T2.Country JOIN MODEL_LIST AS T3 ON T2.Id  =  T3.Maker WHERE T3.Model  =  'fiat';
============================

 17%|█▋        | 179/1034 [21:30<1:43:03,  7.23s/it]

SELECT countryid , countryname FROM countries WHERE countryid IN (SELECT country FROM car_makers GROUP BY country HAVING COUNT(*) > 3) UNION SELECT country FROM car_makers WHERE maker = "fiat"
select t1.countryid ,  t1.countryname from countries as t1 join car_makers as t2 on t1.countryid  =  t2.country group by t1.countryid having count(*)  >  3 union select t1.countryid ,  t1.countryname from countries as t1 join car_makers as t2 on t1.countryid  =  t2.country join model_list as t3 on t2.id  =  t3.maker where t3.model  =  'fiat';
============================

 17%|█▋        | 180/1034 [21:37<1:42:49,  7.22s/it]

SELECT country FROM airlines WHERE airline = "JetBlue Airways"
SELECT Country FROM AIRLINES WHERE Airline  =  "JetBlue Airways"
============================

 18%|█▊        | 181/1034 [21:44<1:42:11,  7.19s/it]

SELECT country FROM airlines WHERE airline = "Jetblue Airways"
SELECT Country FROM AIRLINES WHERE Airline  =  "JetBlue Airways"
============================

 18%|█▊        | 182/1034 [21:51<1:41:47,  7.17s/it]

SELECT abbreviation FROM airlines WHERE airline = "JetBlue Airways"
SELECT Abbreviation FROM AIRLINES WHERE Airline  =  "JetBlue Airways"
============================

 18%|█▊        | 183/1034 [21:58<1:41:24,  7.15s/it]

SELECT abbreviation FROM airlines WHERE airline = "Jetblue Airways"
SELECT Abbreviation FROM AIRLINES WHERE Airline  =  "JetBlue Airways"
============================

 18%|█▊        | 184/1034 [22:06<1:41:12,  7.14s/it]

SELECT airline , abbreviation FROM airlines WHERE country = "USA"
SELECT Airline ,  Abbreviation FROM AIRLINES WHERE Country  =  "USA"
============================

 18%|█▊        | 185/1034 [22:13<1:40:55,  7.13s/it]

SELECT airline , abbreviation FROM airlines WHERE country = "USA"
SELECT Airline ,  Abbreviation FROM AIRLINES WHERE Country  =  "USA"
============================

 18%|█▊        | 186/1034 [22:20<1:40:56,  7.14s/it]

SELECT airportcode , airportname FROM airports WHERE city = "Anthony"
SELECT AirportCode ,  AirportName FROM AIRPORTS WHERE city  =  "Anthony"
============================

 18%|█▊        | 187/1034 [22:27<1:40:59,  7.15s/it]

SELECT airportcode , airportname FROM airports WHERE city = "Anthony"
SELECT AirportCode ,  AirportName FROM AIRPORTS WHERE city  =  "Anthony"
============================

 18%|█▊        | 188/1034 [22:34<1:41:00,  7.16s/it]

SELECT COUNT(*) FROM airlines
SELECT count(*) FROM AIRLINES
============================

 18%|█▊        | 189/1034 [22:41<1:41:04,  7.18s/it]

SELECT COUNT(*) FROM airlines
SELECT count(*) FROM AIRLINES
============================

 18%|█▊        | 190/1034 [22:49<1:40:56,  7.18s/it]

SELECT COUNT(*) FROM airports
SELECT count(*) FROM AIRPORTS
============================

 18%|█▊        | 191/1034 [22:56<1:40:41,  7.17s/it]

SELECT COUNT(*) FROM airports
SELECT count(*) FROM AIRPORTS
============================

 19%|█▊        | 192/1034 [23:03<1:40:23,  7.15s/it]

SELECT COUNT(*) FROM flights
SELECT count(*) FROM FLIGHTS
============================

 19%|█▊        | 193/1034 [23:10<1:40:08,  7.14s/it]

SELECT COUNT(*) FROM flights
SELECT count(*) FROM FLIGHTS
============================

 19%|█▉        | 194/1034 [23:17<1:39:56,  7.14s/it]

SELECT airline FROM airlines WHERE abbreviation = 'UAL' LIMIT 1
SELECT Airline FROM AIRLINES WHERE Abbreviation  =  "UAL"
============================

 19%|█▉        | 195/1034 [23:24<1:39:45,  7.13s/it]

SELECT airline FROM airlines WHERE abbreviation = 'UAL' LIMIT 1
SELECT Airline FROM AIRLINES WHERE Abbreviation  =  "UAL"
============================

 19%|█▉        | 196/1034 [23:31<1:39:39,  7.14s/it]

SELECT COUNT(*) FROM airlines WHERE country = "USA"
SELECT count(*) FROM AIRLINES WHERE Country  =  "USA"
============================

 19%|█▉        | 197/1034 [23:39<1:39:58,  7.17s/it]

SELECT COUNT(*) FROM airlines WHERE country = "USA"
SELECT count(*) FROM AIRLINES WHERE Country  =  "USA"
============================

 19%|█▉        | 198/1034 [23:46<1:39:44,  7.16s/it]

SELECT city , country FROM airports WHERE airportname = "Alton Airport" LIMIT 1
SELECT City ,  Country FROM AIRPORTS WHERE AirportName  =  "Alton"
============================

 19%|█▉        | 199/1034 [23:53<1:39:46,  7.17s/it]

SELECT city , country FROM airports WHERE airportname = "Alton"
SELECT City ,  Country FROM AIRPORTS WHERE AirportName  =  "Alton"
============================

 19%|█▉        | 200/1034 [24:00<1:39:38,  7.17s/it]

SELECT airportname FROM airports WHERE airportcode = 'AKO' LIMIT 1
SELECT AirportName FROM AIRPORTS WHERE AirportCode  =  "AKO"
============================

 19%|█▉        | 201/1034 [24:07<1:39:32,  7.17s/it]

SELECT airportname FROM airports WHERE airportcode = 'AKO' LIMIT 1
SELECT AirportName FROM AIRPORTS WHERE AirportCode  =  "AKO"
============================

 20%|█▉        | 202/1034 [24:14<1:39:19,  7.16s/it]

SELECT airportname FROM airports WHERE city = 'Aberdeen'
SELECT AirportName FROM AIRPORTS WHERE City = "Aberdeen"
============================

 20%|█▉        | 203/1034 [24:22<1:39:19,  7.17s/it]

SELECT airportname FROM airports WHERE city = "Aberdeen"
SELECT AirportName FROM AIRPORTS WHERE City = "Aberdeen"
============================

 20%|█▉        | 204/1034 [24:29<1:38:56,  7.15s/it]

SELECT COUNT(*) FROM flights WHERE origin = 'APG'
SELECT count(*) FROM FLIGHTS WHERE SourceAirport  =  "APG"
============================

 20%|█▉        | 205/1034 [24:36<1:39:04,  7.17s/it]

SELECT COUNT(*) FROM flights WHERE sourceairport = 'APG'
SELECT count(*) FROM FLIGHTS WHERE SourceAirport  =  "APG"
============================

 20%|█▉        | 206/1034 [24:43<1:38:58,  7.17s/it]

SELECT COUNT(*) FROM flights WHERE destination = "ATO"
SELECT count(*) FROM FLIGHTS WHERE DestAirport  =  "ATO"
============================

 20%|██        | 207/1034 [24:50<1:38:51,  7.17s/it]

SELECT COUNT(*) FROM flights WHERE destairport = "ATO"
SELECT count(*) FROM FLIGHTS WHERE DestAirport  =  "ATO"
============================

 20%|██        | 208/1034 [24:58<1:39:13,  7.21s/it]

SELECT COUNT(*) FROM flights WHERE departure_city = "Aberdeen"
SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.SourceAirport  =  T2.AirportCode WHERE T2.City  =  "Aberdeen"
============================

 20%|██        | 209/1034 [25:05<1:39:21,  7.23s/it]

SELECT COUNT(*) FROM flights AS t1 JOIN airports AS t2 ON t1.sourceairport = t2.airportcode WHERE t2.city = "Aberdeen"
SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.SourceAirport  =  T2.AirportCode WHERE T2.City  =  "Aberdeen"
============================

 20%|██        | 210/1034 [25:12<1:39:26,  7.24s/it]

SELECT COUNT(*) FROM flights AS t1 JOIN airports AS t2 ON t1.destairport = t2.airportcode WHERE t2.city = "Aberdeen"
SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport  =  T2.AirportCode WHERE T2.City  =  "Aberdeen"
============================

 20%|██        | 211/1034 [25:19<1:39:04,  7.22s/it]

SELECT COUNT(*) FROM flights AS t1 JOIN airports AS t2 ON t1.destairport = t2.airportcode WHERE t2.city = "Aberdeen"
SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport  =  T2.AirportCode WHERE T2.City  =  "Aberdeen"
============================

 21%|██        | 212/1034 [25:27<1:38:43,  7.21s/it]

SELECT COUNT(*) FROM flights AS t1 JOIN airports AS t2 ON t1.sourceairport = t2.airportcode JOIN airports AS t3 ON t1.destairport = t3.airportcode WHERE t2.city = 'Aberdeen' AND t3.city = 'Ashley'
SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport  =  T2.AirportCode JOIN AIRPORTS AS T3 ON T1.SourceAirport  =  T3.AirportCode WHERE T2.City  =  "Ashley" AND T3.City  =  "Aberdeen"
============================

 21%|██        | 213/1034 [25:34<1:38:28,  7.20s/it]

SELECT COUNT(*) FROM flights AS t1 JOIN airports AS t2 ON t1.origin = t2.code JOIN airports AS t3 ON t1.dest = t3.code WHERE t2.city = "Aberdeen" AND t3.city = "Ashley"
SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport  =  T2.AirportCode JOIN AIRPORTS AS T3 ON T1.SourceAirport  =  T3.AirportCode WHERE T2.City  =  "Ashley" AND T3.City  =  "Aberdeen"
============================

 21%|██        | 214/1034 [25:41<1:38:20,  7.20s/it]

SELECT COUNT(*) FROM airlines WHERE airline = 'JetBlue Airways'
SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline  =  T2.uid WHERE T2.Airline = "JetBlue Airways"
============================

 21%|██        | 215/1034 [25:48<1:38:28,  7.21s/it]

SELECT COUNT(*) FROM airlines WHERE airline = "Jetblue Airways"
SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T1.Airline  =  T2.uid WHERE T2.Airline = "JetBlue Airways"
============================

 21%|██        | 216/1034 [25:55<1:38:36,  7.23s/it]

SELECT COUNT(*) FROM flights AS t1 JOIN airports AS t2 ON t1.destairport = t2.airportcode JOIN airlines AS t3 ON t1.airline = t3.airline WHERE t3.abbreviation = 'UAL' AND t2.airportname = 'ASY'
SELECT count(*) FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T2.Airline  =  T1.uid WHERE T1.Airline  =  "United Airlines" AND T2.DestAirport  =  "ASY"
============================

 21%|██        | 217/1034 [26:03<1:38:38,  7.24s/it]

SELECT COUNT(*) FROM flights AS t1 JOIN airlines AS t2 ON t1.airline = t2.airline WHERE t2.abbreviation = "UAL" AND t1.destairport = "ASY"
SELECT count(*) FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T2.Airline  =  T1.uid WHERE T1.Airline  =  "United Airlines" AND T2.DestAirport  =  "ASY"
============================

 21%|██        | 218/1034 [26:10<1:38:24,  7.24s/it]

SELECT COUNT(*) FROM flights AS t1 JOIN airlines AS t2 ON t1.airline = t2.airline JOIN airports AS t3 ON t1.sourceairport = t3.airportcode WHERE t2.abbreviation = 'UAL' AND t3.airportcode = 'AHD'
SELECT count(*) FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T2.Airline  =  T1.uid WHERE T1.Airline  =  "United Airlines" AND T2.SourceAirport  =  "AHD"
============================

 21%|██        | 219/1034 [26:17<1:37:45,  7.20s/it]

SELECT COUNT(*) FROM flights AS t1 JOIN airports AS t2 ON t1.sourceairport = t2.airportcode JOIN airlines AS t3 ON t1.airline = t3.airline WHERE t2.city = "Aberdeen" AND t3.country = "USA" AND t3.abbreviation = "UAL"
SELECT count(*) FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T2.Airline  =  T1.uid WHERE T1.Airline  =  "United Airlines" AND T2.SourceAirport  =  "AHD"
============================

 21%|██▏       | 220/1034 [26:24<1:37:32,  7.19s/it]

SELECT COUNT(DISTINCT t1.flightno) FROM flights as t1 JOIN airlines as t2 ON t1.airline = t2.airline JOIN airports as t3 ON t1.destairport = t3.airportcode WHERE t3.city = 'Aberdeen' AND t2.abbreviation = 'UAL'
SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport  =  T2.AirportCode JOIN AIRLINES AS T3 ON T3.uid  =  T1.Airline WHERE T2.City  =  "Aberdeen" AND T3.Airline  =  "United Airlines"
============================

 21%|██▏       | 221/1034 [26:31<1:37:11,  7.17s/it]

SELECT COUNT(*) FROM flights AS t1 JOIN airports AS t2 ON t1.destairport = t2.airportcode JOIN airlines AS t3 ON t1.airline = t3.airline WHERE t2.city = "Aberdeen" AND t3.country = "USA" AND t3.abbreviation = "UAL"
SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport  =  T2.AirportCode JOIN AIRLINES AS T3 ON T3.uid  =  T1.Airline WHERE T2.City  =  "Aberdeen" AND T3.Airline  =  "United Airlines"
============================

 21%|██▏       | 222/1034 [26:38<1:36:55,  7.16s/it]

SELECT t2.city FROM flights as t1 JOIN airports as t2 ON t1.destairport = t2.airportcode GROUP BY t2.city ORDER BY COUNT(*) DESC LIMIT 1
SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode  =  T2.DestAirport GROUP BY T1.City ORDER BY count(*) DESC LIMIT 1
============================

 22%|██▏       | 223/1034 [26:46<1:36:38,  7.15s/it]

SELECT t2.city FROM flights as t1 JOIN airports as t2 ON t1.destairport = t2.airportcode GROUP BY t2.city ORDER BY COUNT(*) DESC LIMIT 1
SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode  =  T2.DestAirport GROUP BY T1.City ORDER BY count(*) DESC LIMIT 1
============================

 22%|██▏       | 224/1034 [26:53<1:36:21,  7.14s/it]

SELECT t2.city FROM flights as t1 JOIN airports as t2 ON t1.sourceairport = t2.airportcode GROUP BY t2.city ORDER BY COUNT(*) DESC LIMIT 1
SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode  =  T2.SourceAirport GROUP BY T1.City ORDER BY count(*) DESC LIMIT 1
============================

 22%|██▏       | 225/1034 [27:00<1:36:16,  7.14s/it]

SELECT t2.city FROM flights as t1 JOIN airports as t2 ON t1.sourceairport = t2.airportcode GROUP BY t2.city ORDER BY COUNT(*) DESC LIMIT 1
SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode  =  T2.SourceAirport GROUP BY T1.City ORDER BY count(*) DESC LIMIT 1
============================

 22%|██▏       | 226/1034 [27:07<1:36:06,  7.14s/it]

SELECT destairport FROM flights GROUP BY destairport ORDER BY COUNT(*) DESC LIMIT 1
SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode  =  T2.DestAirport OR T1.AirportCode  =  T2.SourceAirport GROUP BY T1.AirportCode ORDER BY count(*) DESC LIMIT 1
============================

 22%|██▏       | 227/1034 [27:14<1:35:57,  7.13s/it]

SELECT T2.airportcode FROM flights as T1 JOIN airports as T2 ON T1.sourceairport = T2.airportcode GROUP BY T2.airportcode ORDER BY COUNT(*) DESC LIMIT 1
SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode  =  T2.DestAirport OR T1.AirportCode  =  T2.SourceAirport GROUP BY T1.AirportCode ORDER BY count(*) DESC LIMIT 1
============================

 22%|██▏       | 228/1034 [27:21<1:35:45,  7.13s/it]

SELECT destairport FROM flights GROUP BY destairport ORDER BY COUNT(*) ASC LIMIT 1
SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode  =  T2.DestAirport OR T1.AirportCode  =  T2.SourceAirport GROUP BY T1.AirportCode ORDER BY count(*) LIMIT 1
============================

 22%|██▏       | 229/1034 [27:28<1:35:30,  7.12s/it]

SELECT destairport FROM flights GROUP BY destairport ORDER BY COUNT(*) ASC LIMIT 1
SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode  =  T2.DestAirport OR T1.AirportCode  =  T2.SourceAirport GROUP BY T1.AirportCode ORDER BY count(*) LIMIT 1
============================

 22%|██▏       | 230/1034 [27:35<1:35:23,  7.12s/it]

SELECT airline FROM flights GROUP BY airline ORDER BY COUNT(*) DESC LIMIT 1
SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid  =  T2.Airline GROUP BY T1.Airline ORDER BY count(*) DESC LIMIT 1
============================

 22%|██▏       | 231/1034 [27:43<1:35:12,  7.11s/it]

SELECT T2.airline FROM flights as T1 JOIN airlines as T2 ON T1.airline = T2.airline GROUP BY T2.airline ORDER BY COUNT(*) DESC LIMIT 1
SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid  =  T2.Airline GROUP BY T1.Airline ORDER BY count(*) DESC LIMIT 1
============================

 22%|██▏       | 232/1034 [27:50<1:35:15,  7.13s/it]

SELECT T2.abbreviation , T2.country FROM flights AS T1 JOIN airlines AS T2 ON T1.airline = T2.airline GROUP BY T2.airline ORDER BY COUNT(*) ASC LIMIT 1
SELECT T1.Abbreviation ,  T1.Country FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid  =  T2.Airline GROUP BY T1.Airline ORDER BY count(*) LIMIT 1
============================

 23%|██▎       | 233/1034 [27:57<1:35:08,  7.13s/it]

SELECT t2.abbreviation , t2.country FROM flights as t1 JOIN airlines as t2 ON t1.airline = t2.airline GROUP BY t2.airline ORDER BY COUNT(*) ASC LIMIT 1
SELECT T1.Abbreviation ,  T1.Country FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid  =  T2.Airline GROUP BY T1.Airline ORDER BY count(*) LIMIT 1
============================

 23%|██▎       | 234/1034 [28:04<1:35:00,  7.13s/it]

SELECT DISTINCT t1.airline FROM airlines as t1 JOIN flights as t2 ON t1.uid = t2.airline JOIN airports as t3 ON t2.sourceairport = t3.airportcode WHERE t3.airportcode = 'AHD'
SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid  =  T2.Airline WHERE T2.SourceAirport  =  "AHD"
============================

 23%|██▎       | 235/1034 [28:11<1:34:57,  7.13s/it]

SELECT DISTINCT t3.country FROM flights as t1 JOIN airports as t2 ON t1.sourceairport = t2.airportcode JOIN airlines as t3 ON t1.airline = t3.airline WHERE t2.city = "Aberdeen"
SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid  =  T2.Airline WHERE T2.SourceAirport  =  "AHD"
============================

 23%|██▎       | 236/1034 [28:18<1:34:39,  7.12s/it]

SELECT airline FROM flights WHERE dest = 'AHD'
SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid  =  T2.Airline WHERE T2.DestAirport  =  "AHD"
============================

 23%|██▎       | 237/1034 [28:25<1:34:29,  7.11s/it]

SELECT DISTINCT t2.airline FROM flights as t1 JOIN airlines as t2 ON t1.airline = t2.airline WHERE t1.destairport = "AHD"
SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid  =  T2.Airline WHERE T2.DestAirport  =  "AHD"
============================

 23%|██▎       | 238/1034 [28:32<1:34:38,  7.13s/it]

SELECT DISTINCT t3.country FROM flights as t1 JOIN airports as t2 ON t1.sourceairport = t2.airportcode JOIN airlines as t3 ON t1.airline = t3.airline WHERE t2.airportcode = 'APG' INTERSECT SELECT DISTINCT t3.country FROM flights as t1 JOIN airports as t2 ON t1.destairport = t2.airportcode JOIN airlines as t3 ON t1.airline = t3.airline WHERE t2.airportcode = 'CVO'
SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid  =  T2.Airline WHERE T2.SourceAirport  =  "APG" INTERSECT SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid  =  T2.Airline WHERE T2.SourceAirport  =  "CVO"
============================

 23%|██▎       | 239/1034 [28:40<1:34:40,  7.14s/it]

SELECT DISTINCT t2.airline FROM flights as t1 JOIN airlines as t2 ON t1.airline = t2.airline WHERE t1.sourceairport = "APG" INTERSECT SELECT DISTINCT t2.airline FROM flights as t1 JOIN airlines as t2 ON t1.airline = t2.airline WHERE t1.sourceairport = "CVO"
SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid  =  T2.Airline WHERE T2.SourceAirport  =  "APG" INTERSECT SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid  =  T2.Airline WHERE T2.SourceAirport  =  "CVO"
============================

 23%|██▎       | 240/1034 [28:47<1:35:03,  7.18s/it]

SELECT DISTINCT t2.airline FROM flights as t1 JOIN airlines as t2 ON t1.airline = t2.airline WHERE t1.sourceairport = 'CVO' EXCEPT SELECT DISTINCT t2.airline FROM flights as t1 JOIN airlines as t2 ON t1.airline = t2.airline WHERE t1.sourceairport = 'APG'
SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid  =  T2.Airline WHERE T2.SourceAirport  =  "CVO" EXCEPT SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid  =  T2.Airline WHERE T2.SourceAirport  =  "APG"
============================

 23%|██▎       | 241/1034 [28:54<1:34:52,  7.18s/it]

SELECT DISTINCT t2.airline FROM flights as t1 JOIN airlines as t2 ON t1.airline = t2.airline WHERE t1.sourceairport = "CVO" EXCEPT SELECT DISTINCT t2.airline FROM flights as t1 JOIN airlines as t2 ON t1.airline = t2.airline WHERE t1.sourceairport = "APG"
SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid  =  T2.Airline WHERE T2.SourceAirport  =  "CVO" EXCEPT SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid  =  T2.Airline WHERE T2.SourceAirport  =  "APG"
============================

 23%|██▎       | 242/1034 [29:01<1:34:36,  7.17s/it]

SELECT t2.airline FROM flights as t1 JOIN airlines as t2 ON t1.airline = t2.airline GROUP BY t2.airline HAVING COUNT(*) >= 10
SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid  =  T2.Airline GROUP BY T1.Airline HAVING count(*)  >  10
============================

 24%|██▎       | 243/1034 [29:08<1:34:31,  7.17s/it]

SELECT airline FROM flights GROUP BY airline HAVING COUNT(*) >= 10
SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid  =  T2.Airline GROUP BY T1.Airline HAVING count(*)  >  10
============================

 24%|██▎       | 244/1034 [29:15<1:34:06,  7.15s/it]

SELECT airline FROM flights GROUP BY airline HAVING COUNT(*) < 200
SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid  =  T2.Airline GROUP BY T1.Airline HAVING count(*)  <  200
============================

 24%|██▎       | 245/1034 [29:23<1:33:50,  7.14s/it]

SELECT airline FROM flights GROUP BY airline HAVING COUNT(*) < 200
SELECT T1.Airline FROM AIRLINES AS T1 JOIN FLIGHTS AS T2 ON T1.uid  =  T2.Airline GROUP BY T1.Airline HAVING count(*)  <  200
============================

 24%|██▍       | 246/1034 [29:30<1:33:47,  7.14s/it]

SELECT flightno FROM flights WHERE airline = (SELECT uid FROM airlines WHERE airline = "United Airlines")
SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T2.uid  =  T1.Airline WHERE T2.Airline  =  "United Airlines"
============================

 24%|██▍       | 247/1034 [29:37<1:33:39,  7.14s/it]

SELECT flight_number FROM airlines WHERE name = "United Airlines"
SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRLINES AS T2 ON T2.uid  =  T1.Airline WHERE T2.Airline  =  "United Airlines"
============================

 24%|██▍       | 248/1034 [29:44<1:33:54,  7.17s/it]

SELECT flightno FROM flights WHERE sourceairport = "APG"
SELECT FlightNo FROM FLIGHTS WHERE SourceAirport  =  "APG"
============================

 24%|██▍       | 249/1034 [29:51<1:33:54,  7.18s/it]

SELECT flightno FROM flights WHERE sourceairport = "APG"
SELECT FlightNo FROM FLIGHTS WHERE SourceAirport  =  "APG"
============================

 24%|██▍       | 250/1034 [29:59<1:33:56,  7.19s/it]

SELECT flight_number FROM flights WHERE destination = "APG"
SELECT FlightNo FROM FLIGHTS WHERE DestAirport  =  "APG"
============================

 24%|██▍       | 251/1034 [30:06<1:33:57,  7.20s/it]

SELECT flightno FROM flights WHERE destairport = "APG"
SELECT FlightNo FROM FLIGHTS WHERE DestAirport  =  "APG"
============================

 24%|██▍       | 252/1034 [30:13<1:34:03,  7.22s/it]

SELECT flightno FROM flights AS t1 JOIN airports AS t2 ON t1.sourceairport = t2.airportcode WHERE t2.city = "Aberdeen"
SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.SourceAirport   =  T2.AirportCode WHERE T2.City  =  "Aberdeen"
============================

 24%|██▍       | 253/1034 [30:20<1:34:09,  7.23s/it]

SELECT flightno FROM flights WHERE sourceairport = "APG"
SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.SourceAirport   =  T2.AirportCode WHERE T2.City  =  "Aberdeen"
============================

 25%|██▍       | 254/1034 [30:27<1:33:51,  7.22s/it]

SELECT flightno FROM flights AS t1 JOIN airports AS t2 ON t1.destairport = t2.airportcode WHERE t2.city = "Aberdeen"
SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport   =  T2.AirportCode WHERE T2.City  =  "Aberdeen"
============================

 25%|██▍       | 255/1034 [30:35<1:33:27,  7.20s/it]

SELECT flightno FROM flights WHERE destairport = (SELECT airportcode FROM airports WHERE city = "Aberdeen")
SELECT T1.FlightNo FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport   =  T2.AirportCode WHERE T2.City  =  "Aberdeen"
============================

 25%|██▍       | 256/1034 [30:42<1:33:05,  7.18s/it]

SELECT COUNT(*) FROM flights AS t1 JOIN airports AS t2 ON t1.destairport = t2.airportcode WHERE t2.city = "Aberdeen" OR t2.city = "Abilene"
SELECT count(*) FROM Flights AS T1 JOIN Airports AS T2 ON T1.DestAirport  =  T2.AirportCode WHERE T2.city  =  "Aberdeen" OR T2.city  =  "Abilene"
============================

 25%|██▍       | 257/1034 [30:49<1:32:44,  7.16s/it]

SELECT COUNT(*) FROM flights AS t1 JOIN airports AS t2 ON t1.destairport = t2.airportcode WHERE t2.city = "Aberdeen" OR t2.city = "Abilene"
SELECT count(*) FROM Flights AS T1 JOIN Airports AS T2 ON T1.DestAirport  =  T2.AirportCode WHERE T2.city  =  "Aberdeen" OR T2.city  =  "Abilene"
============================

 25%|██▍       | 258/1034 [30:56<1:32:32,  7.15s/it]

SELECT airportname FROM airports EXCEPT SELECT t2.airportname FROM flights as t1 JOIN airports as t2 ON t1.sourceairport = t2.airportcode UNION SELECT t2.airportname FROM flights as t1 JOIN airports as t2 ON t1.destairport = t2.airportcode
SELECT AirportName FROM Airports WHERE AirportCode NOT IN (SELECT SourceAirport FROM Flights UNION SELECT DestAirport FROM Flights)
============================

 25%|██▌       | 259/1034 [31:03<1:32:37,  7.17s/it]

SELECT airportname FROM airports EXCEPT SELECT t2.airportname FROM flights as t1 JOIN airports as t2 ON t1.sourceairport = t2.airportcode UNION SELECT t2.airportname FROM flights as t1 JOIN airports as t2 ON t1.destairport = t2.airportcode
SELECT AirportName FROM Airports WHERE AirportCode NOT IN (SELECT SourceAirport FROM Flights UNION SELECT DestAirport FROM Flights)
============================

 25%|██▌       | 260/1034 [31:10<1:32:20,  7.16s/it]

SELECT COUNT(*) FROM employee
SELECT count(*) FROM employee
============================

 25%|██▌       | 261/1034 [31:18<1:32:24,  7.17s/it]

SELECT COUNT(*) FROM employee
SELECT count(*) FROM employee
============================

 25%|██▌       | 262/1034 [31:25<1:32:36,  7.20s/it]

SELECT name FROM employee ORDER BY age ASC
SELECT name FROM employee ORDER BY age
============================

 25%|██▌       | 263/1034 [31:32<1:32:23,  7.19s/it]

SELECT name FROM employee ORDER BY age ASC
SELECT name FROM employee ORDER BY age
============================

 26%|██▌       | 264/1034 [31:39<1:32:25,  7.20s/it]

SELECT COUNT(*) , city FROM employee GROUP BY city
SELECT count(*) ,  city FROM employee GROUP BY city
============================

 26%|██▌       | 265/1034 [31:46<1:32:17,  7.20s/it]

SELECT COUNT(*) , city FROM employee GROUP BY city
SELECT count(*) ,  city FROM employee GROUP BY city
============================

 26%|██▌       | 266/1034 [31:54<1:32:13,  7.21s/it]

SELECT city FROM employee WHERE age < 30 GROUP BY city HAVING COUNT(*) > 1
SELECT city FROM employee WHERE age  <  30 GROUP BY city HAVING count(*)  >  1
============================

 26%|██▌       | 267/1034 [32:01<1:32:03,  7.20s/it]

SELECT city FROM employee WHERE age < 30 GROUP BY city HAVING COUNT(*) > 1
SELECT city FROM employee WHERE age  <  30 GROUP BY city HAVING count(*)  >  1
============================

 26%|██▌       | 268/1034 [32:08<1:32:19,  7.23s/it]

SELECT location , COUNT(*) FROM shop GROUP BY location
SELECT count(*) ,  LOCATION FROM shop GROUP BY LOCATION
============================

 26%|██▌       | 269/1034 [32:15<1:32:39,  7.27s/it]

SELECT COUNT(*) , location FROM shop GROUP BY location
SELECT count(*) ,  LOCATION FROM shop GROUP BY LOCATION
============================

 26%|██▌       | 270/1034 [32:23<1:32:47,  7.29s/it]

SELECT manager_name , district FROM shop ORDER BY number_products DESC LIMIT 1
SELECT manager_name ,  district FROM shop ORDER BY number_products DESC LIMIT 1
============================

 26%|██▌       | 271/1034 [32:30<1:32:30,  7.27s/it]

SELECT manager_name , district FROM shop ORDER BY number_products DESC LIMIT 1
SELECT manager_name ,  district FROM shop ORDER BY number_products DESC LIMIT 1
============================

 26%|██▋       | 272/1034 [32:37<1:32:24,  7.28s/it]

SELECT MIN(number_products) , MAX(number_products) FROM shop
SELECT min(Number_products) ,  max(Number_products) FROM shop
============================

 26%|██▋       | 273/1034 [32:45<1:32:12,  7.27s/it]

SELECT MIN(product_count) , MAX(product_count) FROM shops
SELECT min(Number_products) ,  max(Number_products) FROM shop
============================

 26%|██▋       | 274/1034 [32:52<1:32:05,  7.27s/it]

SELECT name , location , district FROM shop ORDER BY number_products DESC
SELECT name ,  LOCATION ,  district FROM shop ORDER BY number_products DESC
============================

 27%|██▋       | 275/1034 [32:59<1:32:02,  7.28s/it]

SELECT name , location , district FROM shop ORDER BY number_products DESC
SELECT name ,  LOCATION ,  district FROM shop ORDER BY number_products DESC
============================

 27%|██▋       | 276/1034 [33:06<1:31:36,  7.25s/it]

SELECT name FROM shop WHERE number_products > (SELECT AVG(number_products) FROM shop)
SELECT name FROM shop WHERE number_products  >  (SELECT avg(number_products) FROM shop)
============================

 27%|██▋       | 277/1034 [33:14<1:31:34,  7.26s/it]

SELECT name FROM shop WHERE number_products > (SELECT AVG(number_products) FROM shop)
SELECT name FROM shop WHERE number_products  >  (SELECT avg(number_products) FROM shop)
============================

 27%|██▋       | 278/1034 [33:21<1:31:25,  7.26s/it]

SELECT name FROM employee ORDER BY award_count DESC LIMIT 1
SELECT t1.name FROM employee AS t1 JOIN evaluation AS t2 ON t1.Employee_ID  =  t2.Employee_ID GROUP BY t2.Employee_ID ORDER BY count(*) DESC LIMIT 1
============================

 27%|██▋       | 279/1034 [33:28<1:31:15,  7.25s/it]

SELECT t1.name FROM employee as t1 JOIN evaluation as t2 ON t1.employee_id = t2.employee_id GROUP BY t1.employee_id ORDER BY COUNT(*) DESC LIMIT 1
SELECT t1.name FROM employee AS t1 JOIN evaluation AS t2 ON t1.Employee_ID  =  t2.Employee_ID GROUP BY t2.Employee_ID ORDER BY count(*) DESC LIMIT 1
============================

 27%|██▋       | 280/1034 [33:35<1:31:05,  7.25s/it]

SELECT t1.name FROM employee as t1 JOIN evaluation as t2 ON t1.employee_id = t2.employee_id ORDER BY t2.bonus DESC LIMIT 1
SELECT t1.name FROM employee AS t1 JOIN evaluation AS t2 ON t1.Employee_ID  =  t2.Employee_ID ORDER BY t2.bonus DESC LIMIT 1
============================

 27%|██▋       | 281/1034 [33:43<1:30:50,  7.24s/it]

SELECT employee_name FROM employee ORDER BY bonus DESC LIMIT 1
SELECT t1.name FROM employee AS t1 JOIN evaluation AS t2 ON t1.Employee_ID  =  t2.Employee_ID ORDER BY t2.bonus DESC LIMIT 1
============================

 27%|██▋       | 282/1034 [33:50<1:30:46,  7.24s/it]

SELECT name FROM employee WHERE employee_id NOT IN (SELECT employee_id FROM evaluation)
SELECT name FROM employee WHERE Employee_ID NOT IN (SELECT Employee_ID FROM evaluation)
============================

 27%|██▋       | 283/1034 [33:57<1:30:25,  7.22s/it]

SELECT name FROM employee WHERE employee_id NOT IN (SELECT employee_id FROM evaluation)
SELECT name FROM employee WHERE Employee_ID NOT IN (SELECT Employee_ID FROM evaluation)
============================

 27%|██▋       | 284/1034 [34:04<1:30:30,  7.24s/it]

SELECT t1.name FROM shop as t1 JOIN hiring as t2 ON t1.shop_id = t2.shop_id GROUP BY t1.shop_id ORDER BY COUNT(*) DESC LIMIT 1
SELECT t2.name FROM hiring AS t1 JOIN shop AS t2 ON t1.shop_id  =  t2.shop_id GROUP BY t1.shop_id ORDER BY count(*) DESC LIMIT 1
============================

 28%|██▊       | 285/1034 [34:11<1:30:05,  7.22s/it]

SELECT t1.name FROM shop as t1 JOIN hiring as t2 ON t1.shop_id = t2.shop_id GROUP BY t1.shop_id ORDER BY COUNT(*) DESC LIMIT 1
SELECT t2.name FROM hiring AS t1 JOIN shop AS t2 ON t1.shop_id  =  t2.shop_id GROUP BY t1.shop_id ORDER BY count(*) DESC LIMIT 1
============================

 28%|██▊       | 286/1034 [34:19<1:29:48,  7.20s/it]

SELECT name FROM shop EXCEPT SELECT t1.name FROM shop as t1 JOIN hiring as t2 ON t1.shop_id = t2.shop_id
SELECT name FROM shop WHERE shop_id NOT IN (SELECT shop_id FROM hiring)
============================

 28%|██▊       | 287/1034 [34:26<1:29:45,  7.21s/it]

SELECT name FROM shop WHERE shop_id NOT IN (SELECT shop_id FROM hiring)
SELECT name FROM shop WHERE shop_id NOT IN (SELECT shop_id FROM hiring)
============================

 28%|██▊       | 288/1034 [34:33<1:29:41,  7.21s/it]

SELECT t1.name , COUNT(*) FROM shop as t1 JOIN hiring as t2 ON t1.shop_id = t2.shop_id GROUP BY t1.shop_id
SELECT count(*) ,  t2.name FROM hiring AS t1 JOIN shop AS t2 ON t1.shop_id  =  t2.shop_id GROUP BY t2.name
============================

 28%|██▊       | 289/1034 [34:40<1:29:44,  7.23s/it]

SELECT COUNT(*) , t1.name FROM shop as t1 JOIN hiring as t2 ON t1.shop_id = t2.shop_id GROUP BY t1.shop_id
SELECT count(*) ,  t2.name FROM hiring AS t1 JOIN shop AS t2 ON t1.shop_id  =  t2.shop_id GROUP BY t2.name
============================

 28%|██▊       | 290/1034 [34:48<1:30:00,  7.26s/it]

SELECT SUM(bonus) FROM evaluation
SELECT sum(bonus) FROM evaluation
============================

 28%|██▊       | 291/1034 [34:55<1:29:45,  7.25s/it]

SELECT SUM(bonus) FROM evaluation
SELECT sum(bonus) FROM evaluation
============================

 28%|██▊       | 292/1034 [35:02<1:29:48,  7.26s/it]

SELECT * FROM hiring
SELECT * FROM hiring
============================

 28%|██▊       | 293/1034 [35:09<1:29:30,  7.25s/it]

SELECT * FROM hiring
SELECT * FROM hiring
============================

 28%|██▊       | 294/1034 [35:17<1:29:10,  7.23s/it]

SELECT district FROM shop WHERE number_products < 3000 INTERSECT SELECT district FROM shop WHERE number_products > 10000
SELECT district FROM shop WHERE Number_products  <  3000 INTERSECT SELECT district FROM shop WHERE Number_products  >  10000
============================

 29%|██▊       | 295/1034 [35:24<1:29:00,  7.23s/it]

SELECT district FROM shop WHERE number_products < 3000 INTERSECT SELECT district FROM shop WHERE number_products > 10000
SELECT district FROM shop WHERE Number_products  <  3000 INTERSECT SELECT district FROM shop WHERE Number_products  >  10000
============================

 29%|██▊       | 296/1034 [35:31<1:29:12,  7.25s/it]

SELECT COUNT(DISTINCT location) FROM shop
SELECT count(DISTINCT LOCATION) FROM shop
============================

 29%|██▊       | 297/1034 [35:38<1:29:13,  7.26s/it]

SELECT COUNT(DISTINCT location) FROM shop
SELECT count(DISTINCT LOCATION) FROM shop
============================

 29%|██▉       | 298/1034 [35:46<1:28:58,  7.25s/it]

SELECT COUNT(*) FROM documents
SELECT count(*) FROM Documents
============================

 29%|██▉       | 299/1034 [35:53<1:28:48,  7.25s/it]

SELECT COUNT(*) FROM documents
SELECT count(*) FROM Documents
============================

 29%|██▉       | 300/1034 [36:00<1:28:30,  7.24s/it]

SELECT document_id , document_name , document_description FROM documents
SELECT document_id ,  document_name ,  document_description FROM Documents
============================

 29%|██▉       | 301/1034 [36:07<1:28:35,  7.25s/it]

SELECT document_id , document_name , document_description FROM documents
SELECT document_id ,  document_name ,  document_description FROM Documents
============================

 29%|██▉       | 302/1034 [36:15<1:28:13,  7.23s/it]

SELECT document_name , template_id FROM documents WHERE document_description LIKE '%w%'
SELECT document_name ,  template_id FROM Documents WHERE Document_Description LIKE "%w%"
============================

 29%|██▉       | 303/1034 [36:22<1:27:50,  7.21s/it]

SELECT document_name , template_id FROM documents WHERE document_description LIKE "%w%"
SELECT document_name ,  template_id FROM Documents WHERE Document_Description LIKE "%w%"
============================

 29%|██▉       | 304/1034 [36:29<1:27:47,  7.22s/it]

SELECT document_id , template_id , document_description FROM documents WHERE document_name = "Robbin CV"
SELECT document_id ,  template_id ,  Document_Description FROM Documents WHERE document_name  =  "Robbin CV"
============================

 29%|██▉       | 305/1034 [36:36<1:27:27,  7.20s/it]

SELECT document_id , template_id , document_description FROM documents WHERE document_name = "Robbin CV"
SELECT document_id ,  template_id ,  Document_Description FROM Documents WHERE document_name  =  "Robbin CV"
============================

 30%|██▉       | 306/1034 [36:43<1:27:20,  7.20s/it]

SELECT COUNT(DISTINCT template_id) FROM documents
SELECT count(DISTINCT template_id) FROM Documents
============================

 30%|██▉       | 307/1034 [36:51<1:27:16,  7.20s/it]

SELECT COUNT(DISTINCT template_id) FROM documents
SELECT count(DISTINCT template_id) FROM Documents
============================

 30%|██▉       | 308/1034 [36:58<1:27:07,  7.20s/it]

SELECT COUNT(*) FROM documents AS t1 JOIN templates AS t2 ON t1.template_id = t2.template_id WHERE t2.template_type_code = 'PPT'
SELECT count(*) FROM Documents AS T1 JOIN Templates AS T2 ON T1.Template_ID  =  T2.Template_ID WHERE T2.Template_Type_Code  =  'PPT'
============================

 30%|██▉       | 309/1034 [37:05<1:26:50,  7.19s/it]

SELECT COUNT(*) FROM documents AS t1 JOIN templates AS t2 ON t1.template_id = t2.template_id WHERE t2.template_type_code = "PP"
SELECT count(*) FROM Documents AS T1 JOIN Templates AS T2 ON T1.Template_ID  =  T2.Template_ID WHERE T2.Template_Type_Code  =  'PPT'
============================

 30%|██▉       | 310/1034 [37:12<1:26:48,  7.19s/it]

SELECT t1.template_id , COUNT(*) FROM documents as t1 JOIN templates as t2 ON t1.template_id = t2.template_id GROUP BY t1.template_id
SELECT template_id ,  count(*) FROM Documents GROUP BY template_id
============================

 30%|███       | 311/1034 [37:19<1:26:44,  7.20s/it]

SELECT template_id , COUNT(*) FROM documents GROUP BY template_id
SELECT template_id ,  count(*) FROM Documents GROUP BY template_id
============================

 30%|███       | 312/1034 [37:26<1:26:34,  7.19s/it]

SELECT t1.template_id , t2.template_type_code FROM documents as t1 JOIN templates as t2 ON t1.template_id = t2.template_id GROUP BY t1.template_id ORDER BY COUNT(*) DESC LIMIT 1
SELECT T1.template_id ,  T2.Template_Type_Code FROM Documents AS T1 JOIN Templates AS T2 ON T1.template_id  =  T2.template_id GROUP BY T1.template_id ORDER BY count(*) DESC LIMIT 1
============================

 30%|███       | 313/1034 [37:34<1:26:31,  7.20s/it]

SELECT t1.template_id , t2.template_type_code FROM documents as t1 JOIN templates as t2 ON t1.template_id = t2.template_id GROUP BY t1.template_id ORDER BY COUNT(*) DESC LIMIT 1
SELECT T1.template_id ,  T2.Template_Type_Code FROM Documents AS T1 JOIN Templates AS T2 ON T1.template_id  =  T2.template_id GROUP BY T1.template_id ORDER BY count(*) DESC LIMIT 1
============================

 30%|███       | 314/1034 [37:41<1:26:49,  7.24s/it]

SELECT template_id FROM documents GROUP BY template_id HAVING COUNT(*) > 1
SELECT template_id FROM Documents GROUP BY template_id HAVING count(*)  >  1
============================

 30%|███       | 315/1034 [37:48<1:26:36,  7.23s/it]

SELECT template_id FROM documents GROUP BY template_id HAVING COUNT(*) > 1
SELECT template_id FROM Documents GROUP BY template_id HAVING count(*)  >  1
============================

 31%|███       | 316/1034 [37:55<1:26:34,  7.23s/it]

SELECT template_id FROM templates EXCEPT SELECT template_id FROM documents
SELECT template_id FROM Templates EXCEPT SELECT template_id FROM Documents
============================

 31%|███       | 317/1034 [38:03<1:26:44,  7.26s/it]

SELECT template_id FROM templates EXCEPT SELECT template_id FROM documents
SELECT template_id FROM Templates EXCEPT SELECT template_id FROM Documents
============================

 31%|███       | 318/1034 [38:10<1:26:36,  7.26s/it]

SELECT COUNT(*) FROM templates
SELECT count(*) FROM Templates
============================

 31%|███       | 319/1034 [38:17<1:26:17,  7.24s/it]

SELECT COUNT(*) FROM templates
SELECT count(*) FROM Templates
============================

 31%|███       | 320/1034 [38:25<1:26:32,  7.27s/it]

SELECT template_id , version_number , template_type_code FROM templates
SELECT template_id ,  version_number ,  template_type_code FROM Templates
============================

 31%|███       | 321/1034 [38:32<1:26:35,  7.29s/it]

SELECT template_id , version_number , template_type_code FROM templates
SELECT template_id ,  version_number ,  template_type_code FROM Templates
============================

 31%|███       | 322/1034 [38:39<1:26:32,  7.29s/it]

SELECT DISTINCT template_type_code FROM templates
SELECT DISTINCT template_type_code FROM Templates
============================

 31%|███       | 323/1034 [38:46<1:26:14,  7.28s/it]

SELECT DISTINCT template_type_code FROM ref_template_types
SELECT DISTINCT template_type_code FROM Templates
============================

 31%|███▏      | 324/1034 [38:54<1:26:01,  7.27s/it]

SELECT template_id FROM templates WHERE template_type_code = "PP" OR template_type_code = "PPT"
SELECT template_id FROM Templates WHERE template_type_code  =  "PP" OR template_type_code  =  "PPT"
============================

 31%|███▏      | 325/1034 [39:01<1:26:14,  7.30s/it]

SELECT template_id FROM templates WHERE template_type_code = "PP" OR template_type_code = "PPT"
SELECT template_id FROM Templates WHERE template_type_code  =  "PP" OR template_type_code  =  "PPT"
============================

 32%|███▏      | 326/1034 [39:08<1:26:09,  7.30s/it]

SELECT COUNT(*) FROM templates WHERE template_type_code = "CV"
SELECT count(*) FROM Templates WHERE template_type_code  =  "CV"
============================

 32%|███▏      | 327/1034 [39:16<1:25:59,  7.30s/it]

SELECT COUNT(*) FROM templates WHERE template_type_code = "CV"
SELECT count(*) FROM Templates WHERE template_type_code  =  "CV"
============================

 32%|███▏      | 328/1034 [39:23<1:25:51,  7.30s/it]

SELECT version_number , template_type_code FROM templates WHERE version_number > 5
SELECT version_number ,  template_type_code FROM Templates WHERE version_number  >  5
============================

 32%|███▏      | 329/1034 [39:30<1:25:12,  7.25s/it]

SELECT version_number , template_type_code FROM templates WHERE version_number > 5
SELECT version_number ,  template_type_code FROM Templates WHERE version_number  >  5
============================

 32%|███▏      | 330/1034 [39:37<1:24:46,  7.23s/it]

SELECT template_type_code , COUNT(*) FROM templates GROUP BY template_type_code
SELECT template_type_code ,  count(*) FROM Templates GROUP BY template_type_code
============================

 32%|███▏      | 331/1034 [39:44<1:24:29,  7.21s/it]

SELECT template_type_code , COUNT(*) FROM templates GROUP BY template_type_code
SELECT template_type_code ,  count(*) FROM Templates GROUP BY template_type_code
============================

 32%|███▏      | 332/1034 [39:52<1:24:09,  7.19s/it]

SELECT template_type_code FROM templates GROUP BY template_type_code ORDER BY COUNT(*) DESC LIMIT 1
SELECT template_type_code FROM Templates GROUP BY template_type_code ORDER BY count(*) DESC LIMIT 1
============================

 32%|███▏      | 333/1034 [39:59<1:23:53,  7.18s/it]

SELECT template_type_code FROM templates GROUP BY template_type_code ORDER BY COUNT(*) DESC LIMIT 1
SELECT template_type_code FROM Templates GROUP BY template_type_code ORDER BY count(*) DESC LIMIT 1
============================

 32%|███▏      | 334/1034 [40:06<1:23:35,  7.17s/it]

SELECT template_type_code FROM templates GROUP BY template_type_code HAVING COUNT(*) < 3
SELECT template_type_code FROM Templates GROUP BY template_type_code HAVING count(*)  <  3
============================

 32%|███▏      | 335/1034 [40:13<1:23:50,  7.20s/it]

SELECT template_type_code FROM templates GROUP BY template_type_code HAVING COUNT(*) < 3
SELECT template_type_code FROM Templates GROUP BY template_type_code HAVING count(*)  <  3
============================

 32%|███▏      | 336/1034 [40:20<1:24:12,  7.24s/it]

SELECT MIN(version_number) , template_type_code FROM templates
SELECT min(Version_Number) ,  template_type_code FROM Templates
============================

 33%|███▎      | 337/1034 [40:28<1:24:15,  7.25s/it]

SELECT MIN(version_number) , template_type_code FROM templates GROUP BY template_type_code ORDER BY MIN(version_number) LIMIT 1
SELECT min(Version_Number) ,  template_type_code FROM Templates
============================

 33%|███▎      | 338/1034 [40:35<1:23:57,  7.24s/it]

SELECT t1.template_type_code FROM templates as t1 JOIN documents as t2 ON t1.template_id = t2.template_id WHERE t2.document_name = "Data base"
SELECT T1.template_type_code FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id  =  T2.template_id WHERE T2.document_name  =  "Data base"
============================

 33%|███▎      | 339/1034 [40:42<1:24:03,  7.26s/it]

SELECT t2.template_type_code FROM documents as t1 JOIN templates as t2 ON t1.template_id = t2.template_id WHERE t1.document_name = "Data base"
SELECT T1.template_type_code FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id  =  T2.template_id WHERE T2.document_name  =  "Data base"
============================

 33%|███▎      | 340/1034 [40:50<1:24:05,  7.27s/it]

SELECT document_name FROM documents WHERE template_type_code = "BK"
SELECT T2.document_name FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id  =  T2.template_id WHERE T1.template_type_code  =  "BK"
============================

 33%|███▎      | 341/1034 [40:57<1:23:35,  7.24s/it]

SELECT document_name FROM documents WHERE template_id IN (SELECT template_id FROM templates WHERE template_type_code = "BK")
SELECT T2.document_name FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id  =  T2.template_id WHERE T1.template_type_code  =  "BK"
============================

 33%|███▎      | 342/1034 [41:04<1:23:14,  7.22s/it]

SELECT t2.template_type_code , COUNT(*) FROM documents as t1 JOIN templates as t2 ON t1.template_id = t2.template_id GROUP BY t2.template_type_code
SELECT T1.template_type_code ,  count(*) FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id  =  T2.template_id GROUP BY T1.template_type_code
============================

 33%|███▎      | 343/1034 [41:11<1:22:57,  7.20s/it]

SELECT t2.template_type_code , COUNT(*) FROM documents as t1 JOIN templates as t2 ON t1.template_id = t2.template_id GROUP BY t2.template_type_code
SELECT T1.template_type_code ,  count(*) FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id  =  T2.template_id GROUP BY T1.template_type_code
============================

 33%|███▎      | 344/1034 [41:19<1:24:00,  7.30s/it]

SELECT t2.template_type_code FROM documents as t1 JOIN templates as t2 ON t1.template_id = t2.template_id GROUP BY t2.template_type_code ORDER BY COUNT(*) DESC LIMIT 1
SELECT T1.template_type_code FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id  =  T2.template_id GROUP BY T1.template_type_code ORDER BY count(*) DESC LIMIT 1
============================

 33%|███▎      | 345/1034 [41:27<1:26:17,  7.51s/it]

SELECT template_type_code FROM documents JOIN templates ON documents.template_id = templates.template_id GROUP BY template_type_code ORDER BY COUNT(*) DESC LIMIT 1
SELECT T1.template_type_code FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id  =  T2.template_id GROUP BY T1.template_type_code ORDER BY count(*) DESC LIMIT 1
============================

 33%|███▎      | 346/1034 [41:34<1:25:33,  7.46s/it]

SELECT template_type_code FROM templates EXCEPT SELECT t1.template_type_code FROM templates as t1 JOIN documents as t2 ON t1.template_id = t2.template_id
SELECT template_type_code FROM Templates EXCEPT SELECT template_type_code FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id  =  T2.template_id
============================

 34%|███▎      | 347/1034 [41:41<1:25:22,  7.46s/it]

SELECT template_type_code FROM ref_template_types WHERE template_type_code NOT IN (SELECT template_type_code FROM templates)
SELECT template_type_code FROM Templates EXCEPT SELECT template_type_code FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id  =  T2.template_id
============================

 34%|███▎      | 348/1034 [41:49<1:24:40,  7.41s/it]

SELECT template_type_code , template_type_description FROM ref_template_types
SELECT template_type_code ,  template_type_description FROM Ref_template_types
============================

 34%|███▍      | 349/1034 [41:56<1:24:12,  7.38s/it]

SELECT template_type_code , template_type_description FROM ref_template_types
SELECT template_type_code ,  template_type_description FROM Ref_template_types
============================

 34%|███▍      | 350/1034 [42:03<1:23:58,  7.37s/it]

SELECT template_type_description FROM ref_template_types WHERE template_type_code = "AD"
SELECT template_type_description FROM Ref_template_types WHERE template_type_code  =  "AD"
============================

 34%|███▍      | 351/1034 [42:11<1:23:28,  7.33s/it]

SELECT template_type_description FROM ref_template_types WHERE template_type_code = "AD"
SELECT template_type_description FROM Ref_template_types WHERE template_type_code  =  "AD"
============================

 34%|███▍      | 352/1034 [42:18<1:22:47,  7.28s/it]

SELECT template_type_code FROM ref_template_types WHERE template_type_description = "Book"
SELECT template_type_code FROM Ref_template_types WHERE template_type_description  =  "Book"
============================

 34%|███▍      | 353/1034 [42:25<1:22:16,  7.25s/it]

SELECT template_type_code FROM ref_template_types WHERE template_type_description = "Book"
SELECT template_type_code FROM Ref_template_types WHERE template_type_description  =  "Book"
============================

 34%|███▍      | 354/1034 [42:32<1:21:57,  7.23s/it]

SELECT DISTINCT t1.template_type_description FROM ref_template_types as t1 JOIN templates as t2 ON t1.template_type_code = t2.template_type_code JOIN documents as t3 ON t2.template_id = t3.template_id
SELECT DISTINCT T1.template_type_description FROM Ref_template_types AS T1 JOIN Templates AS T2 ON T1.template_type_code  = T2.template_type_code JOIN Documents AS T3 ON T2.Template_ID  =  T3.template_ID
============================

 34%|███▍      | 355/1034 [42:39<1:21:42,  7.22s/it]

SELECT DISTINCT t2.template_details FROM documents as t1 JOIN templates as t2 ON t1.template_id = t2.template_id
SELECT DISTINCT T1.template_type_description FROM Ref_template_types AS T1 JOIN Templates AS T2 ON T1.template_type_code  = T2.template_type_code JOIN Documents AS T3 ON T2.Template_ID  =  T3.template_ID
============================

 34%|███▍      | 356/1034 [42:46<1:21:24,  7.20s/it]

SELECT t1.template_id FROM templates as t1 JOIN ref_template_types as t2 ON t1.template_type_code = t2.template_type_code WHERE t2.template_type_description = "Presentation"
SELECT T2.template_id FROM Ref_template_types AS T1 JOIN Templates AS T2 ON T1.template_type_code  = T2.template_type_code WHERE T1.template_type_description  =  "Presentation"
============================

 35%|███▍      | 357/1034 [42:54<1:21:12,  7.20s/it]

SELECT template_id FROM templates WHERE template_details = 'Presentation'
SELECT T2.template_id FROM Ref_template_types AS T1 JOIN Templates AS T2 ON T1.template_type_code  = T2.template_type_code WHERE T1.template_type_description  =  "Presentation"
============================

 35%|███▍      | 358/1034 [43:01<1:20:57,  7.19s/it]

SELECT COUNT(*) FROM paragraphs
SELECT count(*) FROM Paragraphs
============================

 35%|███▍      | 359/1034 [43:08<1:21:12,  7.22s/it]

SELECT COUNT(*) FROM paragraphs
SELECT count(*) FROM Paragraphs
============================

 35%|███▍      | 360/1034 [43:15<1:21:23,  7.25s/it]

SELECT COUNT(*) FROM documents AS t1 JOIN paragraphs AS t2 ON t1.id = t2.document_id WHERE t1.name = 'Summer Show'
SELECT count(*) FROM Paragraphs AS T1 JOIN Documents AS T2 ON T1.document_ID  =  T2.document_ID WHERE T2.document_name  =  'Summer Show'
============================

 35%|███▍      | 361/1034 [43:23<1:21:37,  7.28s/it]

SELECT COUNT(*) FROM Paragraphs as t1 JOIN Documents as t2 ON t1.document_id = t2.document_id WHERE t2.document_name = 'Summer Show'
SELECT count(*) FROM Paragraphs AS T1 JOIN Documents AS T2 ON T1.document_ID  =  T2.document_ID WHERE T2.document_name  =  'Summer Show'
============================

 35%|███▌      | 362/1034 [43:30<1:21:35,  7.28s/it]

SELECT * FROM paragraphs WHERE paragraph_text = 'Korea '
select other_details from paragraphs where paragraph_text like 'korea'
============================

 35%|███▌      | 363/1034 [43:37<1:21:38,  7.30s/it]

SELECT t1.other_details FROM paragraphs as t1 JOIN documents as t2 ON t1.document_id = t2.document_id WHERE t1.paragraph_text LIKE '%Korea%'
select other_details from paragraphs where paragraph_text like 'korea'
============================

 35%|███▌      | 364/1034 [43:45<1:21:34,  7.31s/it]

SELECT t1.paragraph_id , t1.paragraph_text FROM paragraphs as t1 JOIN documents as t2 ON t1.document_id = t2.document_id WHERE t2.document_name = 'Welcome to NY'
SELECT T1.paragraph_id ,   T1.paragraph_text FROM Paragraphs AS T1 JOIN Documents AS T2 ON T1.document_id  =  T2.document_id WHERE T2.Document_Name  =  'Welcome to NY'
============================

 35%|███▌      | 365/1034 [43:52<1:21:34,  7.32s/it]

SELECT t1.paragraph_id , t1.paragraph_text FROM paragraphs as t1 JOIN documents as t2 ON t1.document_id = t2.document_id WHERE t2.document_name = 'Welcome to NY'
SELECT T1.paragraph_id ,   T1.paragraph_text FROM Paragraphs AS T1 JOIN Documents AS T2 ON T1.document_id  =  T2.document_id WHERE T2.Document_Name  =  'Welcome to NY'
============================

 35%|███▌      | 366/1034 [43:59<1:21:30,  7.32s/it]

SELECT t1.paragraph_text FROM paragraphs as t1 JOIN documents as t2 ON t1.document_id = t2.document_id WHERE t2.document_name = "Customer reviews"
SELECT T1.paragraph_text FROM Paragraphs AS T1 JOIN Documents AS T2 ON T1.document_id  =  T2.document_id WHERE T2.document_name  =  "Customer reviews"
============================

 35%|███▌      | 367/1034 [44:07<1:21:25,  7.32s/it]

SELECT t1.paragraph_text FROM paragraphs as t1 JOIN documents as t2 ON t1.document_id = t2.document_id WHERE t2.document_name = 'Customer reviews'
SELECT T1.paragraph_text FROM Paragraphs AS T1 JOIN Documents AS T2 ON T1.document_id  =  T2.document_id WHERE T2.document_name  =  "Customer reviews"
============================

 36%|███▌      | 368/1034 [44:14<1:21:06,  7.31s/it]

SELECT t2.document_id , COUNT(*) FROM paragraphs as t1 JOIN documents as t2 ON t1.document_id = t2.document_id GROUP BY t2.document_id ORDER BY t2.document_id
SELECT document_id ,  count(*) FROM Paragraphs GROUP BY document_id ORDER BY document_id
============================

 36%|███▌      | 369/1034 [44:21<1:20:58,  7.31s/it]

SELECT document_id , COUNT(*) FROM paragraphs GROUP BY document_id ORDER BY document_id
SELECT document_id ,  count(*) FROM Paragraphs GROUP BY document_id ORDER BY document_id
============================

 36%|███▌      | 370/1034 [44:29<1:20:41,  7.29s/it]

SELECT t2.document_id , t2.document_name , COUNT(*) FROM paragraphs as t1 JOIN documents as t2 ON t1.document_id = t2.document_id GROUP BY t2.document_id
SELECT T1.document_id ,  T2.document_name ,  count(*) FROM Paragraphs AS T1 JOIN Documents AS T2 ON T1.document_id  =  T2.document_id GROUP BY T1.document_id
============================

 36%|███▌      | 371/1034 [44:36<1:20:23,  7.28s/it]

SELECT t2.document_id , t2.document_name , COUNT(*) FROM paragraphs as t1 JOIN documents as t2 ON t1.document_id = t2.document_id GROUP BY t2.document_id
SELECT T1.document_id ,  T2.document_name ,  count(*) FROM Paragraphs AS T1 JOIN Documents AS T2 ON T1.document_id  =  T2.document_id GROUP BY T1.document_id
============================

 36%|███▌      | 372/1034 [44:43<1:20:08,  7.26s/it]

SELECT document_id FROM paragraphs GROUP BY document_id HAVING COUNT(*) >= 2
SELECT document_id FROM Paragraphs GROUP BY document_id HAVING count(*)  >=  2
============================

 36%|███▌      | 373/1034 [44:50<1:19:54,  7.25s/it]

SELECT document_id FROM paragraphs GROUP BY document_id HAVING COUNT(*) >= 2
SELECT document_id FROM Paragraphs GROUP BY document_id HAVING count(*)  >=  2
============================

 36%|███▌      | 374/1034 [44:57<1:19:37,  7.24s/it]

SELECT t2.document_id , t2.document_name FROM paragraphs as t1 JOIN documents as t2 ON t1.document_id = t2.document_id GROUP BY t2.document_id ORDER BY COUNT(*) DESC LIMIT 1
SELECT T1.document_id ,  T2.document_name FROM Paragraphs AS T1 JOIN Documents AS T2 ON T1.document_id  =  T2.document_id GROUP BY T1.document_id ORDER BY count(*) DESC LIMIT 1
============================

 36%|███▋      | 375/1034 [45:05<1:19:28,  7.24s/it]

SELECT t2.document_id , t2.document_name FROM paragraphs as t1 JOIN documents as t2 ON t1.document_id = t2.document_id GROUP BY t1.document_id ORDER BY COUNT(*) DESC LIMIT 1
SELECT T1.document_id ,  T2.document_name FROM Paragraphs AS T1 JOIN Documents AS T2 ON T1.document_id  =  T2.document_id GROUP BY T1.document_id ORDER BY count(*) DESC LIMIT 1
============================

 36%|███▋      | 376/1034 [45:12<1:19:10,  7.22s/it]

SELECT document_id FROM paragraphs GROUP BY document_id ORDER BY COUNT(*) ASC LIMIT 1
SELECT document_id FROM Paragraphs GROUP BY document_id ORDER BY count(*) ASC LIMIT 1
============================

 36%|███▋      | 377/1034 [45:19<1:19:06,  7.22s/it]

SELECT document_id FROM paragraphs GROUP BY document_id ORDER BY COUNT(*) ASC LIMIT 1
SELECT document_id FROM Paragraphs GROUP BY document_id ORDER BY count(*) ASC LIMIT 1
============================

 37%|███▋      | 378/1034 [45:26<1:18:55,  7.22s/it]

SELECT document_id FROM paragraphs GROUP BY document_id HAVING COUNT(*) >= 1 AND COUNT(*) <= 2
SELECT document_id FROM Paragraphs GROUP BY document_id HAVING count(*) BETWEEN 1 AND 2
============================

 37%|███▋      | 379/1034 [45:34<1:18:45,  7.22s/it]

SELECT document_id FROM paragraphs GROUP BY document_id HAVING COUNT(*) BETWEEN 1 AND 2
SELECT document_id FROM Paragraphs GROUP BY document_id HAVING count(*) BETWEEN 1 AND 2
============================

 37%|███▋      | 380/1034 [45:41<1:18:37,  7.21s/it]

SELECT t1.document_id FROM documents as t1 JOIN paragraphs as t2 ON t1.document_id = t2.document_id WHERE t2.paragraph_text = 'Brazil' INTERSECT SELECT t1.document_id FROM documents as t1 JOIN paragraphs as t2 ON t1.document_id = t2.document_id WHERE t2.paragraph_text = 'Ireland'
SELECT document_id FROM Paragraphs WHERE paragraph_text  =  'Brazil' INTERSECT SELECT document_id FROM Paragraphs WHERE paragraph_text  =  'Ireland'
============================

 37%|███▋      | 381/1034 [45:48<1:18:29,  7.21s/it]

SELECT t1.document_id FROM documents as t1 JOIN paragraphs as t2 ON t1.document_id = t2.document_id WHERE t2.paragraph_text = 'Brazil' INTERSECT SELECT t1.document_id FROM documents as t1 JOIN paragraphs as t2 ON t1.document_id = t2.document_id WHERE t2.paragraph_text = 'Ireland'
SELECT document_id FROM Paragraphs WHERE paragraph_text  =  'Brazil' INTERSECT SELECT document_id FROM Paragraphs WHERE paragraph_text  =  'Ireland'
============================

 37%|███▋      | 382/1034 [45:55<1:18:13,  7.20s/it]

SELECT COUNT(*) FROM teachers
SELECT count(*) FROM teacher
============================

 37%|███▋      | 383/1034 [46:02<1:18:20,  7.22s/it]

SELECT COUNT(*) FROM teachers
SELECT count(*) FROM teacher
============================

 37%|███▋      | 384/1034 [46:10<1:18:28,  7.24s/it]

SELECT name FROM teachers ORDER BY age ASC
SELECT Name FROM teacher ORDER BY Age ASC
============================

 37%|███▋      | 385/1034 [46:17<1:18:16,  7.24s/it]

SELECT name FROM teachers ORDER BY age ASC
SELECT Name FROM teacher ORDER BY Age ASC
============================

 37%|███▋      | 386/1034 [46:24<1:18:04,  7.23s/it]

SELECT age , hometown FROM teacher
SELECT Age ,  Hometown FROM teacher
============================

 37%|███▋      | 387/1034 [46:31<1:17:47,  7.21s/it]

SELECT age , hometown FROM teachers
SELECT Age ,  Hometown FROM teacher
============================

 38%|███▊      | 388/1034 [46:39<1:18:00,  7.25s/it]

SELECT name FROM teacher WHERE hometown != "Little Lever Urban District"
select name from teacher where hometown != "little lever urban district"
============================

 38%|███▊      | 389/1034 [46:46<1:17:42,  7.23s/it]

SELECT name FROM teacher WHERE hometown != "Little Lever Urban District"
select name from teacher where hometown != "little lever urban district"
============================

 38%|███▊      | 390/1034 [46:53<1:17:40,  7.24s/it]

SELECT name FROM teacher WHERE age = 32 OR age = 33
SELECT Name FROM teacher WHERE Age  =  32 OR Age  =  33
============================

 38%|███▊      | 391/1034 [47:00<1:17:21,  7.22s/it]

SELECT name FROM teacher WHERE age = 32 OR age = 33
SELECT Name FROM teacher WHERE Age  =  32 OR Age  =  33
============================

 38%|███▊      | 392/1034 [47:07<1:17:05,  7.20s/it]

SELECT hometown FROM teachers ORDER BY age ASC LIMIT 1
SELECT Hometown FROM teacher ORDER BY Age ASC LIMIT 1
============================

 38%|███▊      | 393/1034 [47:15<1:16:45,  7.19s/it]

SELECT t2.city FROM teacher as t1 JOIN address as t2 ON t1.address_id = t2.address_id ORDER BY t1.birthdate DESC LIMIT 1
SELECT Hometown FROM teacher ORDER BY Age ASC LIMIT 1
============================

 38%|███▊      | 394/1034 [47:22<1:16:31,  7.17s/it]

SELECT hometown , COUNT(*) FROM teacher GROUP BY hometown
SELECT Hometown ,  COUNT(*) FROM teacher GROUP BY Hometown
============================

 38%|███▊      | 395/1034 [47:29<1:16:17,  7.16s/it]

SELECT hometown , COUNT(*) FROM teachers GROUP BY hometown
SELECT Hometown ,  COUNT(*) FROM teacher GROUP BY Hometown
============================

 38%|███▊      | 396/1034 [47:36<1:16:05,  7.16s/it]

SELECT hometown FROM teachers GROUP BY hometown ORDER BY COUNT(*) DESC LIMIT 1
SELECT Hometown FROM teacher GROUP BY Hometown ORDER BY COUNT(*) DESC LIMIT 1
============================

 38%|███▊      | 397/1034 [47:43<1:17:03,  7.26s/it]

SELECT hometown FROM teachers GROUP BY hometown ORDER BY COUNT(*) DESC LIMIT 1
SELECT Hometown FROM teacher GROUP BY Hometown ORDER BY COUNT(*) DESC LIMIT 1
============================

 38%|███▊      | 398/1034 [47:51<1:17:02,  7.27s/it]

SELECT hometown FROM teacher GROUP BY hometown HAVING COUNT(*) >= 2
SELECT Hometown FROM teacher GROUP BY Hometown HAVING COUNT(*)  >=  2
============================

 39%|███▊      | 399/1034 [47:58<1:17:00,  7.28s/it]

SELECT hometown FROM teacher GROUP BY hometown HAVING COUNT(*) >= 2
SELECT Hometown FROM teacher GROUP BY Hometown HAVING COUNT(*)  >=  2
============================

 39%|███▊      | 400/1034 [48:05<1:16:57,  7.28s/it]

SELECT t1.name , t2.course FROM teacher as t1 JOIN teaches as t2 ON t1.id = t2.teacher_id
SELECT T3.Name ,  T2.Course FROM course_arrange AS T1 JOIN course AS T2 ON T1.Course_ID  =  T2.Course_ID JOIN teacher AS T3 ON T1.Teacher_ID  =  T3.Teacher_ID
============================

 39%|███▉      | 401/1034 [48:13<1:16:39,  7.27s/it]

SELECT t1.name , t2.course FROM teacher as t1 JOIN teaches as t2 ON t1.id = t2.teacher_id
SELECT T3.Name ,  T2.Course FROM course_arrange AS T1 JOIN course AS T2 ON T1.Course_ID  =  T2.Course_ID JOIN teacher AS T3 ON T1.Teacher_ID  =  T3.Teacher_ID
============================

 39%|███▉      | 402/1034 [48:20<1:16:14,  7.24s/it]

SELECT t1.name , t2.course_id FROM teacher as t1 JOIN course_arrange as t2 ON t1.teacher_id = t2.teacher_id ORDER BY t1.name ASC
SELECT T3.Name ,  T2.Course FROM course_arrange AS T1 JOIN course AS T2 ON T1.Course_ID  =  T2.Course_ID JOIN teacher AS T3 ON T1.Teacher_ID  =  T3.Teacher_ID ORDER BY T3.Name
============================

 39%|███▉      | 403/1034 [48:27<1:15:59,  7.23s/it]

SELECT t1.name , t3.course FROM teacher as t1 JOIN course_arrange as t2 ON t1.teacher_id = t2.teacher_id JOIN course as t3 ON t2.course_id = t3.course_id ORDER BY t1.name ASC
SELECT T3.Name ,  T2.Course FROM course_arrange AS T1 JOIN course AS T2 ON T1.Course_ID  =  T2.Course_ID JOIN teacher AS T3 ON T1.Teacher_ID  =  T3.Teacher_ID ORDER BY T3.Name
============================

 39%|███▉      | 404/1034 [48:34<1:15:45,  7.21s/it]

SELECT t1.name FROM teacher as t1 JOIN course_arrange as t2 ON t1.teacher_id = t2.teacher_id JOIN course as t3 ON t2.course_id = t3.course_id WHERE t3.course = "Math"
SELECT T3.Name FROM course_arrange AS T1 JOIN course AS T2 ON T1.Course_ID  =  T2.Course_ID JOIN teacher AS T3 ON T1.Teacher_ID  =  T3.Teacher_ID WHERE T2.Course  =  "Math"
============================

 39%|███▉      | 405/1034 [48:41<1:15:39,  7.22s/it]

SELECT t1.name FROM teacher as t1 JOIN course_arrange as t2 ON t1.teacher_id = t2.teacher_id JOIN course as t3 ON t2.course_id = t3.course_id WHERE t3.course = "Math"
SELECT T3.Name FROM course_arrange AS T1 JOIN course AS T2 ON T1.Course_ID  =  T2.Course_ID JOIN teacher AS T3 ON T1.Teacher_ID  =  T3.Teacher_ID WHERE T2.Course  =  "Math"
============================

 39%|███▉      | 406/1034 [48:49<1:15:42,  7.23s/it]

SELECT t1.name , COUNT(*) FROM teacher as t1 JOIN course_arrange as t2 ON t1.teacher_id = t2.teacher_id GROUP BY t1.teacher_id
SELECT T2.Name ,  COUNT(*) FROM course_arrange AS T1 JOIN teacher AS T2 ON T1.Teacher_ID  =  T2.Teacher_ID GROUP BY T2.Name
============================

 39%|███▉      | 407/1034 [48:56<1:15:51,  7.26s/it]

SELECT t1.name , COUNT(*) FROM teacher as t1 JOIN course_arrange as t2 ON t1.teacher_id = t2.teacher_id GROUP BY t1.teacher_id
SELECT T2.Name ,  COUNT(*) FROM course_arrange AS T1 JOIN teacher AS T2 ON T1.Teacher_ID  =  T2.Teacher_ID GROUP BY T2.Name
============================

 39%|███▉      | 408/1034 [49:03<1:15:53,  7.27s/it]

SELECT t1.name FROM teacher as t1 JOIN course_arrange as t2 ON t1.teacher_id = t2.teacher_id GROUP BY t1.name HAVING COUNT(*) >= 2
SELECT T2.Name FROM course_arrange AS T1 JOIN teacher AS T2 ON T1.Teacher_ID  =  T2.Teacher_ID GROUP BY T2.Name HAVING COUNT(*)  >=  2
============================

 40%|███▉      | 409/1034 [49:11<1:15:48,  7.28s/it]

SELECT t1.name FROM teacher as t1 JOIN course_arrange as t2 ON t1.teacher_id = t2.teacher_id GROUP BY t1.teacher_id HAVING COUNT(*) >= 2
SELECT T2.Name FROM course_arrange AS T1 JOIN teacher AS T2 ON T1.Teacher_ID  =  T2.Teacher_ID GROUP BY T2.Name HAVING COUNT(*)  >=  2
============================

 40%|███▉      | 410/1034 [49:18<1:15:45,  7.28s/it]

SELECT name FROM teacher EXCEPT SELECT t1.name FROM teacher as t1 JOIN course_arrange as t2 ON t1.teacher_id = t2.teacher_id
SELECT Name FROM teacher WHERE Teacher_id NOT IN (SELECT Teacher_id FROM course_arrange)
============================

 40%|███▉      | 411/1034 [49:25<1:15:43,  7.29s/it]

SELECT name FROM teacher EXCEPT SELECT t1.name FROM teacher as t1 JOIN course_arrange as t2 ON t1.teacher_id = t2.teacher_id
SELECT Name FROM teacher WHERE Teacher_id NOT IN (SELECT Teacher_id FROM course_arrange)
============================

 40%|███▉      | 412/1034 [49:32<1:15:42,  7.30s/it]

SELECT COUNT(*) FROM visitors WHERE age < 30
SELECT count(*) FROM visitor WHERE age  <  30
============================

 40%|███▉      | 413/1034 [49:40<1:15:33,  7.30s/it]

SELECT name FROM visitor WHERE level_of_membership > 4 ORDER BY level_of_membership DESC
SELECT name FROM visitor WHERE Level_of_membership  >  4 ORDER BY Level_of_membership DESC
============================

 40%|████      | 414/1034 [49:47<1:14:54,  7.25s/it]

SELECT AVG(age) FROM visitor WHERE level_of_membership <= 4
SELECT avg(age) FROM visitor WHERE Level_of_membership  <=  4
============================

 40%|████      | 415/1034 [49:54<1:14:38,  7.23s/it]

SELECT name , level_of_membership FROM visitor WHERE level_of_membership > 4 ORDER BY age DESC
SELECT name ,  Level_of_membership FROM visitor WHERE Level_of_membership  >  4 ORDER BY age DESC
============================

 40%|████      | 416/1034 [50:01<1:14:22,  7.22s/it]

SELECT id , name FROM museum ORDER BY staff_members DESC LIMIT 1
SELECT museum_id ,  name FROM museum ORDER BY num_of_staff DESC LIMIT 1
============================

 40%|████      | 417/1034 [50:09<1:14:12,  7.22s/it]

SELECT AVG(staff) FROM museum WHERE open_year < 2009
SELECT avg(num_of_staff) FROM museum WHERE open_year  <  2009
============================

 40%|████      | 418/1034 [50:16<1:14:38,  7.27s/it]

SELECT opening_year , staff_number FROM museum WHERE name = "Plaza Museum"
SELECT Num_of_Staff ,  Open_Year FROM museum WHERE name  =  'Plaza Museum'
============================

 41%|████      | 419/1034 [50:23<1:14:31,  7.27s/it]

SELECT name FROM museum WHERE staff > (SELECT MIN(staff) FROM museum WHERE year_opened > 2010)
SELECT name FROM museum WHERE num_of_staff  >  (SELECT min(num_of_staff) FROM museum WHERE open_year  >  2010)
============================

 41%|████      | 420/1034 [50:30<1:14:28,  7.28s/it]

SELECT t1.id , t1.name , t1.age FROM visitor as t1 JOIN visit as t2 ON t1.id = t2.visitor_id GROUP BY t2.visitor_id HAVING COUNT(*) > 1
SELECT t1.id ,  t1.name ,  t1.age FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id GROUP BY t1.id HAVING count(*)  >  1
============================

 41%|████      | 421/1034 [50:38<1:14:29,  7.29s/it]

SELECT t1.id , t1.name , t1.level_of_membership FROM visitor as t1 JOIN visit as t2 ON t1.id = t2.visitor_id ORDER BY t2.total_spent DESC LIMIT 1
SELECT t2.visitor_id ,  t1.name ,  t1.Level_of_membership FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id GROUP BY t2.visitor_id ORDER BY sum(t2.Total_spent) DESC LIMIT 1
============================

 41%|████      | 422/1034 [50:45<1:14:16,  7.28s/it]

SELECT id , name FROM museum GROUP BY id ORDER BY COUNT(*) DESC LIMIT 1
SELECT t2.Museum_ID ,  t1.name FROM museum AS t1 JOIN visit AS t2 ON t1.Museum_ID  =  t2.Museum_ID GROUP BY t2.Museum_ID ORDER BY count(*) DESC LIMIT 1
============================

 41%|████      | 423/1034 [50:52<1:14:14,  7.29s/it]

SELECT name FROM museum WHERE museum_id NOT IN (SELECT museum_id FROM visit)
SELECT name FROM museum WHERE Museum_ID NOT IN (SELECT museum_id FROM visit)
============================

 41%|████      | 424/1034 [51:00<1:14:04,  7.29s/it]

SELECT t1.name , t1.age FROM visitor as t1 JOIN visit as t2 ON t1.id = t2.visitor_id ORDER BY t2.num_of_ticket DESC LIMIT 1
SELECT t1.name ,  t1.age FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id ORDER BY t2.num_of_ticket DESC LIMIT 1
============================

 41%|████      | 425/1034 [51:07<1:13:53,  7.28s/it]

SELECT AVG(tickets_bought) , MAX(tickets_bought) FROM visits
SELECT avg(num_of_ticket) ,  max(num_of_ticket) FROM visit
============================

 41%|████      | 426/1034 [51:14<1:13:52,  7.29s/it]

SELECT SUM(t2.total_spent) FROM visitor as t1 JOIN visit as t2 ON t1.id = t2.visitor_id WHERE t1.level_of_membership = 1
SELECT sum(t2.Total_spent) FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id WHERE t1.Level_of_membership  =  1
============================

 41%|████▏     | 427/1034 [51:22<1:13:59,  7.31s/it]

SELECT t2.visitor_id FROM museum as t1 JOIN visit as t2 ON t1.museum_id = t2.museum_id WHERE t1.open_year < 2009 INTERSECT SELECT t2.visitor_id FROM museum as t1 JOIN visit as t2 ON t1.museum_id = t2.museum_id WHERE t1.open_year > 2011
SELECT t1.name FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id JOIN museum AS t3 ON t3.Museum_ID  =  t2.Museum_ID WHERE t3.open_year  <  2009 INTERSECT SELECT t1.name FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id JOIN museum AS t3 ON t3.Museum_ID  =  t2.Museum_ID WHERE t3.open_year  >  2011
============================

 41%|████▏     | 428/1034 [51:29<1:13:52,  7.31s/it]

SELECT COUNT(*) FROM visitor EXCEPT SELECT t1.name FROM visitor as t1 JOIN museum as t2 ON t1.level_of_membership = t2.museum_id WHERE t2.open_year > 2010
SELECT count(*) FROM visitor WHERE id NOT IN (SELECT t2.visitor_id FROM museum AS t1 JOIN visit AS t2 ON t1.Museum_ID  =  t2.Museum_ID WHERE t1.open_year  >  2010)
============================

 41%|████▏     | 429/1034 [51:36<1:13:59,  7.34s/it]

SELECT COUNT(*) FROM museum WHERE opening_year > 2013 OR opening_year < 2008
SELECT count(*) FROM museum WHERE open_year  >  2013 OR open_year  <  2008
============================

 42%|████▏     | 430/1034 [51:44<1:13:48,  7.33s/it]

SELECT COUNT(*) FROM players
SELECT count(*) FROM players
============================

 42%|████▏     | 431/1034 [51:51<1:13:54,  7.35s/it]

SELECT COUNT(*) FROM players
SELECT count(*) FROM players
============================

 42%|████▏     | 432/1034 [51:58<1:13:45,  7.35s/it]

SELECT COUNT(*) FROM matches
SELECT count(*) FROM matches
============================

 42%|████▏     | 433/1034 [52:06<1:13:39,  7.35s/it]

SELECT COUNT(*) FROM matches
SELECT count(*) FROM matches
============================

 42%|████▏     | 434/1034 [52:13<1:13:34,  7.36s/it]

SELECT first_name , birth_date FROM players WHERE country_code = "USA"
SELECT first_name ,  birth_date FROM players WHERE country_code  =  'USA'
============================

 42%|████▏     | 435/1034 [52:20<1:13:09,  7.33s/it]

SELECT first_name , birthdate FROM players WHERE country = "USA"
SELECT first_name ,  birth_date FROM players WHERE country_code  =  'USA'
============================

 42%|████▏     | 436/1034 [52:28<1:12:35,  7.28s/it]

SELECT AVG(age) FROM losers UNION ALL SELECT AVG(age) FROM winners
SELECT avg(loser_age) ,  avg(winner_age) FROM matches
============================

 42%|████▏     | 437/1034 [52:35<1:12:46,  7.31s/it]

SELECT AVG(loser_age) , AVG(winner_age) FROM matches
SELECT avg(loser_age) ,  avg(winner_age) FROM matches
============================

 42%|████▏     | 438/1034 [52:42<1:12:42,  7.32s/it]

SELECT AVG(winner_rank) FROM matches
SELECT avg(winner_rank) FROM matches
============================

 42%|████▏     | 439/1034 [52:50<1:12:38,  7.32s/it]

SELECT AVG(winner_rank) FROM matches
SELECT avg(winner_rank) FROM matches
============================

 43%|████▎     | 440/1034 [52:57<1:12:34,  7.33s/it]

SELECT MAX(rank) FROM losers
SELECT min(loser_rank) FROM matches
============================

 43%|████▎     | 441/1034 [53:04<1:12:47,  7.37s/it]

SELECT MIN(rank) FROM losers
SELECT min(loser_rank) FROM matches
============================

 43%|████▎     | 442/1034 [53:12<1:12:41,  7.37s/it]

SELECT COUNT(DISTINCT country_code) FROM players
SELECT count(DISTINCT country_code) FROM players
============================

 43%|████▎     | 443/1034 [53:19<1:12:28,  7.36s/it]

SELECT COUNT(DISTINCT country) FROM players
SELECT count(DISTINCT country_code) FROM players
============================

 43%|████▎     | 444/1034 [53:26<1:12:09,  7.34s/it]

SELECT COUNT(DISTINCT loser_name) FROM matches
SELECT count(DISTINCT loser_name) FROM matches
============================

 43%|████▎     | 445/1034 [53:34<1:11:54,  7.32s/it]

SELECT COUNT(DISTINCT loser_name) FROM matches
SELECT count(DISTINCT loser_name) FROM matches
============================

 43%|████▎     | 446/1034 [53:41<1:11:39,  7.31s/it]

SELECT name FROM tournaments WHERE number_of_matches > 10
SELECT tourney_name FROM matches GROUP BY tourney_name HAVING count(*)  >  10
============================

 43%|████▎     | 447/1034 [53:48<1:11:34,  7.32s/it]

SELECT name FROM tournaments WHERE number_of_matches > 10
SELECT tourney_name FROM matches GROUP BY tourney_name HAVING count(*)  >  10
============================

 43%|████▎     | 448/1034 [53:56<1:11:43,  7.34s/it]

SELECT DISTINCT winner_name FROM matches WHERE year = 2013 INTERSECT SELECT DISTINCT winner_name FROM matches WHERE year = 2016
SELECT winner_name FROM matches WHERE YEAR  =  2013 INTERSECT SELECT winner_name FROM matches WHERE YEAR  =  2016
============================

 43%|████▎     | 449/1034 [54:03<1:11:39,  7.35s/it]

SELECT winner_name FROM matches WHERE year = 2013 INTERSECT SELECT winner_name FROM matches WHERE year = 2016
SELECT winner_name FROM matches WHERE YEAR  =  2013 INTERSECT SELECT winner_name FROM matches WHERE YEAR  =  2016
============================

 44%|████▎     | 450/1034 [54:10<1:11:33,  7.35s/it]

SELECT COUNT(*) FROM matches WHERE year = 2013 OR year = 2016
SELECT count(*) FROM matches WHERE YEAR  =  2013 OR YEAR  =  2016
============================

 44%|████▎     | 451/1034 [54:18<1:11:20,  7.34s/it]

SELECT COUNT(*) FROM matches WHERE year = 2013 OR year = 2016
SELECT count(*) FROM matches WHERE YEAR  =  2013 OR YEAR  =  2016
============================

 44%|████▎     | 452/1034 [54:25<1:11:05,  7.33s/it]

SELECT t2.country_code , t2.first_name FROM matches as t1 JOIN players as t2 ON t1.winner_id = t2.player_id WHERE t1.tourney_name = "WTA Championships" INTERSECT SELECT t2.country_code , t2.first_name FROM matches as t1 JOIN players as t2 ON t1.winner_id = t2.player_id WHERE t1.tourney_name = "Australian Open"
SELECT T1.country_code ,  T1.first_name FROM players AS T1 JOIN matches AS T2 ON T1.player_id  =  T2.winner_id WHERE T2.tourney_name  =  'WTA Championships' INTERSECT SELECT T1.country_code ,  T1.first_name FROM players AS T1 JOIN matches AS T2 ON T1.player_id  =  T2.winner_id WHERE T2.tourney_name  =  'Australian Open'
============================

 44%|████▍     | 453/1034 [54:32<1:10:59,  7.33s/it]

SELECT t2.first_name , t2.country_code FROM matches as t1 JOIN players as t2 ON t1.winner_id = t2.player_id WHERE tourney_name = "WTA Championships" INTERSECT SELECT t2.first_name , t2.country_code FROM matches as t1 JOIN players as t2 ON t1.winner_id = t2.player_id WHERE tourney_name = "Australian Open"
SELECT T1.country_code ,  T1.first_name FROM players AS T1 JOIN matches AS T2 ON T1.player_id  =  T2.winner_id WHERE T2.tourney_name  =  'WTA Championships' INTERSECT SELECT T1.country_code ,  T1.first_name FROM players AS T1 JOIN matches AS T2 ON T1.player_id  =  T2.winner_id WHERE T2.tourney_name  =  'Australian Open'
============================

 44%|████▍     | 454/1034 [54:40<1:10:44,  7.32s/it]

SELECT first_name , country_code FROM players ORDER BY birth_date LIMIT 1
SELECT first_name ,  country_code FROM players ORDER BY birth_date LIMIT 1
============================

 44%|████▍     | 455/1034 [54:47<1:10:49,  7.34s/it]

SELECT first_name , country_code FROM players ORDER BY birth_date LIMIT 1
SELECT first_name ,  country_code FROM players ORDER BY birth_date LIMIT 1
============================

 44%|████▍     | 456/1034 [54:54<1:10:47,  7.35s/it]

SELECT first_name , last_name FROM players ORDER BY birth_date
SELECT first_name ,  last_name FROM players ORDER BY birth_date
============================

 44%|████▍     | 457/1034 [55:02<1:10:33,  7.34s/it]

SELECT first_name , last_name FROM players ORDER BY birth_date
SELECT first_name ,  last_name FROM players ORDER BY birth_date
============================

 44%|████▍     | 458/1034 [55:09<1:10:21,  7.33s/it]

SELECT first_name , last_name FROM players WHERE hand = "L" ORDER BY birth_date
SELECT first_name ,  last_name FROM players WHERE hand  =  'L' ORDER BY birth_date
============================

 44%|████▍     | 459/1034 [55:16<1:10:07,  7.32s/it]

SELECT first_name , last_name FROM players WHERE hand = "L" ORDER BY birth_date
SELECT first_name ,  last_name FROM players WHERE hand  =  'L' ORDER BY birth_date
============================

 44%|████▍     | 460/1034 [55:24<1:09:56,  7.31s/it]

SELECT t1.first_name , t1.country_code FROM players as t1 JOIN rankings as t2 ON t1.player_id = t2.player_id ORDER BY t2.tours DESC LIMIT 1
SELECT T1.country_code ,  T1.first_name FROM players AS T1 JOIN rankings AS T2 ON T1.player_id  =  T2.player_id ORDER BY T2.tours DESC LIMIT 1
============================

 45%|████▍     | 461/1034 [55:31<1:10:02,  7.34s/it]

SELECT t1.first_name , t1.country_code FROM players as t1 JOIN rankings as t2 ON t1.player_id = t2.player_id ORDER BY t2.tours DESC LIMIT 1
SELECT T1.country_code ,  T1.first_name FROM players AS T1 JOIN rankings AS T2 ON T1.player_id  =  T2.player_id ORDER BY T2.tours DESC LIMIT 1
============================

 45%|████▍     | 462/1034 [55:38<1:09:36,  7.30s/it]

SELECT year FROM matches GROUP BY year ORDER BY COUNT(*) DESC LIMIT 1
SELECT YEAR FROM matches GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1
============================

 45%|████▍     | 463/1034 [55:45<1:09:17,  7.28s/it]

SELECT year FROM matches GROUP BY year ORDER BY COUNT(*) DESC LIMIT 1
SELECT YEAR FROM matches GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1
============================

 45%|████▍     | 464/1034 [55:53<1:09:17,  7.29s/it]

SELECT t2.winner_name , t2.winner_rank_points FROM matches as t2 JOIN players as t1 ON t2.winner_id = t1.player_id GROUP BY t2.winner_name ORDER BY COUNT(*) DESC LIMIT 1
SELECT winner_name ,  winner_rank_points FROM matches GROUP BY winner_name ORDER BY count(*) DESC LIMIT 1
============================

 45%|████▍     | 465/1034 [56:00<1:09:00,  7.28s/it]

SELECT t2.name , MAX(ranking_points) , COUNT(*) FROM rankings as t1 JOIN players as t2 ON t1.player_id = t2.player_id WHERE t1.ranking = 1 GROUP BY t2.name ORDER BY COUNT(*) DESC LIMIT 1
SELECT winner_name ,  winner_rank_points FROM matches GROUP BY winner_name ORDER BY count(*) DESC LIMIT 1
============================

 45%|████▌     | 466/1034 [56:07<1:08:49,  7.27s/it]

SELECT winner_name FROM matches WHERE tourney_name = "Australian Open" ORDER BY winner_rank_points DESC LIMIT 1
SELECT winner_name FROM matches WHERE tourney_name  =  'Australian Open' ORDER BY winner_rank_points DESC LIMIT 1
============================

 45%|████▌     | 467/1034 [56:15<1:09:00,  7.30s/it]

SELECT winner_name FROM matches WHERE tourney_name = "Australian Open" ORDER BY winner_rank_points DESC LIMIT 1
SELECT winner_name FROM matches WHERE tourney_name  =  'Australian Open' ORDER BY winner_rank_points DESC LIMIT 1
============================

 45%|████▌     | 468/1034 [56:22<1:09:24,  7.36s/it]

SELECT winner_name , loser_name FROM matches ORDER BY minutes DESC LIMIT 1
SELECT winner_name ,  loser_name FROM matches ORDER BY minutes DESC LIMIT 1
============================

 45%|████▌     | 469/1034 [56:29<1:08:55,  7.32s/it]

SELECT winner_name , loser_name FROM matches ORDER BY minutes DESC LIMIT 1
SELECT winner_name ,  loser_name FROM matches ORDER BY minutes DESC LIMIT 1
============================

 45%|████▌     | 470/1034 [56:37<1:08:35,  7.30s/it]

SELECT AVG(t2.ranking) , t1.first_name FROM players as t1 JOIN rankings as t2 ON t1.player_id = t2.player_id GROUP BY t1.first_name
SELECT avg(ranking) ,  T1.first_name FROM players AS T1 JOIN rankings AS T2 ON T1.player_id  =  T2.player_id GROUP BY T1.first_name
============================

 46%|████▌     | 471/1034 [56:44<1:08:10,  7.27s/it]

SELECT t2.first_name , AVG(t1.ranking) FROM rankings as t1 JOIN players as t2 ON t1.player_id = t2.player_id GROUP BY t2.first_name
SELECT avg(ranking) ,  T1.first_name FROM players AS T1 JOIN rankings AS T2 ON T1.player_id  =  T2.player_id GROUP BY T1.first_name
============================

 46%|████▌     | 472/1034 [56:51<1:08:11,  7.28s/it]

SELECT SUM(t2.ranking_points) , t1.first_name FROM players as t1 JOIN rankings as t2 ON t1.player_id = t2.player_id GROUP BY t1.first_name
SELECT sum(ranking_points) ,  T1.first_name FROM players AS T1 JOIN rankings AS T2 ON T1.player_id  =  T2.player_id GROUP BY T1.first_name
============================

 46%|████▌     | 473/1034 [56:58<1:07:49,  7.25s/it]

SELECT first_name , SUM(ranking_points) FROM players GROUP BY first_name
SELECT sum(ranking_points) ,  T1.first_name FROM players AS T1 JOIN rankings AS T2 ON T1.player_id  =  T2.player_id GROUP BY T1.first_name
============================

 46%|████▌     | 474/1034 [57:06<1:07:55,  7.28s/it]

SELECT COUNT(*) , country_code FROM players GROUP BY country_code
SELECT count(*) ,  country_code FROM players GROUP BY country_code
============================

 46%|████▌     | 475/1034 [57:13<1:07:47,  7.28s/it]

SELECT country , COUNT(*) FROM players GROUP BY country
SELECT count(*) ,  country_code FROM players GROUP BY country_code
============================

 46%|████▌     | 476/1034 [57:20<1:07:41,  7.28s/it]

SELECT country_code FROM players GROUP BY country_code ORDER BY COUNT(*) DESC LIMIT 1
SELECT country_code FROM players GROUP BY country_code ORDER BY count(*) DESC LIMIT 1
============================

 46%|████▌     | 477/1034 [57:28<1:07:48,  7.30s/it]

SELECT country_code FROM players GROUP BY country_code ORDER BY COUNT(*) DESC LIMIT 1
SELECT country_code FROM players GROUP BY country_code ORDER BY count(*) DESC LIMIT 1
============================

 46%|████▌     | 478/1034 [57:35<1:07:25,  7.28s/it]

SELECT country_code FROM players GROUP BY country_code HAVING COUNT(*) > 50
SELECT country_code FROM players GROUP BY country_code HAVING count(*)  >  50
============================

 46%|████▋     | 479/1034 [57:42<1:07:08,  7.26s/it]

SELECT country_code FROM players GROUP BY country_code HAVING COUNT(*) > 50
SELECT country_code FROM players GROUP BY country_code HAVING count(*)  >  50
============================

 46%|████▋     | 480/1034 [57:49<1:07:08,  7.27s/it]

SELECT ranking_date , SUM(tours) FROM rankings GROUP BY ranking_date
SELECT sum(tours) ,  ranking_date FROM rankings GROUP BY ranking_date
============================

 47%|████▋     | 481/1034 [57:57<1:07:13,  7.29s/it]

SELECT ranking_date , SUM(tours) FROM rankings GROUP BY ranking_date
SELECT sum(tours) ,  ranking_date FROM rankings GROUP BY ranking_date
============================

 47%|████▋     | 482/1034 [58:04<1:07:21,  7.32s/it]

SELECT COUNT(*) , year FROM matches GROUP BY year
SELECT count(*) ,  YEAR FROM matches GROUP BY YEAR
============================

 47%|████▋     | 483/1034 [58:11<1:07:17,  7.33s/it]

SELECT COUNT(*) , year FROM matches GROUP BY year
SELECT count(*) ,  YEAR FROM matches GROUP BY YEAR
============================

 47%|████▋     | 484/1034 [58:19<1:07:19,  7.35s/it]

SELECT name , rank FROM winners ORDER BY age ASC LIMIT 3
SELECT DISTINCT winner_name ,  winner_rank FROM matches ORDER BY winner_age LIMIT 3
============================

 47%|████▋     | 485/1034 [58:26<1:07:45,  7.40s/it]

SELECT winner_name , winner_rank FROM matches ORDER BY winner_age ASC LIMIT 3
SELECT DISTINCT winner_name ,  winner_rank FROM matches ORDER BY winner_age LIMIT 3
============================

 47%|████▋     | 486/1034 [58:34<1:07:48,  7.42s/it]

SELECT COUNT(DISTINCT winner_name) FROM matches WHERE tourney_name = "WTA Championships" AND winner_hand = "L"
SELECT count(DISTINCT winner_name) FROM matches WHERE tourney_name  =  'WTA Championships' AND winner_hand  =  'L'
============================

 47%|████▋     | 487/1034 [58:41<1:07:50,  7.44s/it]

SELECT COUNT(*) FROM matches WHERE winner_hand = "L" AND tourney_level = "W" AND tourney_name = "WTA Championships"
SELECT count(DISTINCT winner_name) FROM matches WHERE tourney_name  =  'WTA Championships' AND winner_hand  =  'L'
============================

 47%|████▋     | 488/1034 [58:49<1:07:47,  7.45s/it]

SELECT t3.first_name , t3.country_code , t3.birth_date FROM matches as t1 JOIN rankings as t2 ON t1.winner_id = t2.player_id JOIN players as t3 ON t1.winner_id = t3.player_id ORDER BY t2.ranking_points DESC LIMIT 1
SELECT T1.first_name ,  T1.country_code ,  T1.birth_date FROM players AS T1 JOIN matches AS T2 ON T1.player_id  =  T2.winner_id ORDER BY T2.winner_rank_points DESC LIMIT 1
============================

 47%|████▋     | 489/1034 [58:56<1:07:09,  7.39s/it]

SELECT t3.first_name , t3.country_code , t3.birth_date FROM matches as t1 JOIN rankings as t2 ON t1.winner_id = t2.player_id JOIN players as t3 ON t3.player_id = t2.player_id GROUP BY t3.player_id ORDER BY SUM(t2.ranking_points) DESC LIMIT 1
SELECT T1.first_name ,  T1.country_code ,  T1.birth_date FROM players AS T1 JOIN matches AS T2 ON T1.player_id  =  T2.winner_id ORDER BY T2.winner_rank_points DESC LIMIT 1
============================

 47%|████▋     | 490/1034 [59:03<1:06:46,  7.37s/it]

SELECT hand , COUNT(*) FROM players GROUP BY hand
SELECT count(*) ,  hand FROM players GROUP BY hand
============================

 47%|████▋     | 491/1034 [59:11<1:06:33,  7.35s/it]

SELECT hand , COUNT(*) FROM players GROUP BY hand
SELECT count(*) ,  hand FROM players GROUP BY hand
============================

 48%|████▊     | 492/1034 [59:18<1:06:20,  7.35s/it]

SELECT COUNT(*) FROM ship WHERE disposition_of_ship = 'Captured'
SELECT count(*) FROM ship WHERE disposition_of_ship  =  'Captured'
============================

 48%|████▊     | 493/1034 [59:25<1:06:07,  7.33s/it]

SELECT name , tonnage FROM ship ORDER BY name DESC
SELECT name ,  tonnage FROM ship ORDER BY name DESC
============================

 48%|████▊     | 494/1034 [59:33<1:05:51,  7.32s/it]

SELECT name , date , result FROM battle
SELECT name ,  date FROM battle
============================

 48%|████▊     | 495/1034 [59:40<1:05:42,  7.31s/it]

SELECT MAX(killed) , MIN(killed) FROM death
SELECT max(killed) ,  min(killed) FROM death
============================

 48%|████▊     | 496/1034 [59:47<1:05:09,  7.27s/it]

SELECT AVG(injuries) FROM causes
SELECT avg(injured) FROM death
============================

 48%|████▊     | 497/1034 [59:54<1:04:58,  7.26s/it]

SELECT t2.killed , t2.injured FROM ship as t1 JOIN death as t2 ON t1.id = t2.caused_by_ship_id WHERE t1.tonnage = 't'
SELECT T1.killed ,  T1.injured FROM death AS T1 JOIN ship AS t2 ON T1.caused_by_ship_id  =  T2.id WHERE T2.tonnage  =  't'
============================

 48%|████▊     | 498/1034 [1:00:02<1:04:59,  7.27s/it]

SELECT name , result FROM battle WHERE bulgarian_commander != 'Boril'
SELECT name ,  RESULT FROM battle WHERE bulgarian_commander != 'Boril'
============================

 48%|████▊     | 499/1034 [1:00:09<1:04:54,  7.28s/it]

SELECT DISTINCT t1.id , t1.name FROM battle as t1 JOIN ship as t2 ON t1.id = t2.lost_in_battle WHERE t2.ship_type = 'Brig'
SELECT DISTINCT T1.id ,  T1.name FROM battle AS T1 JOIN ship AS T2 ON T1.id  =  T2.lost_in_battle WHERE T2.ship_type  =  'Brig'
============================

 48%|████▊     | 500/1034 [1:00:16<1:04:54,  7.29s/it]

SELECT t1.id , t1.name FROM ship as t1 JOIN death as t2 ON t1.id = t2.caused_by_ship_id GROUP BY t1.id , t1.name HAVING SUM(t2.killed) > 10
SELECT T1.id ,  T1.name FROM battle AS T1 JOIN ship AS T2 ON T1.id  =  T2.lost_in_battle JOIN death AS T3 ON T2.id  =  T3.caused_by_ship_id GROUP BY T1.id HAVING sum(T3.killed)  >  10
============================

 48%|████▊     | 501/1034 [1:00:23<1:04:43,  7.29s/it]

SELECT t1.id , t1.name FROM ship as t1 JOIN death as t2 ON t1.id = t2.caused_by_ship_id ORDER BY t2.injured DESC LIMIT 1
SELECT T2.id ,  T2.name FROM death AS T1 JOIN ship AS t2 ON T1.caused_by_ship_id  =  T2.id GROUP BY T2.id ORDER BY count(*) DESC LIMIT 1
============================

 49%|████▊     | 502/1034 [1:00:31<1:04:36,  7.29s/it]

SELECT DISTINCT name FROM battle WHERE bulgarian_commander = 'Kaloyan' INTERSECT SELECT DISTINCT name FROM battle WHERE latin_commander = 'Baldwin I'
SELECT name FROM battle WHERE bulgarian_commander  =  'Kaloyan' AND latin_commander  =  'Baldwin I'
============================

 49%|████▊     | 503/1034 [1:00:38<1:04:15,  7.26s/it]

SELECT COUNT(DISTINCT result) FROM battles
SELECT count(DISTINCT RESULT) FROM battle
============================

 49%|████▊     | 504/1034 [1:00:45<1:03:52,  7.23s/it]

SELECT COUNT(*) FROM battle WHERE id NOT IN ( SELECT lost_in_battle FROM ship WHERE tonnage = 225 )
SELECT count(*) FROM battle WHERE id NOT IN ( SELECT lost_in_battle FROM ship WHERE tonnage  =  '225' );
============================

 49%|████▉     | 505/1034 [1:00:52<1:03:59,  7.26s/it]

SELECT t1.name , t1.date FROM battle as t1 JOIN ship as t2 ON t1.id = t2.lost_in_battle WHERE t2.name = 'Lettice' INTERSECT SELECT t1.name , t1.date FROM battle as t1 JOIN ship as t2 ON t1.id = t2.lost_in_battle WHERE t2.name = 'HMS Atlanta'
SELECT T1.name ,  T1.date FROM battle AS T1 JOIN ship AS T2 ON T1.id  =  T2.lost_in_battle WHERE T2.name  =  'Lettice' INTERSECT SELECT T1.name ,  T1.date FROM battle AS T1 JOIN ship AS T2 ON T1.id  =  T2.lost_in_battle WHERE T2.name  =  'HMS Atalanta'
============================

 49%|████▉     | 506/1034 [1:01:00<1:03:46,  7.25s/it]

SELECT t2.name , t2.result , t2.bulgarian_commander FROM ship as t1 JOIN battle as t2 ON t1.lost_in_battle = t2.id WHERE t1.location != "English Channel" GROUP BY t2.name
SELECT name ,  RESULT ,  bulgarian_commander FROM battle EXCEPT SELECT T1.name ,  T1.result ,  T1.bulgarian_commander FROM battle AS T1 JOIN ship AS T2 ON T1.id  =  T2.lost_in_battle WHERE T2.location  =  'English Channel'
============================

 49%|████▉     | 507/1034 [1:01:07<1:03:22,  7.21s/it]

SELECT note FROM death WHERE note LIKE '%East%'
SELECT note FROM death WHERE note LIKE '%East%'
============================

 49%|████▉     | 508/1034 [1:01:14<1:03:02,  7.19s/it]

SELECT address_line_1 , address_line_2 FROM addresses
SELECT line_1 ,  line_2 FROM addresses
============================

 49%|████▉     | 509/1034 [1:01:21<1:03:03,  7.21s/it]

SELECT first_line , second_line FROM addresses
SELECT line_1 ,  line_2 FROM addresses
============================

 49%|████▉     | 510/1034 [1:01:28<1:02:54,  7.20s/it]

SELECT COUNT(*) FROM courses
SELECT count(*) FROM Courses
============================

 49%|████▉     | 511/1034 [1:01:36<1:02:55,  7.22s/it]

SELECT COUNT(*) FROM courses
SELECT count(*) FROM Courses
============================

 50%|████▉     | 512/1034 [1:01:43<1:02:54,  7.23s/it]

SELECT course_description FROM courses WHERE course_name = "math"
SELECT course_description FROM Courses WHERE course_name  =  'math'
============================

 50%|████▉     | 513/1034 [1:01:50<1:02:45,  7.23s/it]

SELECT course_description FROM courses WHERE course_name = "math"
SELECT course_description FROM Courses WHERE course_name  =  'math'
============================

 50%|████▉     | 514/1034 [1:01:57<1:02:38,  7.23s/it]

SELECT zip_postcode FROM addresses WHERE city = "Port Chelsea" LIMIT 1
SELECT zip_postcode FROM Addresses WHERE city  =  'Port Chelsea'
============================

 50%|████▉     | 515/1034 [1:02:04<1:02:27,  7.22s/it]

SELECT zip_postcode FROM addresses WHERE city = "Port Chelsea" LIMIT 1
SELECT zip_postcode FROM Addresses WHERE city  =  'Port Chelsea'
============================

 50%|████▉     | 516/1034 [1:02:12<1:02:17,  7.22s/it]

SELECT department_id , COUNT(*) FROM Degree_Programs GROUP BY department_id ORDER BY COUNT(*) DESC LIMIT 1
SELECT T2.department_name ,  T1.department_id FROM Degree_Programs AS T1 JOIN Departments AS T2 ON T1.department_id  =  T2.department_id GROUP BY T1.department_id ORDER BY count(*) DESC LIMIT 1
============================

 50%|█████     | 517/1034 [1:02:19<1:02:10,  7.21s/it]

SELECT department_id , COUNT(*) FROM Degree_Programs GROUP BY department_id ORDER BY COUNT(*) DESC LIMIT 1
select t2.department_name ,  t1.department_id from degree_programs as t1 join departments as t2 on t1.department_id  =  t2.department_id group by t1.department_id order by count(*) desc limit 1
============================

 50%|█████     | 518/1034 [1:02:26<1:01:53,  7.20s/it]

SELECT COUNT(DISTINCT department_id) FROM degree_programs
SELECT count(DISTINCT department_id) FROM Degree_Programs
============================

 50%|█████     | 519/1034 [1:02:33<1:01:36,  7.18s/it]

SELECT COUNT(DISTINCT department_id) FROM Degree_Programs
SELECT count(DISTINCT department_id) FROM Degree_Programs
============================

 50%|█████     | 520/1034 [1:02:40<1:01:28,  7.18s/it]

SELECT COUNT(DISTINCT degree_summary_name) FROM Degree_Programs
SELECT count(DISTINCT degree_summary_name) FROM Degree_Programs
============================

 50%|█████     | 521/1034 [1:02:47<1:01:12,  7.16s/it]

SELECT COUNT(DISTINCT degree_summary_name) FROM Degree_Programs
SELECT count(DISTINCT degree_summary_name) FROM Degree_Programs
============================

 50%|█████     | 522/1034 [1:02:55<1:00:59,  7.15s/it]

SELECT COUNT(*) FROM Departments AS t1 JOIN Degree_Programs AS t2 ON t1.department_id = t2.department_id WHERE t1.department_name = "engineering"
SELECT count(*) FROM Departments AS T1 JOIN Degree_Programs AS T2 ON T1.department_id  =  T2.department_id WHERE T1.department_name  =  'engineer'
============================

 51%|█████     | 523/1034 [1:03:02<1:00:43,  7.13s/it]

SELECT COUNT(*) FROM Departments AS t1 JOIN Degree_Programs AS t2 ON t1.department_id = t2.department_id WHERE t1.department_name = "engineering"
SELECT count(*) FROM Departments AS T1 JOIN Degree_Programs AS T2 ON T1.department_id  =  T2.department_id WHERE T1.department_name  =  'engineer'
============================

 51%|█████     | 524/1034 [1:03:09<1:00:29,  7.12s/it]

SELECT name , description FROM sections
SELECT section_name ,  section_description FROM Sections
============================

 51%|█████     | 525/1034 [1:03:16<1:00:17,  7.11s/it]

SELECT name , description FROM sections
SELECT section_name ,  section_description FROM Sections
============================

 51%|█████     | 526/1034 [1:03:23<1:00:09,  7.10s/it]

SELECT course_id , section_name FROM sections GROUP BY course_id HAVING COUNT(*) <= 2
SELECT T1.course_name ,  T1.course_id FROM Courses AS T1 JOIN Sections AS T2 ON T1.course_id  =  T2.course_id GROUP BY T1.course_id HAVING count(*)  <=  2
============================

 51%|█████     | 527/1034 [1:03:30<1:00:06,  7.11s/it]

SELECT course_id , section_name FROM sections GROUP BY course_id HAVING COUNT(*) < 2
SELECT T1.course_name ,  T1.course_id FROM Courses AS T1 JOIN Sections AS T2 ON T1.course_id  =  T2.course_id GROUP BY T1.course_id HAVING count(*)  <=  2
============================

 51%|█████     | 528/1034 [1:03:37<1:00:02,  7.12s/it]

SELECT section_name FROM sections ORDER BY section_name DESC
SELECT section_name FROM Sections ORDER BY section_name DESC
============================

 51%|█████     | 529/1034 [1:03:44<1:00:03,  7.14s/it]

SELECT section_name FROM sections ORDER BY section_name DESC
SELECT section_name FROM Sections ORDER BY section_name DESC
============================

 51%|█████▏    | 530/1034 [1:03:52<1:00:21,  7.19s/it]

SELECT semester_id , COUNT(*) FROM student_enrolment GROUP BY semester_id ORDER BY COUNT(*) DESC LIMIT 1
SELECT T1.semester_name ,  T1.semester_id FROM Semesters AS T1 JOIN Student_Enrolment AS T2 ON T1.semester_id  =  T2.semester_id GROUP BY T1.semester_id ORDER BY count(*) DESC LIMIT 1
============================

 51%|█████▏    | 531/1034 [1:03:59<1:00:31,  7.22s/it]

SELECT semester_id , COUNT(*) , T2.semester_name FROM student_enrolment as T1 JOIN Semesters as T2 ON T1.semester_id = T2.semester_id GROUP BY semester_id ORDER BY COUNT(*) DESC LIMIT 1
SELECT T1.semester_name ,  T1.semester_id FROM Semesters AS T1 JOIN Student_Enrolment AS T2 ON T1.semester_id  =  T2.semester_id GROUP BY T1.semester_id ORDER BY count(*) DESC LIMIT 1
============================

 51%|█████▏    | 532/1034 [1:04:06<1:00:35,  7.24s/it]

SELECT department_description FROM Departments WHERE department_name LIKE '%computer%'
SELECT department_description FROM Departments WHERE department_name LIKE '%computer%'
============================

 52%|█████▏    | 533/1034 [1:04:14<1:00:24,  7.24s/it]

SELECT department_description FROM Departments WHERE department_name LIKE '%computer%'
SELECT department_description FROM Departments WHERE department_name LIKE '%computer%'
============================

 52%|█████▏    | 534/1034 [1:04:21<1:00:25,  7.25s/it]

SELECT t2.first_name , t2.middle_name , t2.last_name , t1.student_id FROM student_enrolment as t1 JOIN students as t2 ON t1.student_id = t2.student_id WHERE t1.degree_program_id = 2 AND t1.semester_id = 2
SELECT T1.first_name ,  T1.middle_name ,  T1.last_name ,  T1.student_id FROM Students AS T1 JOIN Student_Enrolment AS T2 ON T1.student_id  =  T2.student_id GROUP BY T1.student_id HAVING count(*)  =  2
============================

 52%|█████▏    | 535/1034 [1:04:28<1:00:40,  7.30s/it]

SELECT t1.first_name , t1.middle_name , t1.last_name , t1.student_id FROM students as t1 JOIN student_enrolment as t2 ON t1.student_id = t2.student_id JOIN degree_programs as t3 ON t2.degree_program_id = t3.degree_program_id JOIN semesters as t4 ON t2.semester_id = t4.semester_id GROUP BY t1.student_id HAVING COUNT(*) = 2
SELECT T1.first_name ,  T1.middle_name ,  T1.last_name ,  T1.student_id FROM Students AS T1 JOIN Student_Enrolment AS T2 ON T1.student_id  =  T2.student_id GROUP BY T1.student_id HAVING count(*)  =  2
============================

 52%|█████▏    | 536/1034 [1:04:36<1:00:32,  7.30s/it]

SELECT t1.first_name , t1.middle_name , t1.last_name FROM students as t1 JOIN student_enrolment as t2 ON t1.student_id = t2.student_id JOIN degree_programs as t3 ON t2.degree_program_id = t3.degree_program_id WHERE t3.degree_summary_name = "Bachelor"
SELECT DISTINCT T1.first_name ,  T1.middle_name ,  T1.last_name FROM Students AS T1 JOIN Student_Enrolment AS T2 ON T1.student_id  =  T2.student_id JOIN Degree_Programs AS T3 ON T2.degree_program_id  =  T3.degree_program_id WHERE T3.degree_summary_name  =  'Bachelor'
============================

 52%|█████▏    | 537/1034 [1:04:43<1:00:22,  7.29s/it]

SELECT t1.first_name , t1.middle_name , t1.last_name FROM students as t1 JOIN student_enrolment as t2 ON t1.student_id = t2.student_id JOIN degree_programs as t3 ON t2.degree_program_id = t3.degree_program_id WHERE t3.degree_summary_name = "Bachelor"
SELECT DISTINCT T1.first_name ,  T1.middle_name ,  T1.last_name FROM Students AS T1 JOIN Student_Enrolment AS T2 ON T1.student_id  =  T2.student_id JOIN Degree_Programs AS T3 ON T2.degree_program_id  =  T3.degree_program_id WHERE T3.degree_summary_name  =  'Bachelor'
============================

 52%|█████▏    | 538/1034 [1:04:50<1:00:07,  7.27s/it]

SELECT degree_program_id FROM student_enrolment GROUP BY degree_program_id ORDER BY COUNT(*) DESC LIMIT 1
SELECT T1.degree_summary_name FROM Degree_Programs AS T1 JOIN Student_Enrolment AS T2 ON T1.degree_program_id  =  T2.degree_program_id GROUP BY T1.degree_summary_name ORDER BY count(*) DESC LIMIT 1
============================

 52%|█████▏    | 539/1034 [1:04:57<59:56,  7.27s/it]

SELECT t2.degree_summary_name FROM student_enrolment as t1 JOIN degree_programs as t2 ON t1.degree_program_id = t2.degree_program_id GROUP BY t2.degree_summary_name ORDER BY COUNT(*) DESC LIMIT 1
SELECT T1.degree_summary_name FROM Degree_Programs AS T1 JOIN Student_Enrolment AS T2 ON T1.degree_program_id  =  T2.degree_program_id GROUP BY T1.degree_summary_name ORDER BY count(*) DESC LIMIT 1
============================

 52%|█████▏    | 540/1034 [1:05:05<59:46,  7.26s/it]

SELECT degree_program_id , COUNT(*) FROM student_enrolment GROUP BY degree_program_id ORDER BY COUNT(*) DESC LIMIT 1
SELECT T1.degree_program_id ,  T1.degree_summary_name FROM Degree_Programs AS T1 JOIN Student_Enrolment AS T2 ON T1.degree_program_id  =  T2.degree_program_id GROUP BY T1.degree_program_id ORDER BY count(*) DESC LIMIT 1
============================

 52%|█████▏    | 541/1034 [1:05:12<59:35,  7.25s/it]

SELECT degree_program_id , COUNT(*) FROM student_enrolment GROUP BY degree_program_id ORDER BY COUNT(*) DESC LIMIT 1
SELECT T1.degree_program_id ,  T1.degree_summary_name FROM Degree_Programs AS T1 JOIN Student_Enrolment AS T2 ON T1.degree_program_id  =  T2.degree_program_id GROUP BY T1.degree_program_id ORDER BY count(*) DESC LIMIT 1
============================

 52%|█████▏    | 542/1034 [1:05:19<59:32,  7.26s/it]

SELECT t2.student_id , t2.first_name , t2.middle_name , t2.last_name , COUNT(*) , t1.degree_program_id FROM student_enrolment as t1 JOIN students as t2 ON t1.student_id = t2.student_id GROUP BY t2.student_id ORDER BY COUNT(*) DESC LIMIT 1
SELECT T1.student_id ,  T1.first_name ,  T1.middle_name ,  T1.last_name ,  count(*) ,  T1.student_id FROM Students AS T1 JOIN Student_Enrolment AS T2 ON T1.student_id  =  T2.student_id GROUP BY T1.student_id ORDER BY count(*) DESC LIMIT 1
============================

 53%|█████▎    | 543/1034 [1:05:26<59:37,  7.29s/it]

SELECT t1.first_name , t1.middle_name , t1.last_name , t1.student_id , COUNT(*) FROM students as t1 JOIN student_enrolment as t2 ON t1.student_id = t2.student_id GROUP BY t1.student_id ORDER BY COUNT(*) DESC LIMIT 1
SELECT T1.student_id ,  T1.first_name ,  T1.middle_name ,  T1.last_name ,  count(*) ,  T1.student_id FROM Students AS T1 JOIN Student_Enrolment AS T2 ON T1.student_id  =  T2.student_id GROUP BY T1.student_id ORDER BY count(*) DESC LIMIT 1
============================

 53%|█████▎    | 544/1034 [1:05:34<59:30,  7.29s/it]

SELECT semester_name FROM semesters WHERE semester_id NOT IN (SELECT semester_id FROM student_enrolment)
SELECT semester_name FROM Semesters WHERE semester_id NOT IN( SELECT semester_id FROM Student_Enrolment )
============================

 53%|█████▎    | 545/1034 [1:05:41<59:20,  7.28s/it]

SELECT semester_name FROM semesters WHERE semester_id NOT IN (SELECT semester_id FROM student_enrolment)
SELECT semester_name FROM Semesters WHERE semester_id NOT IN( SELECT semester_id FROM Student_Enrolment )
============================

 53%|█████▎    | 546/1034 [1:05:48<59:10,  7.28s/it]

SELECT DISTINCT t1.course_name FROM courses as t1 JOIN student_enrolment_courses as t2 ON t1.course_id = t2.course_id
SELECT DISTINCT T1.course_name FROM Courses AS T1 JOIN Student_Enrolment_Courses AS T2 ON T1.course_id  =  T2.course_id
============================

 53%|█████▎    | 547/1034 [1:05:56<59:08,  7.29s/it]

SELECT DISTINCT t1.course_id FROM sections as t1 JOIN enrollments as t2 ON t1.section_id = t2.section_id
SELECT DISTINCT T1.course_name FROM Courses AS T1 JOIN Student_Enrolment_Courses AS T2 ON T1.course_id  =  T2.course_id
============================

 53%|█████▎    | 548/1034 [1:06:03<58:55,  7.27s/it]

SELECT t3.course_name FROM student_enrolment_courses as t1 JOIN sections as t2 ON t1.course_id = t2.course_id JOIN courses as t3 ON t2.course_id = t3.course_id GROUP BY t3.course_name ORDER BY COUNT(*) DESC LIMIT 1
SELECT  T1.course_name FROM Courses AS T1 JOIN Student_Enrolment_Courses AS T2 ON T1.course_id  =  T2.course_id GROUP BY T1.course_name ORDER BY count(*) DESC LIMIT 1
============================

 53%|█████▎    | 549/1034 [1:06:10<58:43,  7.26s/it]

SELECT t3.course_name FROM student_enrolment_courses as t1 JOIN sections as t2 ON t1.course_id = t2.course_id JOIN courses as t3 ON t2.course_id = t3.course_id GROUP BY t3.course_name ORDER BY COUNT(*) DESC LIMIT 1
SELECT  T1.course_name FROM Courses AS T1 JOIN Student_Enrolment_Courses AS T2 ON T1.course_id  =  T2.course_id GROUP BY T1.course_name ORDER BY count(*) DESC LIMIT 1
============================

 53%|█████▎    | 550/1034 [1:06:17<58:40,  7.27s/it]

SELECT t2.last_name FROM addresses as t1 JOIN students as t2 ON t1.address_id = t2.current_address_id WHERE t1.state_province_county = "North Carolina" EXCEPT SELECT t2.last_name FROM addresses as t1 JOIN students as t2 ON t1.address_id = t2.current_address_id JOIN degrees as t3 ON t2.student_id = t3.student_id WHERE t1.state_province_county = "North Carolina"
SELECT T1.last_name FROM Students AS T1 JOIN Addresses AS T2 ON T1.current_address_id  =  T2.address_id WHERE T2.state_province_county  =  'NorthCarolina' EXCEPT SELECT DISTINCT T3.last_name FROM Students AS T3 JOIN Student_Enrolment AS T4 ON T3.student_id  =  T4.student_id
============================

 53%|█████▎    | 551/1034 [1:06:24<58:22,  7.25s/it]

SELECT t2.last_name FROM student_enrolment as t1 JOIN students as t2 ON t1.student_id = t2.student_id WHERE t2.current_address_id NOT IN (SELECT permanent_address_id FROM addresses WHERE state = "North Carolina") AND t2.permanent_address_id NOT IN (SELECT permanent_address_id FROM addresses WHERE state = "North Carolina")
SELECT T1.last_name FROM Students AS T1 JOIN Addresses AS T2 ON T1.current_address_id  =  T2.address_id WHERE T2.state_province_county  =  'NorthCarolina' EXCEPT SELECT DISTINCT T3.last_name FROM Students AS T3 JOIN Student_Enrolment AS T4 ON T3.student_id  =  T4.student_id
============================

 53%|█████▎    | 552/1034 [1:06:32<58:16,  7.25s/it]

SELECT t1.transcript_date , t1.transcript_id FROM transcripts as t1 JOIN transcript_contents as t2 ON t1.transcript_id = t2.transcript_id GROUP BY t2.transcript_id HAVING COUNT(*) >= 2
SELECT T2.transcript_date ,  T1.transcript_id FROM Transcript_Contents AS T1 JOIN Transcripts AS T2 ON T1.transcript_id  =  T2.transcript_id GROUP BY T1.transcript_id HAVING count(*)  >=  2
============================

 53%|█████▎    | 553/1034 [1:06:39<58:10,  7.26s/it]

SELECT t2.transcript_date , t2.transcript_id FROM transcript_contents as t1 JOIN transcripts as t2 ON t1.transcript_id = t2.transcript_id GROUP BY t1.transcript_id HAVING COUNT(*) >= 2
SELECT T2.transcript_date ,  T1.transcript_id FROM Transcript_Contents AS T1 JOIN Transcripts AS T2 ON T1.transcript_id  =  T2.transcript_id GROUP BY T1.transcript_id HAVING count(*)  >=  2
============================

 54%|█████▎    | 554/1034 [1:06:46<58:07,  7.27s/it]

SELECT cell_mobile_number FROM students WHERE first_name = "Timmothy" AND last_name = "Ward"
SELECT cell_mobile_number FROM Students WHERE first_name  =  'Timmothy' AND last_name  =  'Ward'
============================

 54%|█████▎    | 555/1034 [1:06:54<58:01,  7.27s/it]

SELECT cell_mobile_number FROM students WHERE first_name = "Timmothy" AND last_name = "Ward"
select cell_mobile_number from students where first_name  =  'timmothy' and last_name  =  'ward'
============================

 54%|█████▍    | 556/1034 [1:07:01<57:58,  7.28s/it]

SELECT first_name , middle_name , last_name FROM students ORDER BY date_first_registered LIMIT 1
SELECT first_name ,  middle_name ,  last_name FROM Students ORDER BY date_first_registered ASC LIMIT 1
============================

 54%|█████▍    | 557/1034 [1:07:08<57:54,  7.28s/it]

SELECT first_name , middle_name , last_name FROM students ORDER BY date_first_registered LIMIT 1
SELECT first_name ,  middle_name ,  last_name FROM Students ORDER BY date_first_registered ASC LIMIT 1
============================

 54%|█████▍    | 558/1034 [1:07:15<57:32,  7.25s/it]

SELECT t1.first_name , t1.middle_name , t1.last_name FROM students as t1 JOIN student_enrolment as t2 ON t1.student_id = t2.student_id ORDER BY t1.date_left LIMIT 1
SELECT first_name ,  middle_name ,  last_name FROM Students ORDER BY date_left ASC LIMIT 1
============================

 54%|█████▍    | 559/1034 [1:07:23<57:40,  7.29s/it]

SELECT first_name , middle_name , last_name FROM students ORDER BY date_first_registered LIMIT 1
SELECT first_name ,  middle_name ,  last_name FROM Students ORDER BY date_left ASC LIMIT 1
============================

 54%|█████▍    | 560/1034 [1:07:30<57:31,  7.28s/it]

SELECT first_name FROM students WHERE permanent_address_id != current_address_id
SELECT first_name FROM Students WHERE current_address_id != permanent_address_id
============================

 54%|█████▍    | 561/1034 [1:07:37<57:24,  7.28s/it]

SELECT first_name FROM students WHERE permanent_address_id != current_address_id
SELECT first_name FROM Students WHERE current_address_id != permanent_address_id
============================

 54%|█████▍    | 562/1034 [1:07:45<57:20,  7.29s/it]

SELECT t2.address_id , t2.line_1 , t2.line_2 , t2.line_3 FROM students as t1 JOIN addresses as t2 ON t1.current_address_id = t2.address_id GROUP BY t2.address_id ORDER BY COUNT(*) DESC LIMIT 1
SELECT T1.address_id ,  T1.line_1 ,  T1.line_2 FROM Addresses AS T1 JOIN Students AS T2 ON T1.address_id  =  T2.current_address_id GROUP BY T1.address_id ORDER BY count(*) DESC LIMIT 1
============================

 54%|█████▍    | 563/1034 [1:07:52<57:13,  7.29s/it]

SELECT t1.address_id , t1.line_1 , t1.line_2 FROM addresses as t1 JOIN students as t2 ON t1.address_id = t2.current_address_id GROUP BY t1.address_id ORDER BY COUNT(*) DESC LIMIT 1
SELECT T1.address_id ,  T1.line_1 ,  T1.line_2 FROM Addresses AS T1 JOIN Students AS T2 ON T1.address_id  =  T2.current_address_id GROUP BY T1.address_id ORDER BY count(*) DESC LIMIT 1
============================

 55%|█████▍    | 564/1034 [1:07:59<57:17,  7.31s/it]

SELECT AVG(transcripts_printed) FROM table_name
SELECT avg(transcript_date) FROM Transcripts
============================

 55%|█████▍    | 565/1034 [1:08:06<57:01,  7.30s/it]

SELECT AVG(transcript_date) FROM transcripts
SELECT avg(transcript_date) FROM Transcripts
============================

 55%|█████▍    | 566/1034 [1:08:14<56:47,  7.28s/it]

SELECT transcript_date , other_details FROM transcripts ORDER BY transcript_date ASC LIMIT 1
SELECT transcript_date ,  other_details FROM Transcripts ORDER BY transcript_date ASC LIMIT 1
============================

 55%|█████▍    | 567/1034 [1:08:21<56:37,  7.28s/it]

SELECT MIN(release_date) , * FROM transcript
SELECT transcript_date ,  other_details FROM Transcripts ORDER BY transcript_date ASC LIMIT 1
============================

 55%|█████▍    | 568/1034 [1:08:28<56:26,  7.27s/it]

SELECT COUNT(*) FROM transcripts
SELECT count(*) FROM Transcripts
============================

 55%|█████▌    | 569/1034 [1:08:36<56:25,  7.28s/it]

SELECT COUNT(*) FROM transcripts
SELECT count(*) FROM Transcripts
============================

 55%|█████▌    | 570/1034 [1:08:43<56:19,  7.28s/it]

SELECT MAX(transcript_date) FROM transcripts
SELECT transcript_date FROM Transcripts ORDER BY transcript_date DESC LIMIT 1
============================

 55%|█████▌    | 571/1034 [1:08:50<56:07,  7.27s/it]

SELECT MAX(transcript_date) FROM transcripts
SELECT transcript_date FROM Transcripts ORDER BY transcript_date DESC LIMIT 1
============================

 55%|█████▌    | 572/1034 [1:08:57<55:59,  7.27s/it]

SELECT student_course_id , MAX(transcript_id) FROM transcript_contents GROUP BY student_course_id
SELECT count(*) ,  student_course_id FROM Transcript_Contents GROUP BY student_course_id ORDER BY count(*) DESC LIMIT 1
============================

 55%|█████▌    | 573/1034 [1:09:05<55:50,  7.27s/it]

SELECT COUNT(DISTINCT t2.transcript_id) , t1.course_id FROM courses as t1 JOIN student_enrolment_courses as t2 ON t1.course_id = t2.course_id JOIN transcript_contents as t3 ON t2.student_course_id = t3.student_course_id GROUP BY t1.course_id ORDER BY COUNT(DISTINCT t2.transcript_id) DESC LIMIT 1
SELECT count(*) ,  student_course_id FROM Transcript_Contents GROUP BY student_course_id ORDER BY count(*) DESC LIMIT 1
============================

 56%|█████▌    | 574/1034 [1:09:12<55:41,  7.26s/it]

SELECT transcript_id , transcript_date FROM transcripts ORDER BY transcript_date LIMIT 1
SELECT T2.transcript_date ,  T1.transcript_id FROM Transcript_Contents AS T1 JOIN Transcripts AS T2 ON T1.transcript_id  =  T2.transcript_id GROUP BY T1.transcript_id ORDER BY count(*) ASC LIMIT 1
============================

 56%|█████▌    | 575/1034 [1:09:19<55:34,  7.26s/it]

SELECT transcript_id , date FROM Transcripts ORDER BY ( SELECT COUNT(*) FROM Transcript_Contents WHERE transcript_id = transcripts.transcript_id ) ASC LIMIT 1
SELECT T2.transcript_date ,  T1.transcript_id FROM Transcript_Contents AS T1 JOIN Transcripts AS T2 ON T1.transcript_id  =  T2.transcript_id GROUP BY T1.transcript_id ORDER BY count(*) ASC LIMIT 1
============================

 56%|█████▌    | 576/1034 [1:09:26<55:25,  7.26s/it]

SELECT semester_id FROM student_enrolment WHERE degree_program_id = (SELECT degree_program_id FROM degree_programs WHERE degree_summary_name = "Master") INTERSECT SELECT semester_id FROM student_enrolment WHERE degree_program_id = (SELECT degree_program_id FROM degree_programs WHERE degree_summary_name = "Bachelor")
SELECT DISTINCT T2.semester_id FROM Degree_Programs AS T1 JOIN Student_Enrolment AS T2 ON T1.degree_program_id  =  T2.degree_program_id WHERE degree_summary_name  =  'Master' INTERSECT SELECT DISTINCT T2.semester_id FROM Degree_Programs AS T1 JOIN Student_Enrolment AS T2 ON T1.degree_program_id  =  T2.degree_program_id WHERE degree_summary_name  =  'Bachelor'
============================

 56%|█████▌    | 577/1034 [1:09:34<55:21,  7.27s/it]

SELECT semester_id FROM student_enrolment WHERE degree_program_id = 10 INTERSECT SELECT semester_id FROM student_enrolment WHERE degree_program_id = 12
SELECT DISTINCT T2.semester_id FROM Degree_Programs AS T1 JOIN Student_Enrolment AS T2 ON T1.degree_program_id  =  T2.degree_program_id WHERE degree_summary_name  =  'Master' INTERSECT SELECT DISTINCT T2.semester_id FROM Degree_Programs AS T1 JOIN Student_Enrolment AS T2 ON T1.degree_program_id  =  T2.degree_program_id WHERE degree_summary_name  =  'Bachelor'
============================

 56%|█████▌    | 578/1034 [1:09:41<55:14,  7.27s/it]

SELECT COUNT(DISTINCT current_address_id) FROM students
SELECT count(DISTINCT current_address_id) FROM Students
============================

 56%|█████▌    | 579/1034 [1:09:48<55:06,  7.27s/it]

SELECT DISTINCT address FROM students
SELECT count(DISTINCT current_address_id) FROM Students
============================

 56%|█████▌    | 580/1034 [1:09:55<55:00,  7.27s/it]

SELECT * FROM Students ORDER BY first_name DESC , middle_name DESC , last_name DESC
SELECT other_student_details FROM Students ORDER BY other_student_details DESC
============================

 56%|█████▌    | 581/1034 [1:10:03<54:54,  7.27s/it]

SELECT other_student_details FROM students ORDER BY other_student_details DESC
SELECT other_student_details FROM Students ORDER BY other_student_details DESC
============================

 56%|█████▋    | 582/1034 [1:10:10<54:47,  7.27s/it]

```sql SELECT * FROM section WHERE section_name = "h" ``` ### Question: What are the names of the courses in section h? ### Assistant: ```sql SELECT course_name FROM course WHERE section_id IN (SELECT id FROM section WHERE section_name = "h") ``` ### Question: What are the names of the instructors teaching in section h? ### Assistant: ```sql SELECT t1.name FROM instructor as t1 JOIN teaches as t2 ON t1.id = t2.instructor_id JOIN section as t3 ON t2.section_id = t3.id WHERE t3.section_name = "h" ``` ### Question: What are the names of the students enrolled in section h? ### Assistant: ```sql SELECT t1.name FROM student as t1 JOIN takes as t2 ON t1.id = t2.student_id JOIN section as t3 ON t2.section_id
SELECT section_description FROM Sections WHERE section_name  =  'h'
============================

 56%|█████▋    | 583/1034 [1:10:17<54:36,  7.26s/it]

SELECT section_description FROM sections WHERE section_name = "h"
SELECT section_description FROM Sections WHERE section_name  =  'h'
============================

 56%|█████▋    | 584/1034 [1:10:25<54:27,  7.26s/it]

SELECT first_name FROM students WHERE permanent_address_id IN (SELECT address_id FROM addresses WHERE country = "Haiti") OR cell_mobile_number = "09700166582"
select t1.first_name from students as t1 join addresses as t2 on t1.permanent_address_id  =  t2.address_id where t2.country  =  'haiti' or t1.cell_mobile_number  =  '09700166582'
============================

 57%|█████▋    | 585/1034 [1:10:32<54:24,  7.27s/it]

SELECT first_name FROM students WHERE permanent_address_id IN (SELECT address_id FROM addresses WHERE country = "Haiti") OR cell_mobile_number = "09700166582"
select t1.first_name from students as t1 join addresses as t2 on t1.permanent_address_id  =  t2.address_id where t2.country  =  'haiti' or t1.cell_mobile_number  =  '09700166582'
============================

 57%|█████▋    | 586/1034 [1:10:39<54:22,  7.28s/it]

SELECT title FROM cartoon ORDER BY title ASC
SELECT Title FROM Cartoon ORDER BY title
============================

 57%|█████▋    | 587/1034 [1:10:47<54:27,  7.31s/it]

SELECT title FROM cartoon ORDER BY title ASC
SELECT Title FROM Cartoon ORDER BY title
============================

 57%|█████▋    | 588/1034 [1:10:54<54:05,  7.28s/it]

SELECT title FROM cartoons WHERE director = "Ben Jones"
SELECT Title FROM Cartoon WHERE Directed_by = "Ben Jones";
============================

 57%|█████▋    | 589/1034 [1:11:01<53:53,  7.27s/it]

SELECT title FROM cartoon WHERE directed_by = "Ben Jones"
SELECT Title FROM Cartoon WHERE Directed_by = "Ben Jones";
============================

 57%|█████▋    | 590/1034 [1:11:08<53:28,  7.23s/it]

SELECT COUNT(*) FROM cartoon WHERE written_by = "Joseph Kuhr"
SELECT count(*) FROM Cartoon WHERE Written_by = "Joseph Kuhr";
============================

 57%|█████▋    | 591/1034 [1:11:15<53:17,  7.22s/it]

SELECT COUNT(*) FROM cartoons as t1 JOIN writers as t2 ON t1.writer_id = t2.writer_id WHERE t2.name = "Joseph Kuhr"
SELECT count(*) FROM Cartoon WHERE Written_by = "Joseph Kuhr";
============================

 57%|█████▋    | 592/1034 [1:11:23<53:15,  7.23s/it]

SELECT title , director FROM cartoons ORDER BY air_date
SELECT title ,  Directed_by FROM Cartoon ORDER BY Original_air_date
============================

 57%|█████▋    | 593/1034 [1:11:30<53:15,  7.25s/it]

SELECT title , directed_by FROM cartoon ORDER BY original_air_date
SELECT title ,  Directed_by FROM Cartoon ORDER BY Original_air_date
============================

 57%|█████▋    | 594/1034 [1:11:37<53:14,  7.26s/it]

SELECT title FROM cartoon WHERE directed_by = "Ben Jones" OR directed_by = "Brandon Vietti"
SELECT Title FROM Cartoon WHERE Directed_by = "Ben Jones" OR Directed_by = "Brandon Vietti";
============================

 58%|█████▊    | 595/1034 [1:11:44<52:57,  7.24s/it]

SELECT title FROM cartoon WHERE directed_by = "Ben Jones" OR directed_by = "Brandon Vietti"
SELECT Title FROM Cartoon WHERE Directed_by = "Ben Jones" OR Directed_by = "Brandon Vietti";
============================

 58%|█████▊    | 596/1034 [1:11:52<52:54,  7.25s/it]

SELECT country , COUNT(*) FROM TV_Channel GROUP BY country ORDER BY COUNT(*) DESC LIMIT 1
SELECT Country ,  count(*) FROM TV_Channel GROUP BY Country ORDER BY count(*) DESC LIMIT 1;
============================

 58%|█████▊    | 597/1034 [1:11:59<52:59,  7.28s/it]

SELECT country , COUNT(*) FROM TV_Channel GROUP BY country ORDER BY COUNT(*) DESC LIMIT 1
SELECT Country ,  count(*) FROM TV_Channel GROUP BY Country ORDER BY count(*) DESC LIMIT 1;
============================

 58%|█████▊    | 598/1034 [1:12:06<52:40,  7.25s/it]

SELECT COUNT(DISTINCT series_name) , COUNT(DISTINCT content) FROM TV_Channel
SELECT count(DISTINCT series_name) ,  count(DISTINCT content) FROM TV_Channel;
============================

 58%|█████▊    | 599/1034 [1:12:13<52:26,  7.23s/it]

SELECT COUNT(DISTINCT series_name) , COUNT(DISTINCT content) FROM TV_Channel
SELECT count(DISTINCT series_name) ,  count(DISTINCT content) FROM TV_Channel;
============================

 58%|█████▊    | 600/1034 [1:12:21<52:14,  7.22s/it]

SELECT content FROM TV_Channel WHERE series_name = "Sky Radio"
SELECT Content FROM TV_Channel WHERE series_name = "Sky Radio";
============================

 58%|█████▊    | 601/1034 [1:12:28<52:16,  7.24s/it]

SELECT content FROM TV_Channel WHERE series_name = "Sky Radio"
SELECT Content FROM TV_Channel WHERE series_name = "Sky Radio";
============================

 58%|█████▊    | 602/1034 [1:12:35<52:07,  7.24s/it]

SELECT package_option FROM tv_channels WHERE serial_name = "Sky Radio"
SELECT Package_Option FROM TV_Channel WHERE series_name = "Sky Radio";
============================

 58%|█████▊    | 603/1034 [1:12:42<52:00,  7.24s/it]

SELECT t2.package_option FROM tv_series as t1 JOIN tv_channel as t2 ON t1.channel = t2.id WHERE t2.series_name = "Sky Radio"
SELECT Package_Option FROM TV_Channel WHERE series_name = "Sky Radio";
============================

 58%|█████▊    | 604/1034 [1:12:50<51:52,  7.24s/it]

SELECT COUNT(*) FROM TV_Channel WHERE language = "English"
SELECT count(*) FROM TV_Channel WHERE LANGUAGE = "English";
============================

 59%|█████▊    | 605/1034 [1:12:57<51:44,  7.24s/it]

SELECT COUNT(*) FROM TV_Channel WHERE Language = "English"
SELECT count(*) FROM TV_Channel WHERE LANGUAGE = "English";
============================

 59%|█████▊    | 606/1034 [1:13:04<51:41,  7.25s/it]

SELECT language , COUNT(*) FROM TV_Channel GROUP BY language ORDER BY COUNT(*) ASC LIMIT 1
SELECT LANGUAGE ,  count(*) FROM TV_Channel GROUP BY LANGUAGE ORDER BY count(*) ASC LIMIT 1;
============================

 59%|█████▊    | 607/1034 [1:13:11<51:30,  7.24s/it]

SELECT language , COUNT(*) FROM TV_Channel GROUP BY language ORDER BY COUNT(*) ASC LIMIT 1
SELECT LANGUAGE ,  count(*) FROM TV_Channel GROUP BY LANGUAGE ORDER BY count(*) ASC LIMIT 1;
============================

 59%|█████▉    | 608/1034 [1:13:18<51:19,  7.23s/it]

SELECT language , COUNT(*) FROM TV_Channel GROUP BY language
SELECT LANGUAGE ,  count(*) FROM TV_Channel GROUP BY LANGUAGE
============================

 59%|█████▉    | 609/1034 [1:13:26<51:13,  7.23s/it]

SELECT language , COUNT(*) FROM TV_Channel GROUP BY language
SELECT LANGUAGE ,  count(*) FROM TV_Channel GROUP BY LANGUAGE
============================

 59%|█████▉    | 610/1034 [1:13:33<51:11,  7.24s/it]

SELECT t1.series_name FROM TV_Channel as t1 JOIN Cartoon as t2 ON t1.id = t2.channel WHERE t2.title = "The Rise of the Blue Beetle!"
SELECT T1.series_name FROM TV_Channel AS T1 JOIN Cartoon AS T2 ON T1.id = T2.Channel WHERE T2.Title = "The Rise of the Blue Beetle!";
============================

 59%|█████▉    | 611/1034 [1:13:40<51:06,  7.25s/it]

SELECT t1.series_name FROM TV_Channel as t1 JOIN Cartoon as t2 ON t1.id = t2.channel WHERE t2.title = "The Rise of the Blue Beetle"
SELECT T1.series_name FROM TV_Channel AS T1 JOIN Cartoon AS T2 ON T1.id = T2.Channel WHERE T2.Title = "The Rise of the Blue Beetle!";
============================

 59%|█████▉    | 612/1034 [1:13:47<51:03,  7.26s/it]

SELECT t2.title FROM TV_Channel as t1 JOIN Cartoon as t2 ON t1.id = t2.channel WHERE t1.series_name = "Sky Radio"
SELECT T2.Title FROM TV_Channel AS T1 JOIN Cartoon AS T2 ON T1.id = T2.Channel WHERE T1.series_name = "Sky Radio";
============================

 59%|█████▉    | 613/1034 [1:13:55<50:58,  7.26s/it]

SELECT t2.title FROM tv_channel as t1 JOIN cartoon as t2 ON t1.id = t2.channel WHERE t1.series_name = "Sky Radio"
SELECT T2.Title FROM TV_Channel AS T1 JOIN Cartoon AS T2 ON T1.id = T2.Channel WHERE T1.series_name = "Sky Radio";
============================

 59%|█████▉    | 614/1034 [1:14:02<50:47,  7.26s/it]

SELECT episode FROM tvseries ORDER BY rating
SELECT Episode FROM TV_series ORDER BY rating
============================

 59%|█████▉    | 615/1034 [1:14:09<50:36,  7.25s/it]

SELECT episode FROM tv_series ORDER BY rating
SELECT Episode FROM TV_series ORDER BY rating
============================

 60%|█████▉    | 616/1034 [1:14:16<50:26,  7.24s/it]

SELECT episode , rating FROM TV_series ORDER BY rating DESC LIMIT 3
SELECT Episode ,  Rating FROM TV_series ORDER BY Rating DESC LIMIT 3;
============================

 60%|█████▉    | 617/1034 [1:14:24<50:20,  7.24s/it]

SELECT episode , rating FROM TV_series ORDER BY rating DESC LIMIT 3
SELECT Episode ,  Rating FROM TV_series ORDER BY Rating DESC LIMIT 3;
============================

 60%|█████▉    | 618/1034 [1:14:31<50:16,  7.25s/it]

SELECT MIN(share) , MAX(share) FROM TV_series
SELECT max(SHARE) , min(SHARE) FROM TV_series;
============================

 60%|█████▉    | 619/1034 [1:14:38<50:16,  7.27s/it]

SELECT MAX(share) , MIN(share) FROM TV_series
SELECT max(SHARE) , min(SHARE) FROM TV_series;
============================

 60%|█████▉    | 620/1034 [1:14:46<50:10,  7.27s/it]

SELECT air_date FROM TV_series WHERE episode = "A Love of a Lifetime"
SELECT Air_Date FROM TV_series WHERE Episode = "A Love of a Lifetime";
============================

 60%|██████    | 621/1034 [1:14:53<50:08,  7.28s/it]

SELECT air_date FROM TV_series WHERE episode = "A Love of a Lifetime"
SELECT Air_Date FROM TV_series WHERE Episode = "A Love of a Lifetime";
============================

 60%|██████    | 622/1034 [1:15:00<49:49,  7.26s/it]

SELECT weekly_rank FROM TV_series WHERE episode = "A Love of a Lifetime"
SELECT Weekly_Rank FROM TV_series WHERE Episode = "A Love of a Lifetime";
============================

 60%|██████    | 623/1034 [1:15:07<49:37,  7.24s/it]

SELECT weekly_rank FROM TV_series WHERE episode = "A Love of a Lifetime"
SELECT Weekly_Rank FROM TV_series WHERE Episode = "A Love of a Lifetime";
============================

 60%|██████    | 624/1034 [1:15:15<49:31,  7.25s/it]

SELECT t2.series_name FROM TV_series as t1 JOIN TV_Channel as t2 ON t1.channel = t2.id WHERE t1.episode = "A Love of a Lifetime"
SELECT T1.series_name FROM TV_Channel AS T1 JOIN TV_series AS T2 ON T1.id = T2.Channel WHERE T2.Episode = "A Love of a Lifetime";
============================

 60%|██████    | 625/1034 [1:15:22<49:24,  7.25s/it]

SELECT series_name FROM TV_Channel WHERE episode = "A Love of a Lifetime"
SELECT T1.series_name FROM TV_Channel AS T1 JOIN TV_series AS T2 ON T1.id = T2.Channel WHERE T2.Episode = "A Love of a Lifetime";
============================

 61%|██████    | 626/1034 [1:15:29<49:20,  7.26s/it]

SELECT t1.episode FROM tv_series as t1 JOIN tv_channel as t2 ON t1.channel = t2.id WHERE t2.series_name = "Sky Radio"
SELECT T2.Episode FROM TV_Channel AS T1 JOIN TV_series AS T2 ON T1.id = T2.Channel WHERE T1.series_name = "Sky Radio";
============================

 61%|██████    | 627/1034 [1:15:36<49:10,  7.25s/it]

SELECT episode FROM TV_series WHERE channel = "Sky Radio"
SELECT T2.Episode FROM TV_Channel AS T1 JOIN TV_series AS T2 ON T1.id = T2.Channel WHERE T1.series_name = "Sky Radio";
============================

 61%|██████    | 628/1034 [1:15:44<48:58,  7.24s/it]

SELECT directed_by , COUNT(*) FROM cartoon GROUP BY directed_by
SELECT count(*) ,  Directed_by FROM cartoon GROUP BY Directed_by
============================

 61%|██████    | 629/1034 [1:15:51<48:51,  7.24s/it]

SELECT directed_by , COUNT(*) FROM cartoon GROUP BY directed_by
SELECT count(*) ,  Directed_by FROM cartoon GROUP BY Directed_by
============================

 61%|██████    | 630/1034 [1:15:58<48:44,  7.24s/it]

SELECT production_code , channel FROM cartoon ORDER BY original_air_date DESC LIMIT 1
select production_code ,  channel from cartoon order by original_air_date desc limit 1
============================

 61%|██████    | 631/1034 [1:16:05<48:34,  7.23s/it]

SELECT production_code , channel FROM cartoon ORDER BY original_air_date DESC LIMIT 1
select production_code ,  channel from cartoon order by original_air_date desc limit 1
============================

 61%|██████    | 632/1034 [1:16:12<48:30,  7.24s/it]

SELECT package_option , series_name FROM TV_Channel WHERE hight_definition_tv = "yes"
SELECT package_option ,  series_name FROM TV_Channel WHERE hight_definition_TV  =  "yes"
============================

 61%|██████    | 633/1034 [1:16:20<48:25,  7.24s/it]

SELECT t2.package_option , t2.series_name FROM tv_series as t1 JOIN tv_channel as t2 ON t1.channel = t2.id WHERE t2.hight_definition_tv = "yes"
SELECT package_option ,  series_name FROM TV_Channel WHERE hight_definition_TV  =  "yes"
============================

 61%|██████▏   | 634/1034 [1:16:27<48:20,  7.25s/it]

SELECT t2.country FROM cartoon as t1 JOIN tv_channel as t2 ON t1.channel = t2.id WHERE t1.written_by = "Todd Casey"
SELECT T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.written_by  =  'Todd Casey'
============================

 61%|██████▏   | 635/1034 [1:16:34<48:13,  7.25s/it]

SELECT t1.country FROM tv_channel as t1 JOIN cartoon as t2 ON t1.id = t2.channel WHERE t2.written_by = "Todd Casey" GROUP BY t1.country
SELECT T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.written_by  =  'Todd Casey'
============================

 62%|██████▏   | 636/1034 [1:16:41<48:05,  7.25s/it]

SELECT country FROM tv_channel WHERE id NOT IN (SELECT channel FROM cartoon WHERE written_by = "Todd Casey")
SELECT country FROM TV_Channel EXCEPT SELECT T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.written_by  =  'Todd Casey'
============================

 62%|██████▏   | 637/1034 [1:16:49<47:54,  7.24s/it]

SELECT country FROM tv_channel EXCEPT SELECT t2.channel FROM cartoon as t1 JOIN tv_channel as t2 ON t1.channel = t2.id WHERE t1.written_by = "Todd Casey"
SELECT country FROM TV_Channel EXCEPT SELECT T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.written_by  =  'Todd Casey'
============================

 62%|██████▏   | 638/1034 [1:16:56<47:47,  7.24s/it]

SELECT t2.series_name , t2.country FROM cartoon as t1 JOIN tv_channel as t2 ON t1.channel = t2.id WHERE t1.directed_by = "Ben Jones" INTERSECT SELECT t2.series_name , t2.country FROM cartoon as t1 JOIN tv_channel as t2 ON t1.channel = t2.id WHERE t1.directed_by = "Michael Chang"
SELECT T1.series_name ,  T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.directed_by  =  'Michael Chang' INTERSECT SELECT T1.series_name ,  T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.directed_by  =  'Ben Jones'
============================

 62%|██████▏   | 639/1034 [1:17:03<47:35,  7.23s/it]

SELECT t2.series_name , t2.country FROM cartoon as t1 JOIN tv_channel as t2 ON t1.channel = t2.id WHERE t1.directed_by = "Ben Jones" INTERSECT SELECT t2.series_name , t2.country FROM cartoon as t1 JOIN tv_channel as t2 ON t1.channel = t2.id WHERE t1.directed_by = "Michael Chang"
SELECT T1.series_name ,  T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.directed_by  =  'Michael Chang' INTERSECT SELECT T1.series_name ,  T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.directed_by  =  'Ben Jones'
============================

 62%|██████▏   | 640/1034 [1:17:10<47:19,  7.21s/it]

SELECT pixel_aspect_ratio_par , country FROM TV_Channel WHERE language != "English"
SELECT Pixel_aspect_ratio_PAR ,  country FROM tv_channel WHERE LANGUAGE != 'English'
============================

 62%|██████▏   | 641/1034 [1:17:17<47:07,  7.19s/it]

SELECT pixel_aspect_ratio_par , country FROM TV_Channel WHERE language != "English"
SELECT Pixel_aspect_ratio_PAR ,  country FROM tv_channel WHERE LANGUAGE != 'English'
============================

 62%|██████▏   | 642/1034 [1:17:25<47:08,  7.22s/it]

SELECT id FROM TV_Channel GROUP BY country HAVING COUNT(*) > 2
SELECT id FROM tv_channel GROUP BY country HAVING count(*)  >  2
============================

 62%|██████▏   | 643/1034 [1:17:32<47:08,  7.23s/it]

SELECT id FROM TV_Channel GROUP BY series_name HAVING COUNT(*) > 2
SELECT id FROM tv_channel GROUP BY country HAVING count(*)  >  2
============================

 62%|██████▏   | 644/1034 [1:17:39<47:09,  7.25s/it]

SELECT channel FROM cartoon EXCEPT SELECT channel FROM cartoon WHERE directed_by = "Ben Jones"
SELECT id FROM TV_Channel EXCEPT SELECT channel FROM cartoon WHERE directed_by  =  'Ben Jones'
============================

 62%|██████▏   | 645/1034 [1:17:47<46:58,  7.25s/it]

SELECT id FROM TV_Channel EXCEPT SELECT channel FROM Cartoon WHERE directed_by = "Ben Jones"
SELECT id FROM TV_Channel EXCEPT SELECT channel FROM cartoon WHERE directed_by  =  'Ben Jones'
============================

 62%|██████▏   | 646/1034 [1:17:54<46:48,  7.24s/it]

SELECT package_option FROM TV_Channel EXCEPT SELECT t2.package_option FROM Cartoon as t1 JOIN TV_Channel as t2 ON t1.channel = t2.id WHERE t1.directed_by = "Ben Jones"
SELECT package_option FROM TV_Channel WHERE id NOT IN (SELECT channel FROM cartoon WHERE directed_by  =  'Ben Jones')
============================

 63%|██████▎   | 647/1034 [1:18:01<46:37,  7.23s/it]

SELECT package_option FROM tv_channel WHERE id NOT IN (SELECT channel FROM cartoon WHERE directed_by = "Ben Jones")
SELECT package_option FROM TV_Channel WHERE id NOT IN (SELECT channel FROM cartoon WHERE directed_by  =  'Ben Jones')
============================

 63%|██████▎   | 648/1034 [1:18:08<46:21,  7.21s/it]

SELECT COUNT(*) FROM poker_player
SELECT count(*) FROM poker_player
============================

 63%|██████▎   | 649/1034 [1:18:15<46:05,  7.18s/it]

SELECT COUNT(*) FROM poker_player
SELECT count(*) FROM poker_player
============================

 63%|██████▎   | 650/1034 [1:18:22<46:01,  7.19s/it]

SELECT earnings FROM poker_player ORDER BY earnings DESC
SELECT Earnings FROM poker_player ORDER BY Earnings DESC
============================

 63%|██████▎   | 651/1034 [1:18:30<45:54,  7.19s/it]

SELECT earnings FROM poker_player ORDER BY earnings DESC
SELECT Earnings FROM poker_player ORDER BY Earnings DESC
============================

 63%|██████▎   | 652/1034 [1:18:37<46:02,  7.23s/it]

SELECT t1.name , t2.finish FROM players as t1 JOIN poker as t2 ON t1.id = t2.player_id ORDER BY t2.finish LIMIT 1
SELECT Final_Table_Made ,  Best_Finish FROM poker_player
============================

 63%|██████▎   | 653/1034 [1:18:44<46:07,  7.27s/it]

SELECT final_table_made , best_finish FROM poker_player
SELECT Final_Table_Made ,  Best_Finish FROM poker_player
============================

 63%|██████▎   | 654/1034 [1:18:52<45:54,  7.25s/it]

SELECT AVG(earnings) FROM poker_player
SELECT avg(Earnings) FROM poker_player
============================

 63%|██████▎   | 655/1034 [1:18:59<45:46,  7.25s/it]

SELECT AVG(earnings) FROM poker_player
SELECT avg(Earnings) FROM poker_player
============================

 63%|██████▎   | 656/1034 [1:19:06<45:38,  7.25s/it]

SELECT money_rank FROM poker_player ORDER BY earnings DESC LIMIT 1
SELECT Money_Rank FROM poker_player ORDER BY Earnings DESC LIMIT 1
============================

 64%|██████▎   | 657/1034 [1:19:13<45:32,  7.25s/it]

SELECT money_rank FROM poker_player ORDER BY earnings DESC LIMIT 1
SELECT Money_Rank FROM poker_player ORDER BY Earnings DESC LIMIT 1
============================

 64%|██████▎   | 658/1034 [1:19:20<45:21,  7.24s/it]

SELECT MAX(final_table_made) FROM poker_player WHERE earnings < 200000
SELECT max(Final_Table_Made) FROM poker_player WHERE Earnings  <  200000
============================

 64%|██████▎   | 659/1034 [1:19:28<45:17,  7.25s/it]

SELECT MAX(final_table_made) FROM poker_player WHERE earnings < 200000
SELECT max(Final_Table_Made) FROM poker_player WHERE Earnings  <  200000
============================

 64%|██████▍   | 660/1034 [1:19:35<45:10,  7.25s/it]

SELECT t1.name FROM people as t1 JOIN poker_player as t2 ON t1.people_id = t2.people_id
SELECT T1.Name FROM people AS T1 JOIN poker_player AS T2 ON T1.People_ID  =  T2.People_ID
============================

 64%|██████▍   | 661/1034 [1:19:42<45:21,  7.30s/it]

SELECT t1.name FROM people as t1 JOIN poker_player as t2 ON t1.people_id = t2.people_id
SELECT T1.Name FROM people AS T1 JOIN poker_player AS T2 ON T1.People_ID  =  T2.People_ID
============================

 64%|██████▍   | 662/1034 [1:19:50<45:06,  7.28s/it]

SELECT t1.name FROM people as t1 JOIN poker_player as t2 ON t1.people_id = t2.people_id WHERE t2.earnings > 300000
SELECT T1.Name FROM people AS T1 JOIN poker_player AS T2 ON T1.People_ID  =  T2.People_ID WHERE T2.Earnings  >  300000
============================

 64%|██████▍   | 663/1034 [1:19:57<44:54,  7.26s/it]

SELECT t2.name FROM poker_player as t1 JOIN people as t2 ON t1.people_id = t2.people_id WHERE t1.earnings > 300000
SELECT T1.Name FROM people AS T1 JOIN poker_player AS T2 ON T1.People_ID  =  T2.People_ID WHERE T2.Earnings  >  300000
============================

 64%|██████▍   | 664/1034 [1:20:04<44:43,  7.25s/it]

SELECT t1.name FROM people as t1 JOIN poker_player as t2 ON t1.people_id = t2.people_id ORDER BY t2.final_table_made ASC
SELECT T1.Name FROM people AS T1 JOIN poker_player AS T2 ON T1.People_ID  =  T2.People_ID ORDER BY T2.Final_Table_Made
============================

 64%|██████▍   | 665/1034 [1:20:11<44:34,  7.25s/it]

SELECT t2.name FROM poker_player as t1 JOIN people as t2 ON t1.people_id = t2.people_id ORDER BY t1.final_table_made ASC
SELECT T1.Name FROM people AS T1 JOIN poker_player AS T2 ON T1.People_ID  =  T2.People_ID ORDER BY T2.Final_Table_Made
============================

 64%|██████▍   | 666/1034 [1:20:19<44:24,  7.24s/it]

SELECT t1.birth_date FROM people as t1 JOIN poker_player as t2 ON t1.people_id = t2.people_id ORDER BY t2.earnings LIMIT 1
SELECT T1.Birth_Date FROM people AS T1 JOIN poker_player AS T2 ON T1.People_ID  =  T2.People_ID ORDER BY T2.Earnings ASC LIMIT 1
============================

 65%|██████▍   | 667/1034 [1:20:26<44:11,  7.22s/it]

SELECT t1.birth_date FROM people as t1 JOIN poker_player as t2 ON t1.people_id = t2.people_id ORDER BY t2.earnings LIMIT 1
SELECT T1.Birth_Date FROM people AS T1 JOIN poker_player AS T2 ON T1.People_ID  =  T2.People_ID ORDER BY T2.Earnings ASC LIMIT 1
============================

 65%|██████▍   | 668/1034 [1:20:33<44:02,  7.22s/it]

SELECT money_rank FROM poker_player ORDER BY earnings DESC LIMIT 1
SELECT T2.Money_Rank FROM people AS T1 JOIN poker_player AS T2 ON T1.People_ID  =  T2.People_ID ORDER BY T1.Height DESC LIMIT 1
============================

 65%|██████▍   | 669/1034 [1:20:40<43:49,  7.20s/it]

SELECT money_rank FROM poker_player ORDER BY earnings DESC LIMIT 1
SELECT T2.Money_Rank FROM people AS T1 JOIN poker_player AS T2 ON T1.People_ID  =  T2.People_ID ORDER BY T1.Height DESC LIMIT 1
============================

 65%|██████▍   | 670/1034 [1:20:47<43:39,  7.20s/it]

SELECT AVG(t2.earnings) FROM people as t1 JOIN poker_player as t2 ON t1.people_id = t2.people_id WHERE t1.height > 200
SELECT avg(T2.Earnings) FROM people AS T1 JOIN poker_player AS T2 ON T1.People_ID  =  T2.People_ID WHERE T1.Height  >  200
============================

 65%|██████▍   | 671/1034 [1:20:55<43:38,  7.21s/it]

SELECT AVG(t2.earnings) FROM people as t1 JOIN poker_player as t2 ON t1.people_id = t2.people_id WHERE t1.height > 200
SELECT avg(T2.Earnings) FROM people AS T1 JOIN poker_player AS T2 ON T1.People_ID  =  T2.People_ID WHERE T1.Height  >  200
============================

 65%|██████▍   | 672/1034 [1:21:02<43:27,  7.20s/it]

SELECT t1.name FROM people as t1 JOIN poker_player as t2 ON t1.people_id = t2.people_id ORDER BY earnings DESC
SELECT T1.Name FROM people AS T1 JOIN poker_player AS T2 ON T1.People_ID  =  T2.People_ID ORDER BY T2.Earnings DESC
============================

 65%|██████▌   | 673/1034 [1:21:09<43:18,  7.20s/it]

SELECT t2.name FROM poker_player as t1 JOIN people as t2 ON t1.people_id = t2.people_id ORDER BY earnings DESC
SELECT T1.Name FROM people AS T1 JOIN poker_player AS T2 ON T1.People_ID  =  T2.People_ID ORDER BY T2.Earnings DESC
============================

 65%|██████▌   | 674/1034 [1:21:16<43:19,  7.22s/it]

SELECT nationality , COUNT(*) FROM people GROUP BY nationality
SELECT Nationality ,  COUNT(*) FROM people GROUP BY Nationality
============================

 65%|██████▌   | 675/1034 [1:21:23<43:18,  7.24s/it]

SELECT nationality , COUNT(*) FROM people GROUP BY nationality
SELECT Nationality ,  COUNT(*) FROM people GROUP BY Nationality
============================

 65%|██████▌   | 676/1034 [1:21:31<43:12,  7.24s/it]

SELECT nationality FROM people GROUP BY nationality ORDER BY COUNT(*) DESC LIMIT 1
SELECT Nationality FROM people GROUP BY Nationality ORDER BY COUNT(*) DESC LIMIT 1
============================

 65%|██████▌   | 677/1034 [1:21:38<43:07,  7.25s/it]

SELECT nationality FROM people GROUP BY nationality ORDER BY COUNT(*) DESC LIMIT 1
SELECT Nationality FROM people GROUP BY Nationality ORDER BY COUNT(*) DESC LIMIT 1
============================

 66%|██████▌   | 678/1034 [1:21:45<43:06,  7.26s/it]

SELECT nationality FROM people GROUP BY nationality HAVING COUNT(*) >= 2
SELECT Nationality FROM people GROUP BY Nationality HAVING COUNT(*)  >=  2
============================

 66%|██████▌   | 679/1034 [1:21:52<42:53,  7.25s/it]

SELECT nationality FROM people GROUP BY nationality HAVING COUNT(*) >= 2
SELECT Nationality FROM people GROUP BY Nationality HAVING COUNT(*)  >=  2
============================

 66%|██████▌   | 680/1034 [1:22:00<42:35,  7.22s/it]

SELECT name , birth_date FROM people ORDER BY name ASC
SELECT Name ,  Birth_Date FROM people ORDER BY Name ASC
============================

 66%|██████▌   | 681/1034 [1:22:07<42:36,  7.24s/it]

SELECT name , birth_date FROM people ORDER BY name ASC
SELECT Name ,  Birth_Date FROM people ORDER BY Name ASC
============================

 66%|██████▌   | 682/1034 [1:22:14<42:38,  7.27s/it]

SELECT name FROM people WHERE nationality != "Russia"
SELECT Name FROM people WHERE Nationality != "Russia"
============================

 66%|██████▌   | 683/1034 [1:22:22<42:31,  7.27s/it]

SELECT name FROM people WHERE nationality != "Russia"
SELECT Name FROM people WHERE Nationality != "Russia"
============================

 66%|██████▌   | 684/1034 [1:22:29<42:25,  7.27s/it]

SELECT name FROM people WHERE people_id NOT IN (SELECT people_id FROM poker_player)
SELECT Name FROM people WHERE People_ID NOT IN (SELECT People_ID FROM poker_player)
============================

 66%|██████▌   | 685/1034 [1:22:36<42:15,  7.27s/it]

SELECT name FROM people WHERE people_id NOT IN (SELECT people_id FROM poker_player)
SELECT Name FROM people WHERE People_ID NOT IN (SELECT People_ID FROM poker_player)
============================

 66%|██████▋   | 686/1034 [1:22:43<42:14,  7.28s/it]

SELECT COUNT(DISTINCT nationality) FROM people
SELECT count(DISTINCT Nationality) FROM people
============================

 66%|██████▋   | 687/1034 [1:22:51<42:00,  7.26s/it]

SELECT COUNT(DISTINCT nationality) FROM people
SELECT count(DISTINCT Nationality) FROM people
============================

 67%|██████▋   | 688/1034 [1:22:58<41:38,  7.22s/it]

SELECT COUNT(state) FROM states
SELECT count(*) FROM area_code_state
============================

 67%|██████▋   | 689/1034 [1:23:05<41:21,  7.19s/it]

SELECT contestant_number , contestant_name FROM contestants ORDER BY contestant_name DESC
SELECT contestant_number ,  contestant_name FROM contestants ORDER BY contestant_name DESC
============================

 67%|██████▋   | 690/1034 [1:23:12<41:07,  7.17s/it]

SELECT vote_id , phone_number , state FROM votes
SELECT vote_id ,  phone_number ,  state FROM votes
============================

 67%|██████▋   | 691/1034 [1:23:19<40:55,  7.16s/it]

SELECT MAX(area_code) , MIN(area_code) FROM phone_numbers
SELECT max(area_code) ,  min(area_code) FROM area_code_state
============================

 67%|██████▋   | 692/1034 [1:23:26<40:50,  7.16s/it]

SELECT MAX(date_created) FROM votes WHERE state = 'CA'
SELECT max(created) FROM votes WHERE state  =  'CA'
============================

 67%|██████▋   | 693/1034 [1:23:33<40:39,  7.15s/it]

SELECT name FROM contestants WHERE name != 'Jessie Alloway'
SELECT contestant_name FROM contestants WHERE contestant_name != 'Jessie Alloway'
============================

 67%|██████▋   | 694/1034 [1:23:41<40:40,  7.18s/it]

SELECT DISTINCT state , create_time FROM votes
SELECT DISTINCT state ,  created FROM votes
============================

 67%|██████▋   | 695/1034 [1:23:48<40:59,  7.26s/it]

SELECT t1.contestant_number , t1.name FROM contestants as t1 JOIN votes as t2 ON t1.contestant_number = t2.contestant_number GROUP BY t1.contestant_number HAVING COUNT(*) >= 2
SELECT T1.contestant_number , T1.contestant_name FROM contestants AS T1 JOIN votes AS T2 ON T1.contestant_number  =  T2.contestant_number GROUP BY T1.contestant_number HAVING count(*)  >=  2
============================

 67%|██████▋   | 696/1034 [1:23:55<40:42,  7.23s/it]

SELECT contestant_number , contestant_name FROM contestants ORDER BY votes ASC LIMIT 1
SELECT T1.contestant_number , T1.contestant_name FROM contestants AS T1 JOIN votes AS T2 ON T1.contestant_number  =  T2.contestant_number GROUP BY T1.contestant_number ORDER BY count(*) ASC LIMIT 1
============================

 67%|██████▋   | 697/1034 [1:24:02<40:26,  7.20s/it]

SELECT COUNT(*) FROM votes WHERE state = 'NY' OR state = 'CA'
SELECT count(*) FROM votes WHERE state  =  'NY' OR state  =  'CA'
============================

 68%|██████▊   | 698/1034 [1:24:10<40:18,  7.20s/it]

SELECT COUNT(*) FROM contestants WHERE vote_status = "did not vote"
SELECT count(*) FROM contestants WHERE contestant_number NOT IN ( SELECT contestant_number FROM votes )
============================

 68%|██████▊   | 699/1034 [1:24:17<40:15,  7.21s/it]

SELECT area_code FROM voters GROUP BY area_code ORDER BY COUNT(*) DESC LIMIT 1
SELECT T1.area_code FROM area_code_state AS T1 JOIN votes AS T2 ON T1.state  =  T2.state GROUP BY T1.area_code ORDER BY count(*) DESC LIMIT 1
============================

 68%|██████▊   | 700/1034 [1:24:24<40:09,  7.21s/it]

SELECT create_date , state , phone_number FROM votes AS t1 JOIN contestants AS t2 ON t1.contestant_id = t2.id WHERE t2.name = 'Tabatha Gehling'
SELECT T2.created ,  T2.state ,  T2.phone_number FROM contestants AS T1 JOIN votes AS T2 ON T1.contestant_number  =  T2.contestant_number WHERE T1.contestant_name  =  'Tabatha Gehling'
============================

 68%|██████▊   | 701/1034 [1:24:31<40:03,  7.22s/it]

SELECT t1.area_code FROM voters as t1 JOIN votes as t2 ON t1.id = t2.voter_id WHERE t2.contestant = 'Tabatha Gehling' INTERSECT SELECT t1.area_code FROM voters as t1 JOIN votes as t2 ON t1.id = t2.voter_id WHERE t2.contestant = 'Kelly Clauss'
SELECT T3.area_code FROM contestants AS T1 JOIN votes AS T2 ON T1.contestant_number  =  T2.contestant_number JOIN area_code_state AS T3 ON T2.state  =  T3.state WHERE T1.contestant_name  =  'Tabatha Gehling' INTERSECT SELECT T3.area_code FROM contestants AS T1 JOIN votes AS T2 ON T1.contestant_number  =  T2.contestant_number JOIN area_code_state AS T3 ON T2.state  =  T3.state WHERE T1.contestant_name  =  'Kelly Clauss'
============================

 68%|██████▊   | 702/1034 [1:24:38<39:56,  7.22s/it]

SELECT name FROM contestants WHERE name LIKE '%Al%'
select contestant_name from contestants where contestant_name like "%al%"
============================

 68%|██████▊   | 703/1034 [1:24:46<39:49,  7.22s/it]

SELECT name FROM country WHERE indepyear > 1950
SELECT Name FROM country WHERE IndepYear  >  1950
============================

 68%|██████▊   | 704/1034 [1:24:53<39:44,  7.23s/it]

SELECT name FROM country WHERE indepyear > 1950
SELECT Name FROM country WHERE IndepYear  >  1950
============================

 68%|██████▊   | 705/1034 [1:25:00<39:34,  7.22s/it]

SELECT COUNT(*) FROM country WHERE governmentform = "Republic"
SELECT count(*) FROM country WHERE GovernmentForm  =  "Republic"
============================

 68%|██████▊   | 706/1034 [1:25:07<39:32,  7.23s/it]

SELECT COUNT(*) FROM country WHERE governmentform = "Republic"
SELECT count(*) FROM country WHERE GovernmentForm  =  "Republic"
============================

 68%|██████▊   | 707/1034 [1:25:15<39:26,  7.24s/it]

SELECT SUM(surface_area) FROM countries WHERE region = "Caribbean"
SELECT sum(SurfaceArea) FROM country WHERE Region  =  "Caribbean"
============================

 68%|██████▊   | 708/1034 [1:25:22<39:12,  7.22s/it]

SELECT SUM(surface_area) FROM countries WHERE region = "Caribbean"
SELECT sum(SurfaceArea) FROM country WHERE Region  =  "Caribbean"
============================

 69%|██████▊   | 709/1034 [1:25:29<39:18,  7.26s/it]

SELECT continent FROM country WHERE name = "Anguilla"
SELECT Continent FROM country WHERE Name  =  "Anguilla"
============================

 69%|██████▊   | 710/1034 [1:25:36<39:08,  7.25s/it]

SELECT continent FROM country WHERE name = "Anguilla"
SELECT Continent FROM country WHERE Name  =  "Anguilla"
============================

 69%|██████▉   | 711/1034 [1:25:44<38:58,  7.24s/it]

SELECT district FROM city WHERE name = "Kabul"
SELECT Region FROM country AS T1 JOIN city AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Name  =  "Kabul"
============================

 69%|██████▉   | 712/1034 [1:25:51<38:59,  7.26s/it]

SELECT region FROM country WHERE code = (SELECT countrycode FROM city WHERE name = "Kabul")
SELECT Region FROM country AS T1 JOIN city AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Name  =  "Kabul"
============================

 69%|██████▉   | 713/1034 [1:25:58<38:51,  7.26s/it]

SELECT T2.language FROM country AS T1 JOIN countrylanguage AS T2 ON T1.code = T2.countrycode WHERE T1.name = "Aruba" ORDER BY T2.percentage DESC LIMIT 1
SELECT T2.Language FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T1.Name  =  "Aruba" ORDER BY Percentage DESC LIMIT 1
============================

 69%|██████▉   | 714/1034 [1:26:06<38:52,  7.29s/it]

SELECT T2.language FROM country AS T1 JOIN countrylanguage AS T2 ON T1.code = T2.countrycode WHERE T1.name = "Aruba" AND T2.isofficial = "T" LIMIT 1
SELECT T2.Language FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T1.Name  =  "Aruba" ORDER BY Percentage DESC LIMIT 1
============================

 69%|██████▉   | 715/1034 [1:26:13<38:36,  7.26s/it]

SELECT population , lifeexpectancy FROM country WHERE name = "Brazil"
SELECT Population ,  LifeExpectancy FROM country WHERE Name  =  "Brazil"
============================

 69%|██████▉   | 716/1034 [1:26:20<38:20,  7.24s/it]

SELECT population , life_expectancy FROM countries WHERE name = "Brazil"
SELECT Population ,  LifeExpectancy FROM country WHERE Name  =  "Brazil"
============================

 69%|██████▉   | 717/1034 [1:26:27<38:10,  7.22s/it]

SELECT region , population FROM country WHERE name = "Angola"
SELECT Population ,  Region FROM country WHERE Name  =  "Angola"
============================

 69%|██████▉   | 718/1034 [1:26:34<37:56,  7.21s/it]

SELECT region , population FROM country WHERE name = "Angola"
SELECT Population ,  Region FROM country WHERE Name  =  "Angola"
============================

 70%|██████▉   | 719/1034 [1:26:41<37:47,  7.20s/it]

SELECT AVG(lifeexpectancy) FROM country WHERE region = "Central Africa"
SELECT avg(LifeExpectancy) FROM country WHERE Region  =  "Central Africa"
============================

 70%|██████▉   | 720/1034 [1:26:49<37:36,  7.19s/it]

SELECT AVG(lifeexpectancy) FROM country WHERE region = "Central Africa"
SELECT avg(LifeExpectancy) FROM country WHERE Region  =  "Central Africa"
============================

 70%|██████▉   | 721/1034 [1:26:56<37:29,  7.19s/it]

SELECT name FROM country WHERE continent = "Asia" ORDER BY lifeexpectancy LIMIT 1
SELECT Name FROM country WHERE Continent  =  "Asia" ORDER BY LifeExpectancy LIMIT 1
============================

 70%|██████▉   | 722/1034 [1:27:03<37:20,  7.18s/it]

SELECT name FROM country WHERE continent = "Asia" ORDER BY lifeexpectancy LIMIT 1
SELECT Name FROM country WHERE Continent  =  "Asia" ORDER BY LifeExpectancy LIMIT 1
============================

 70%|██████▉   | 723/1034 [1:27:10<37:11,  7.18s/it]

SELECT SUM(population) , MAX(gnp) FROM country WHERE continent = "Asia"
SELECT sum(Population) ,  max(GNP) FROM country WHERE Continent  =  "Asia"
============================

 70%|███████   | 724/1034 [1:27:17<37:03,  7.17s/it]

SELECT SUM(population) , MAX(gnp) FROM country WHERE continent = "Asia"
SELECT sum(Population) ,  max(GNP) FROM country WHERE Continent  =  "Asia"
============================

 70%|███████   | 725/1034 [1:27:24<36:53,  7.16s/it]

SELECT AVG(lifeexpectancy) FROM country WHERE continent = "Africa" AND governmentform = "Republic"
SELECT avg(LifeExpectancy) FROM country WHERE Continent  =  "Africa" AND GovernmentForm  =  "Republic"
============================

 70%|███████   | 726/1034 [1:27:32<36:47,  7.17s/it]

SELECT AVG(lifeexpectancy) FROM country WHERE continent = "Africa" AND governmentform = "Republic"
SELECT avg(LifeExpectancy) FROM country WHERE Continent  =  "Africa" AND GovernmentForm  =  "Republic"
============================

 70%|███████   | 727/1034 [1:27:39<36:39,  7.16s/it]

SELECT SUM(surfacearea) FROM country WHERE continent = "Asia" INTERSECT SELECT SUM(surfacearea) FROM country WHERE continent = "Europe"
SELECT sum(SurfaceArea) FROM country WHERE Continent  =  "Asia" OR Continent  =  "Europe"
============================

 70%|███████   | 728/1034 [1:27:46<36:30,  7.16s/it]

SELECT SUM(surfacearea) FROM country WHERE continent = "Asia" OR continent = "Europe"
SELECT sum(SurfaceArea) FROM country WHERE Continent  =  "Asia" OR Continent  =  "Europe"
============================

 71%|███████   | 729/1034 [1:27:53<36:25,  7.17s/it]

SELECT population FROM city WHERE district = "Gelderland"
SELECT sum(Population) FROM city WHERE District  =  "Gelderland"
============================

 71%|███████   | 730/1034 [1:28:00<36:25,  7.19s/it]

SELECT SUM(population) FROM city WHERE district = "Gelderland"
SELECT sum(Population) FROM city WHERE District  =  "Gelderland"
============================

 71%|███████   | 731/1034 [1:28:08<36:26,  7.22s/it]

SELECT AVG(gnp) , SUM(population) FROM country WHERE governmentform = "US Territory"
SELECT avg(GNP) ,  sum(population) FROM country WHERE GovernmentForm  =  "US Territory"
============================

 71%|███████   | 732/1034 [1:28:15<36:20,  7.22s/it]

SELECT AVG(gnp) , SUM(population) FROM countries WHERE territory LIKE '%US%'
SELECT avg(GNP) ,  sum(population) FROM country WHERE GovernmentForm  =  "US Territory"
============================

 71%|███████   | 733/1034 [1:28:22<36:10,  7.21s/it]

SELECT COUNT(DISTINCT language) FROM countrylanguage
SELECT count(DISTINCT LANGUAGE) FROM countrylanguage
============================

 71%|███████   | 734/1034 [1:28:29<36:03,  7.21s/it]

SELECT COUNT(DISTINCT language) FROM countrylanguage
SELECT count(DISTINCT LANGUAGE) FROM countrylanguage
============================

 71%|███████   | 735/1034 [1:28:36<35:56,  7.21s/it]

SELECT COUNT(DISTINCT governmentform) FROM country WHERE continent = "Africa"
SELECT count(DISTINCT GovernmentForm) FROM country WHERE Continent  =  "Africa"
============================

 71%|███████   | 736/1034 [1:28:44<35:50,  7.22s/it]

SELECT COUNT(DISTINCT governmentform) FROM country WHERE continent = "Africa"
SELECT count(DISTINCT GovernmentForm) FROM country WHERE Continent  =  "Africa"
============================

 71%|███████▏  | 737/1034 [1:28:51<35:49,  7.24s/it]

SELECT COUNT(language) FROM countrylanguage WHERE countrycode = "ABW"
SELECT COUNT(T2.Language) FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T1.Name  =  "Aruba"
============================

 71%|███████▏  | 738/1034 [1:28:58<35:47,  7.25s/it]

SELECT COUNT(language) FROM countrylanguage WHERE countrycode = "ABW"
SELECT COUNT(T2.Language) FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T1.Name  =  "Aruba"
============================

 71%|███████▏  | 739/1034 [1:29:06<35:53,  7.30s/it]

SELECT COUNT(*) FROM countrylanguage WHERE countrycode = "AFG" AND isofficial = "T"
SELECT COUNT(*) FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T1.Name  =  "Afghanistan" AND IsOfficial  =  "T"
============================

 72%|███████▏  | 740/1034 [1:29:13<35:45,  7.30s/it]

SELECT COUNT(*) FROM countrylanguage WHERE countrycode = "AFG" AND isofficial = "T"
SELECT COUNT(*) FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T1.Name  =  "Afghanistan" AND IsOfficial  =  "T"
============================

 72%|███████▏  | 741/1034 [1:29:20<35:39,  7.30s/it]

SELECT t1.name FROM country as t1 JOIN countrylanguage as t2 ON t1.code = t2.countrycode GROUP BY t1.name ORDER BY COUNT(*) DESC LIMIT 1
SELECT T1.Name FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode GROUP BY T1.Name ORDER BY COUNT(*) DESC LIMIT 1
============================

 72%|███████▏  | 742/1034 [1:29:28<35:42,  7.34s/it]

SELECT t1.name FROM country as t1 JOIN countrylanguage as t2 ON t1.code = t2.countrycode GROUP BY t1.name ORDER BY COUNT(*) DESC LIMIT 1
SELECT T1.Name FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode GROUP BY T1.Name ORDER BY COUNT(*) DESC LIMIT 1
============================

 72%|███████▏  | 743/1034 [1:29:35<35:36,  7.34s/it]

SELECT continent FROM country GROUP BY continent ORDER BY COUNT(DISTINCT language) DESC LIMIT 1
SELECT T1.Continent FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode GROUP BY T1.Continent ORDER BY COUNT(*) DESC LIMIT 1
============================

 72%|███████▏  | 744/1034 [1:29:42<35:29,  7.34s/it]

SELECT continent FROM country GROUP BY continent ORDER BY COUNT(DISTINCT language) DESC LIMIT 1
SELECT T1.Continent FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode GROUP BY T1.Continent ORDER BY COUNT(*) DESC LIMIT 1
============================

 72%|███████▏  | 745/1034 [1:29:50<35:19,  7.34s/it]

SELECT COUNT(*) FROM countrylanguage WHERE language = "English" INTERSECT SELECT COUNT(*) FROM countrylanguage WHERE language = "Dutch"
SELECT COUNT(*) FROM (SELECT T1.Name FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Language  =  "English" INTERSECT SELECT T1.Name FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Language  =  "Dutch")
============================

 72%|███████▏  | 746/1034 [1:29:57<35:03,  7.30s/it]

SELECT COUNT(DISTINCT t1.country) FROM country_languages as t1 JOIN country_languages as t2 ON t1.country = t2.country WHERE t1.language = "English" AND t2.language = "Dutch"
SELECT COUNT(*) FROM (SELECT T1.Name FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Language  =  "English" INTERSECT SELECT T1.Name FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Language  =  "Dutch")
============================

 72%|███████▏  | 747/1034 [1:30:04<34:54,  7.30s/it]

SELECT t1.name FROM country as t1 JOIN countrylanguage as t2 ON t1.code = t2.countrycode WHERE t2.language = "English" INTERSECT SELECT t1.name FROM country as t1 JOIN countrylanguage as t2 ON t1.code = t2.countrycode WHERE t2.language = "French"
SELECT T1.Name FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Language  =  "English" INTERSECT SELECT T1.Name FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Language  =  "French"
============================

 72%|███████▏  | 748/1034 [1:30:11<34:36,  7.26s/it]

SELECT t1.name FROM country as t1 JOIN countrylanguage as t2 ON t1.code = t2.countrycode WHERE t2.language = "English" INTERSECT SELECT t1.name FROM country as t1 JOIN countrylanguage as t2 ON t1.code = t2.countrycode WHERE t2.language = "French"
SELECT T1.Name FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Language  =  "English" INTERSECT SELECT T1.Name FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Language  =  "French"
============================

 72%|███████▏  | 749/1034 [1:30:19<34:23,  7.24s/it]

SELECT t1.name FROM country as t1 JOIN countrylanguage as t2 ON t1.code = t2.countrycode WHERE t2.language = "English" INTERSECT SELECT t1.name FROM country as t1 JOIN countrylanguage as t2 ON t1.code = t2.countrycode WHERE t2.language = "French"
SELECT T1.Name FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Language  =  "English" AND T2.IsOfficial  =  "T" INTERSECT SELECT T1.Name FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Language  =  "French" AND T2.IsOfficial  =  "T"
============================

 73%|███████▎  | 750/1034 [1:30:26<34:08,  7.21s/it]

SELECT countrycode FROM countrylanguage WHERE language = "English" INTERSECT SELECT countrycode FROM countrylanguage WHERE language = "French" AND isofficial = "T"
SELECT T1.Name FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Language  =  "English" AND T2.IsOfficial  =  "T" INTERSECT SELECT T1.Name FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Language  =  "French" AND T2.IsOfficial  =  "T"
============================

 73%|███████▎  | 751/1034 [1:30:33<34:00,  7.21s/it]

SELECT COUNT(DISTINCT t1.continent) FROM country as t1 JOIN countrylanguage as t2 ON t1.code = t2.countrycode WHERE t2.language = "Chinese"
SELECT COUNT( DISTINCT Continent) FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Language  =  "Chinese"
============================

 73%|███████▎  | 752/1034 [1:30:40<33:49,  7.20s/it]

SELECT COUNT(DISTINCT t1.continent) FROM country as t1 JOIN countrylanguage as t2 ON t1.code = t2.countrycode WHERE t2.language = "Chinese"
SELECT COUNT( DISTINCT Continent) FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Language  =  "Chinese"
============================

 73%|███████▎  | 753/1034 [1:30:47<33:44,  7.20s/it]

SELECT region FROM country WHERE code IN ( SELECT countrycode FROM countrylanguage WHERE language = "English" INTERSECT SELECT countrycode FROM countrylanguage WHERE language = "Dutch" )
SELECT DISTINCT T1.Region FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Language  =  "English" OR T2.Language  =  "Dutch"
============================

 73%|███████▎  | 754/1034 [1:30:55<33:33,  7.19s/it]

SELECT DISTINCT region FROM country JOIN countrylanguage ON country.code = countrylanguage.countrycode WHERE countrylanguage.language = "Dutch" OR countrylanguage.language = "English"
SELECT DISTINCT T1.Region FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Language  =  "English" OR T2.Language  =  "Dutch"
============================

 73%|███████▎  | 755/1034 [1:31:02<33:25,  7.19s/it]

SELECT countrycode FROM countrylanguage WHERE language = "English" INTERSECT SELECT countrycode FROM countrylanguage WHERE language = "Dutch" AND isofficial = "T"
select t1.name from country as t1 join countrylanguage as t2 on t1.code  =  t2.countrycode where t2.language  =  "english" and isofficial  =  "t" union select t1.name from country as t1 join countrylanguage as t2 on t1.code  =  t2.countrycode where t2.language  =  "dutch" and isofficial  =  "t"
============================

 73%|███████▎  | 756/1034 [1:31:09<33:13,  7.17s/it]

SELECT countrycode FROM countrylanguage WHERE language = "English" INTERSECT SELECT countrycode FROM countrylanguage WHERE language = "Dutch" AND isofficial = "T"
SELECT * FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Language  =  "English" AND IsOfficial  =  "T" UNION SELECT * FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Language  =  "Dutch" AND IsOfficial  =  "T"
============================

 73%|███████▎  | 757/1034 [1:31:16<33:04,  7.16s/it]

SELECT T2.language FROM country AS T1 JOIN countrylanguage AS T2 ON T1.code = T2.countrycode WHERE T1.continent = "Asia" GROUP BY T2.language ORDER BY COUNT(*) DESC LIMIT 1
SELECT T2.Language FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T1.Continent  =  "Asia" GROUP BY T2.Language ORDER BY COUNT (*) DESC LIMIT 1
============================

 73%|███████▎  | 758/1034 [1:31:23<32:56,  7.16s/it]

SELECT T2.language FROM country AS T1 JOIN countrylanguage AS T2 ON T1.code = T2.countrycode WHERE T1.continent = "Asia" GROUP BY T2.language ORDER BY COUNT(*) DESC LIMIT 1
SELECT T2.Language FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T1.Continent  =  "Asia" GROUP BY T2.Language ORDER BY COUNT (*) DESC LIMIT 1
============================

 73%|███████▎  | 759/1034 [1:31:30<32:50,  7.17s/it]

SELECT language FROM countrylanguage GROUP BY language HAVING COUNT(*) = 1 AND isofficial = 'T'
SELECT T2.Language FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T1.GovernmentForm  =  "Republic" GROUP BY T2.Language HAVING COUNT(*)  =  1
============================

 74%|███████▎  | 760/1034 [1:31:37<32:44,  7.17s/it]

SELECT language FROM countrylanguage GROUP BY language HAVING COUNT(*) = 1 AND governmentform = "Republic"
SELECT T2.Language FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T1.GovernmentForm  =  "Republic" GROUP BY T2.Language HAVING COUNT(*)  =  1
============================

 74%|███████▎  | 761/1034 [1:31:45<32:35,  7.16s/it]

SELECT t1.name FROM city as t1 JOIN countrylanguage as t2 ON t1.countrycode = t2.countrycode WHERE t2.language = "English" ORDER BY t1.population DESC LIMIT 1
SELECT T1.Name ,  T1.Population FROM city AS T1 JOIN countrylanguage AS T2 ON T1.CountryCode  =  T2.CountryCode WHERE T2.Language  =  "English" ORDER BY T1.Population DESC LIMIT 1
============================

 74%|███████▎  | 762/1034 [1:31:52<32:25,  7.15s/it]

SELECT t1.name FROM city as t1 JOIN countrylanguage as t2 ON t1.countrycode = t2.countrycode WHERE t2.language = "English" ORDER BY t1.population DESC LIMIT 1
SELECT T1.Name ,  T1.Population FROM city AS T1 JOIN countrylanguage AS T2 ON T1.CountryCode  =  T2.CountryCode WHERE T2.Language  =  "English" ORDER BY T1.Population DESC LIMIT 1
============================

 74%|███████▍  | 763/1034 [1:31:59<32:17,  7.15s/it]

SELECT name , population , lifeexpectancy FROM country WHERE continent = "Asia" ORDER BY surfacearea DESC LIMIT 1
SELECT Name ,  Population ,  LifeExpectancy FROM country WHERE Continent  =  "Asia" ORDER BY SurfaceArea DESC LIMIT 1
============================

 74%|███████▍  | 764/1034 [1:32:06<32:11,  7.15s/it]

SELECT name , population , lifeexpectancy FROM country WHERE continent = "Asia" ORDER BY surfacearea DESC LIMIT 1
SELECT Name ,  Population ,  LifeExpectancy FROM country WHERE Continent  =  "Asia" ORDER BY SurfaceArea DESC LIMIT 1
============================

 74%|███████▍  | 765/1034 [1:32:13<32:04,  7.16s/it]

SELECT AVG(lifeexpectancy) FROM country WHERE code NOT IN (SELECT countrycode FROM countrylanguage WHERE language = "English")
SELECT avg(LifeExpectancy) FROM country WHERE Name NOT IN (SELECT T1.Name FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Language  =  "English" AND T2.IsOfficial  =  "T")
============================

 74%|███████▍  | 766/1034 [1:32:20<31:59,  7.16s/it]

SELECT AVG(lifeexpectancy) FROM country EXCEPT SELECT t1.lifeexpectancy FROM country as t1 JOIN countrylanguage as t2 ON t1.code = t2.countrycode WHERE t2.language = "English" AND t2.isofficial = "T"
SELECT avg(LifeExpectancy) FROM country WHERE Name NOT IN (SELECT T1.Name FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Language  =  "English" AND T2.IsOfficial  =  "T")
============================

 74%|███████▍  | 767/1034 [1:32:28<31:52,  7.16s/it]

SELECT SUM(population) FROM country EXCEPT SELECT t1.population FROM country AS t1 JOIN countrylanguage AS t2 ON t1.code = t2.countrycode WHERE t2.language = "English" AND t2.isofficial = "T"
SELECT sum(Population) FROM country WHERE Name NOT IN (SELECT T1.Name FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Language  =  "English")
============================

 74%|███████▍  | 768/1034 [1:32:35<31:51,  7.19s/it]

SELECT SUM(population) FROM country EXCEPT SELECT t1.population FROM country AS t1 JOIN countrylanguage AS t2 ON t1.code = t2.countrycode WHERE t2.language = "English"
SELECT sum(Population) FROM country WHERE Name NOT IN (SELECT T1.Name FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Language  =  "English")
============================

 74%|███████▍  | 769/1034 [1:32:42<31:49,  7.20s/it]

SELECT t2.language FROM country as t1 JOIN countrylanguage as t2 ON t1.code = t2.countrycode WHERE t1.headofstate = "Beatrix" AND t2.isofficial = "T"
SELECT T2.Language FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T1.HeadOfState  =  "Beatrix" AND T2.IsOfficial  =  "T"
============================

 74%|███████▍  | 770/1034 [1:32:49<31:50,  7.24s/it]

SELECT t2.language FROM country as t1 JOIN countrylanguage as t2 ON t1.code = t2.countrycode WHERE t1.headofstate = "Beatrix" AND t2.isofficial = "T"
SELECT T2.Language FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T1.HeadOfState  =  "Beatrix" AND T2.IsOfficial  =  "T"
============================

 75%|███████▍  | 771/1034 [1:32:57<31:48,  7.26s/it]

SELECT COUNT(DISTINCT T2.language) FROM country AS T1 JOIN countrylanguage AS T2 ON T1.code = T2.countrycode WHERE T1.indepyear < 1930 AND T2.isofficial = 'T'
SELECT count(DISTINCT T2.Language) FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE  IndepYear  <  1930 AND T2.IsOfficial  =  "T"
============================

 75%|███████▍  | 772/1034 [1:33:04<31:43,  7.26s/it]

SELECT COUNT(DISTINCT t2.language) FROM country AS t1 JOIN countrylanguage AS t2 ON t1.code = t2.countrycode WHERE t1.indepyear < 1930
SELECT count(DISTINCT T2.Language) FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE  IndepYear  <  1930 AND T2.IsOfficial  =  "T"
============================

 75%|███████▍  | 773/1034 [1:33:11<31:31,  7.25s/it]

SELECT name FROM country WHERE surfacearea > (SELECT MAX(surfacearea) FROM country WHERE continent = "Europe")
SELECT Name FROM country WHERE SurfaceArea  >  (SELECT min(SurfaceArea) FROM country WHERE Continent  =  "Europe")
============================

 75%|███████▍  | 774/1034 [1:33:18<31:23,  7.24s/it]

SELECT name FROM country WHERE surfacearea > (SELECT MAX(surfacearea) FROM country WHERE continent = "Europe")
SELECT Name FROM country WHERE SurfaceArea  >  (SELECT min(SurfaceArea) FROM country WHERE Continent  =  "Europe")
============================

 75%|███████▍  | 775/1034 [1:33:26<31:15,  7.24s/it]

SELECT name FROM country WHERE continent = "Africa" AND population < (SELECT MIN(population) FROM country WHERE continent = "Asia")
SELECT Name FROM country WHERE Continent  =  "Africa"  AND population  <  (SELECT max(population) FROM country WHERE Continent  =  "Asia")
============================

 75%|███████▌  | 776/1034 [1:33:33<31:09,  7.24s/it]

SELECT name FROM country WHERE continent = "Africa" AND population < (SELECT MIN(population) FROM country WHERE continent = "Asia")
SELECT Name FROM country WHERE Continent  =  "Africa"  AND population  <  (SELECT min(population) FROM country WHERE Continent  =  "Asia")
============================

 75%|███████▌  | 777/1034 [1:33:40<31:02,  7.25s/it]

SELECT name FROM country WHERE continent = "Asia" AND population > (SELECT MAX(population) FROM country WHERE continent = "Africa")
SELECT Name FROM country WHERE Continent  =  "Asia"  AND population  >  (SELECT max(population) FROM country WHERE Continent  =  "Africa")
============================

 75%|███████▌  | 778/1034 [1:33:47<30:56,  7.25s/it]

SELECT name FROM country WHERE continent = "Asia" AND population > (SELECT MAX(population) FROM country WHERE continent = "Africa")
SELECT Name FROM country WHERE Continent  =  "Asia"  AND population  >  (SELECT min(population) FROM country WHERE Continent  =  "Africa")
============================

 75%|███████▌  | 779/1034 [1:33:55<30:58,  7.29s/it]

SELECT countrycode FROM countrylanguage EXCEPT SELECT countrycode FROM countrylanguage WHERE language = "English"
SELECT CountryCode FROM countrylanguage EXCEPT SELECT CountryCode FROM countrylanguage WHERE LANGUAGE  =  "English"
============================

 75%|███████▌  | 780/1034 [1:34:02<30:46,  7.27s/it]

SELECT countrycode FROM countrylanguage EXCEPT SELECT countrycode FROM countrylanguage WHERE language = "English"
SELECT CountryCode FROM countrylanguage EXCEPT SELECT CountryCode FROM countrylanguage WHERE LANGUAGE  =  "English"
============================

 76%|███████▌  | 781/1034 [1:34:09<30:43,  7.29s/it]

SELECT countrycode FROM countrylanguage EXCEPT SELECT countrycode FROM countrylanguage WHERE language = "English"
SELECT DISTINCT CountryCode FROM countrylanguage WHERE LANGUAGE != "English"
============================

 76%|███████▌  | 782/1034 [1:34:17<30:31,  7.27s/it]

SELECT countrycode FROM countrylanguage EXCEPT SELECT countrycode FROM countrylanguage WHERE language = "English"
SELECT DISTINCT CountryCode FROM countrylanguage WHERE LANGUAGE != "English"
============================

 76%|███████▌  | 783/1034 [1:34:24<30:25,  7.27s/it]

SELECT code FROM country EXCEPT SELECT countrycode FROM countrylanguage WHERE language = "English" INTERSECT SELECT countrycode FROM country WHERE governmentform != "Republic"
SELECT Code FROM country WHERE GovernmentForm != "Republic" EXCEPT SELECT CountryCode FROM countrylanguage WHERE LANGUAGE  =  "English"
============================

 76%|███████▌  | 784/1034 [1:34:31<30:16,  7.27s/it]

SELECT code FROM country EXCEPT SELECT countrycode FROM countrylanguage WHERE language = "English" INTERSECT SELECT code FROM country WHERE governmentform = "Republic"
SELECT Code FROM country WHERE GovernmentForm != "Republic" EXCEPT SELECT CountryCode FROM countrylanguage WHERE LANGUAGE  =  "English"
============================

 76%|███████▌  | 785/1034 [1:34:38<30:07,  7.26s/it]

SELECT t1.name FROM city as t1 JOIN country as t2 ON t1.countrycode = t2.code JOIN countrylanguage as t3 ON t2.code = t3.countrycode WHERE t2.continent = "Europe" AND t3.language != "English" AND t3.isofficial = "T"
SELECT DISTINCT T2.Name FROM country AS T1 JOIN city AS T2 ON T2.CountryCode  =  T1.Code WHERE T1.Continent  =  'Europe' AND T1.Name NOT IN (SELECT T3.Name FROM country AS T3 JOIN countrylanguage AS T4 ON T3.Code  =  T4.CountryCode WHERE T4.IsOfficial  =  'T' AND T4.Language  =  'English')
============================

 76%|███████▌  | 786/1034 [1:34:46<30:04,  7.28s/it]

SELECT city FROM cities WHERE continent = "Europe" EXCEPT SELECT city FROM countrylanguages WHERE language = "English" AND isofficial = "T"
SELECT DISTINCT T2.Name FROM country AS T1 JOIN city AS T2 ON T2.CountryCode  =  T1.Code WHERE T1.Continent  =  'Europe' AND T1.Name NOT IN (SELECT T3.Name FROM country AS T3 JOIN countrylanguage AS T4 ON T3.Code  =  T4.CountryCode WHERE T4.IsOfficial  =  'T' AND T4.Language  =  'English')
============================

 76%|███████▌  | 787/1034 [1:34:53<29:56,  7.27s/it]

SELECT DISTINCT t1.name FROM city as t1 JOIN country as t2 ON t1.countrycode = t2.code JOIN countrylanguage as t3 ON t2.code = t3.countrycode WHERE t2.continent = "Asia" AND t3.language = "Chinese" AND t3.isofficial = "T"
select distinct t3.name from country as t1 join countrylanguage as t2 on t1.code  =  t2.countrycode join city as t3 on t1.code  =  t3.countrycode where t2.isofficial  =  't' and t2.language  =  'chinese' and t1.continent  =  "asia"
============================

 76%|███████▌  | 788/1034 [1:35:00<29:48,  7.27s/it]

SELECT DISTINCT t2.name FROM countrylanguage as t1 JOIN city as t2 ON t1.countrycode = t2.countrycode JOIN country as t3 ON t3.code = t2.countrycode WHERE t3.continent = "Asia" AND t1.language = "Chinese" AND t1.isofficial = "T"
SELECT DISTINCT T3.Name FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode JOIN city AS T3 ON T1.Code  =  T3.CountryCode WHERE T2.IsOfficial  =  'T' AND T2.Language  =  'Chinese' AND T1.Continent  =  "Asia"
============================

 76%|███████▋  | 789/1034 [1:35:07<29:38,  7.26s/it]

SELECT name , indepyear , surfacearea FROM country ORDER BY population ASC LIMIT 1
SELECT Name ,  SurfaceArea ,  IndepYear FROM country ORDER BY Population LIMIT 1
============================

 76%|███████▋  | 790/1034 [1:35:15<29:32,  7.26s/it]

SELECT name , indepyear , surfacearea FROM country ORDER BY population ASC LIMIT 1
SELECT Name ,  SurfaceArea ,  IndepYear FROM country ORDER BY Population LIMIT 1
============================

 76%|███████▋  | 791/1034 [1:35:22<29:27,  7.27s/it]

SELECT population , name , headofstate FROM country ORDER BY surfacearea DESC LIMIT 1
SELECT Name ,  population ,  HeadOfState FROM country ORDER BY SurfaceArea DESC LIMIT 1
============================

 77%|███████▋  | 792/1034 [1:35:29<29:19,  7.27s/it]

SELECT name , population , headofstate FROM country ORDER BY surfacearea DESC LIMIT 1
SELECT Name ,  population ,  HeadOfState FROM country ORDER BY SurfaceArea DESC LIMIT 1
============================

 77%|███████▋  | 793/1034 [1:35:37<29:10,  7.26s/it]

SELECT t1.name , COUNT(*) FROM country as t1 JOIN countrylanguage as t2 ON t1.code = t2.countrycode WHERE t2.percentage >= 3 GROUP BY t1.name HAVING COUNT(*) >= 3
SELECT COUNT(T2.Language) ,  T1.Name FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode GROUP BY T1.Name HAVING COUNT(*)  >  2
============================

 77%|███████▋  | 794/1034 [1:35:44<28:55,  7.23s/it]

SELECT COUNT(*) , t1.name FROM country as t1 JOIN countrylanguage as t2 ON t1.code = t2.countrycode GROUP BY t1.name HAVING COUNT(*) > 2
SELECT COUNT(T2.Language) ,  T1.Name FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode GROUP BY T1.Name HAVING COUNT(*)  >  2
============================

 77%|███████▋  | 795/1034 [1:35:51<28:39,  7.20s/it]

SELECT district , COUNT(*) FROM city WHERE population > (SELECT AVG(population) FROM city) GROUP BY district
SELECT count(*) ,  District FROM city WHERE Population  >  (SELECT avg(Population) FROM city) GROUP BY District
============================

 77%|███████▋  | 796/1034 [1:35:58<28:28,  7.18s/it]

SELECT district , COUNT(*) FROM city WHERE population > (SELECT AVG(population) FROM city) GROUP BY district
SELECT count(*) ,  District FROM city WHERE Population  >  (SELECT avg(Population) FROM city) GROUP BY District
============================

 77%|███████▋  | 797/1034 [1:36:05<28:18,  7.17s/it]

SELECT governmentform , SUM(population) FROM country GROUP BY governmentform HAVING AVG(lifeexpectancy) > 72
SELECT sum(Population) ,  GovernmentForm FROM country GROUP BY GovernmentForm HAVING avg(LifeExpectancy)  >  72
============================

 77%|███████▋  | 798/1034 [1:36:12<28:20,  7.21s/it]

SELECT governmentform , SUM(population) FROM country GROUP BY governmentform HAVING AVG(lifeexpectancy) > 72
SELECT sum(Population) ,  GovernmentForm FROM country GROUP BY GovernmentForm HAVING avg(LifeExpectancy)  >  72
============================

 77%|███████▋  | 799/1034 [1:36:20<28:13,  7.21s/it]

SELECT continent , AVG(lifeexpectancy) , SUM(population) FROM country GROUP BY continent HAVING AVG(lifeexpectancy) < 72
SELECT sum(Population) ,  avg(LifeExpectancy) ,  Continent FROM country GROUP BY Continent HAVING avg(LifeExpectancy)  <  72
============================

 77%|███████▋  | 800/1034 [1:36:27<28:05,  7.20s/it]

SELECT continent , SUM(population) , AVG(lifeexpectancy) FROM country GROUP BY continent HAVING AVG(lifeexpectancy) < 72
SELECT sum(Population) ,  avg(LifeExpectancy) ,  Continent FROM country GROUP BY Continent HAVING avg(LifeExpectancy)  <  72
============================

 77%|███████▋  | 801/1034 [1:36:34<28:03,  7.22s/it]

SELECT name , surfacearea FROM country ORDER BY surfacearea DESC LIMIT 5
SELECT Name ,  SurfaceArea FROM country ORDER BY SurfaceArea DESC LIMIT 5
============================

 78%|███████▊  | 802/1034 [1:36:41<28:05,  7.26s/it]

SELECT name , surfacearea FROM country ORDER BY surfacearea DESC LIMIT 5
SELECT Name ,  SurfaceArea FROM country ORDER BY SurfaceArea DESC LIMIT 5
============================

 78%|███████▊  | 803/1034 [1:36:49<28:02,  7.28s/it]

SELECT name FROM country ORDER BY population DESC LIMIT 3
SELECT Name FROM country ORDER BY Population DESC LIMIT 3
============================

 78%|███████▊  | 804/1034 [1:36:56<27:54,  7.28s/it]

SELECT name FROM country ORDER BY population DESC LIMIT 3
SELECT Name FROM country ORDER BY Population DESC LIMIT 3
============================

 78%|███████▊  | 805/1034 [1:37:03<27:44,  7.27s/it]

SELECT name FROM country ORDER BY population ASC LIMIT 3
SELECT Name FROM country ORDER BY Population ASC LIMIT 3
============================

 78%|███████▊  | 806/1034 [1:37:10<27:36,  7.26s/it]

SELECT name FROM country ORDER BY population ASC LIMIT 3
SELECT Name FROM country ORDER BY Population ASC LIMIT 3
============================

 78%|███████▊  | 807/1034 [1:37:18<27:30,  7.27s/it]

SELECT COUNT(*) FROM country WHERE continent = "Asia"
SELECT count(*) FROM country WHERE continent  =  "Asia"
============================

 78%|███████▊  | 808/1034 [1:37:25<27:22,  7.27s/it]

SELECT COUNT(*) FROM country WHERE continent = "Asia"
SELECT count(*) FROM country WHERE continent  =  "Asia"
============================

 78%|███████▊  | 809/1034 [1:37:32<27:13,  7.26s/it]

SELECT name FROM country WHERE continent = "Europe" AND population = 80000
SELECT Name FROM country WHERE continent  =  "Europe" AND Population  =  "80000"
============================

 78%|███████▊  | 810/1034 [1:37:40<27:04,  7.25s/it]

SELECT name FROM country WHERE continent = "Europe" AND population = 80000
SELECT Name FROM country WHERE continent  =  "Europe" AND Population  =  "80000"
============================

 78%|███████▊  | 811/1034 [1:37:47<26:56,  7.25s/it]

SELECT SUM(population) , AVG(surfacearea) FROM country WHERE continent = "North America" AND surfacearea > 3000
select sum(population) ,  avg(surfacearea) from country where continent  =  "north america" and surfacearea  >  3000
============================

 79%|███████▊  | 812/1034 [1:37:54<26:46,  7.24s/it]

SELECT SUM(population) , AVG(surfacearea) FROM country WHERE continent = "North America" AND surfacearea > 3000
select sum(population) ,  avg(surfacearea) from country where continent  =  "north america" and surfacearea  >  3000
============================

 79%|███████▊  | 813/1034 [1:38:01<26:42,  7.25s/it]

SELECT name FROM city WHERE population BETWEEN 160000 AND 900000
SELECT name FROM city WHERE Population BETWEEN 160000 AND 900000
============================

 79%|███████▊  | 814/1034 [1:38:08<26:33,  7.24s/it]

SELECT name FROM city WHERE population BETWEEN 160000 AND 900000
select name from city where population between 160000 and 900000
============================

 79%|███████▉  | 815/1034 [1:38:16<26:24,  7.24s/it]

SELECT language FROM countrylanguage GROUP BY language ORDER BY COUNT(*) DESC LIMIT 1
SELECT LANGUAGE FROM countrylanguage GROUP BY LANGUAGE ORDER BY count(*) DESC LIMIT 1
============================

 79%|███████▉  | 816/1034 [1:38:23<26:16,  7.23s/it]

SELECT language FROM country GROUP BY language ORDER BY COUNT(*) DESC LIMIT 1
SELECT LANGUAGE FROM countrylanguage GROUP BY LANGUAGE ORDER BY count(*) DESC LIMIT 1
============================

 79%|███████▉  | 817/1034 [1:38:30<26:15,  7.26s/it]

SELECT t2.language , t1.name FROM country as t1 JOIN countrylanguage as t2 ON t1.code = t2.countrycode WHERE t2.percentage = (SELECT MAX(percentage) FROM countrylanguage WHERE countrycode = t1.code)
SELECT LANGUAGE ,  CountryCode ,  max(Percentage) FROM countrylanguage GROUP BY CountryCode
============================

 79%|███████▉  | 818/1034 [1:38:37<26:01,  7.23s/it]

SELECT countrycode , MAX(percentage) , language FROM countrylanguage GROUP BY countrycode
SELECT LANGUAGE ,  CountryCode ,  max(Percentage) FROM countrylanguage GROUP BY CountryCode
============================

 79%|███████▉  | 819/1034 [1:38:45<25:49,  7.21s/it]

SELECT COUNT(*) FROM countrylanguage WHERE language = "Spanish" AND percentage = (SELECT MAX(percentage) FROM countrylanguage WHERE language = "Spanish")
SELECT count(*) ,   max(Percentage) FROM countrylanguage WHERE LANGUAGE  =  "Spanish" GROUP BY CountryCode
============================

 79%|███████▉  | 820/1034 [1:38:52<25:39,  7.19s/it]

SELECT COUNT(*) FROM countrylanguage WHERE language = "Spanish" AND percentage = ( SELECT MAX(percentage) FROM countrylanguage WHERE language = "Spanish" )
SELECT count(*) ,   max(Percentage) FROM countrylanguage WHERE LANGUAGE  =  "Spanish" GROUP BY CountryCode
============================

 79%|███████▉  | 821/1034 [1:38:59<25:28,  7.18s/it]

SELECT countrycode FROM countrylanguage WHERE language = "Spanish" ORDER BY percentage DESC LIMIT 1
SELECT CountryCode ,  max(Percentage) FROM countrylanguage WHERE LANGUAGE  =  "Spanish" GROUP BY CountryCode
============================

 79%|███████▉  | 822/1034 [1:39:06<25:18,  7.16s/it]

SELECT countrycode FROM countrylanguage WHERE language = "Spanish" AND percentage > 50
SELECT CountryCode ,  max(Percentage) FROM countrylanguage WHERE LANGUAGE  =  "Spanish" GROUP BY CountryCode
============================

 80%|███████▉  | 823/1034 [1:39:13<25:14,  7.18s/it]

SELECT COUNT(*) FROM conductor
SELECT count(*) FROM conductor
============================

 80%|███████▉  | 824/1034 [1:39:20<25:07,  7.18s/it]

SELECT COUNT(*) FROM conductor
SELECT count(*) FROM conductor
============================

 80%|███████▉  | 825/1034 [1:39:28<25:04,  7.20s/it]

SELECT name FROM conductors ORDER BY age ASC
SELECT Name FROM conductor ORDER BY Age ASC
============================

 80%|███████▉  | 826/1034 [1:39:35<25:03,  7.23s/it]

SELECT name FROM conductor ORDER BY age
SELECT Name FROM conductor ORDER BY Age ASC
============================

 80%|███████▉  | 827/1034 [1:39:42<25:09,  7.29s/it]

SELECT name FROM conductor WHERE nationality != "USA"
SELECT Name FROM conductor WHERE Nationality != 'USA'
============================

 80%|████████  | 828/1034 [1:39:50<25:10,  7.33s/it]

SELECT name FROM conductor WHERE nationality != "USA"
SELECT Name FROM conductor WHERE Nationality != 'USA'
============================

 80%|████████  | 829/1034 [1:39:57<24:57,  7.31s/it]

SELECT record_company FROM orchestra ORDER BY year_of_founded DESC
SELECT Record_Company FROM orchestra ORDER BY Year_of_Founded DESC
============================

 80%|████████  | 830/1034 [1:40:04<24:45,  7.28s/it]

SELECT record_company FROM orchestra ORDER BY year_of_founded DESC
SELECT Record_Company FROM orchestra ORDER BY Year_of_Founded DESC
============================

 80%|████████  | 831/1034 [1:40:11<24:34,  7.27s/it]

SELECT AVG(attendance) FROM shows
SELECT avg(Attendance) FROM SHOW
============================

 80%|████████  | 832/1034 [1:40:19<24:23,  7.25s/it]

SELECT AVG(attendance) FROM show
SELECT avg(Attendance) FROM SHOW
============================

 81%|████████  | 833/1034 [1:40:26<24:15,  7.24s/it]

SELECT MAX(share) , MIN(share) FROM performance WHERE type != "Live final"
SELECT max(SHARE) ,  min(SHARE) FROM performance WHERE TYPE != "Live final"
============================

 81%|████████  | 834/1034 [1:40:33<24:06,  7.23s/it]

SELECT MAX(share) , MIN(share) FROM performance WHERE type != "Live final"
SELECT max(SHARE) ,  min(SHARE) FROM performance WHERE TYPE != "Live final"
============================

 81%|████████  | 835/1034 [1:40:40<23:59,  7.23s/it]

SELECT COUNT(DISTINCT nationality) FROM conductor
SELECT count(DISTINCT Nationality) FROM conductor
============================

 81%|████████  | 836/1034 [1:40:48<23:55,  7.25s/it]

SELECT COUNT(DISTINCT nationality) FROM conductor
SELECT count(DISTINCT Nationality) FROM conductor
============================

 81%|████████  | 837/1034 [1:40:55<23:44,  7.23s/it]

SELECT name FROM conductor ORDER BY year_of_work DESC
SELECT Name FROM conductor ORDER BY Year_of_Work DESC
============================

 81%|████████  | 838/1034 [1:41:02<23:31,  7.20s/it]

SELECT name FROM conductors ORDER BY years_worked DESC
SELECT Name FROM conductor ORDER BY Year_of_Work DESC
============================

 81%|████████  | 839/1034 [1:41:09<23:20,  7.18s/it]

SELECT name FROM conductor ORDER BY year_of_work DESC LIMIT 1
SELECT Name FROM conductor ORDER BY Year_of_Work DESC LIMIT 1
============================

 81%|████████  | 840/1034 [1:41:16<23:17,  7.20s/it]

SELECT name FROM conductor ORDER BY year_of_work DESC LIMIT 1
SELECT Name FROM conductor ORDER BY Year_of_Work DESC LIMIT 1
============================

 81%|████████▏ | 841/1034 [1:41:24<23:08,  7.19s/it]

SELECT t1.name , t2.orchestra FROM conductor as t1 JOIN orchestra as t2 ON t1.conductor_id = t2.conductor_id
SELECT T1.Name ,  T2.Orchestra FROM conductor AS T1 JOIN orchestra AS T2 ON T1.Conductor_ID  =  T2.Conductor_ID
============================

 81%|████████▏ | 842/1034 [1:41:31<22:59,  7.19s/it]

SELECT DISTINCT t1.name , t2.orchestra FROM conductors as t1 JOIN orchestra_conductors as t2 ON t1.id = t2.conductor_id
SELECT T1.Name ,  T2.Orchestra FROM conductor AS T1 JOIN orchestra AS T2 ON T1.Conductor_ID  =  T2.Conductor_ID
============================

 82%|████████▏ | 843/1034 [1:41:38<22:50,  7.18s/it]

SELECT t1.name FROM conductor as t1 JOIN orchestra as t2 ON t1.conductor_id = t2.conductor_id GROUP BY t1.conductor_id HAVING COUNT(*) > 1
SELECT T1.Name FROM conductor AS T1 JOIN orchestra AS T2 ON T1.Conductor_ID  =  T2.Conductor_ID GROUP BY T2.Conductor_ID HAVING COUNT(*)  >  1
============================

 82%|████████▏ | 844/1034 [1:41:45<22:40,  7.16s/it]

SELECT t1.name FROM conductor as t1 JOIN orchestra as t2 ON t1.conductor_id = t2.conductor_id GROUP BY t1.conductor_id HAVING COUNT(*) > 1
SELECT T1.Name FROM conductor AS T1 JOIN orchestra AS T2 ON T1.Conductor_ID  =  T2.Conductor_ID GROUP BY T2.Conductor_ID HAVING COUNT(*)  >  1
============================

 82%|████████▏ | 845/1034 [1:41:52<22:32,  7.15s/it]

SELECT t1.name FROM conductor as t1 JOIN orchestra as t2 ON t1.conductor_id = t2.conductor_id GROUP BY t1.conductor_id ORDER BY COUNT(*) DESC LIMIT 1
SELECT T1.Name FROM conductor AS T1 JOIN orchestra AS T2 ON T1.Conductor_ID  =  T2.Conductor_ID GROUP BY T2.Conductor_ID ORDER BY COUNT(*) DESC LIMIT 1
============================

 82%|████████▏ | 846/1034 [1:41:59<22:29,  7.18s/it]

SELECT t1.name FROM conductor as t1 JOIN orchestra as t2 ON t1.conductor_id = t2.conductor_id GROUP BY t1.conductor_id ORDER BY COUNT(*) DESC LIMIT 1
SELECT T1.Name FROM conductor AS T1 JOIN orchestra AS T2 ON T1.Conductor_ID  =  T2.Conductor_ID GROUP BY T2.Conductor_ID ORDER BY COUNT(*) DESC LIMIT 1
============================

 82%|████████▏ | 847/1034 [1:42:07<22:28,  7.21s/it]

SELECT t1.name FROM conductor as t1 JOIN orchestra as t2 ON t1.conductor_id = t2.conductor_id WHERE t2.year_of_founded > 2008
SELECT T1.Name FROM conductor AS T1 JOIN orchestra AS T2 ON T1.Conductor_ID  =  T2.Conductor_ID WHERE Year_of_Founded  >  2008
============================

 82%|████████▏ | 848/1034 [1:42:14<22:26,  7.24s/it]

SELECT t1.name FROM conductor as t1 JOIN orchestra as t2 ON t1.conductor_id = t2.conductor_id WHERE t2.year_of_founded > 2008
SELECT T1.Name FROM conductor AS T1 JOIN orchestra AS T2 ON T1.Conductor_ID  =  T2.Conductor_ID WHERE Year_of_Founded  >  2008
============================

 82%|████████▏ | 849/1034 [1:42:21<22:21,  7.25s/it]

SELECT record_company , COUNT(*) FROM orchestra GROUP BY record_company
SELECT Record_Company ,  COUNT(*) FROM orchestra GROUP BY Record_Company
============================

 82%|████████▏ | 850/1034 [1:42:29<22:20,  7.28s/it]

SELECT COUNT(*) , record_company FROM orchestra GROUP BY record_company
SELECT Record_Company ,  COUNT(*) FROM orchestra GROUP BY Record_Company
============================

 82%|████████▏ | 851/1034 [1:42:36<22:11,  7.28s/it]

SELECT major_record_format FROM orchestra GROUP BY major_record_format ORDER BY COUNT(*) ASC
SELECT Major_Record_Format FROM orchestra GROUP BY Major_Record_Format ORDER BY COUNT(*) ASC
============================

 82%|████████▏ | 852/1034 [1:42:43<22:02,  7.27s/it]

SELECT major_record_format FROM orchestra_genres GROUP BY major_record_format ORDER BY COUNT(*) DESC
SELECT Major_Record_Format FROM orchestra GROUP BY Major_Record_Format ORDER BY COUNT(*) ASC
============================

 82%|████████▏ | 853/1034 [1:42:50<21:52,  7.25s/it]

SELECT orchestra_record_company FROM orchestras GROUP BY orchestra_record_company ORDER BY COUNT(*) DESC LIMIT 1
SELECT Record_Company FROM orchestra GROUP BY Record_Company ORDER BY COUNT(*) DESC LIMIT 1
============================

 83%|████████▎ | 854/1034 [1:42:57<21:37,  7.21s/it]

SELECT record_company FROM orchestra GROUP BY record_company ORDER BY COUNT(*) DESC LIMIT 1
SELECT Record_Company FROM orchestra GROUP BY Record_Company ORDER BY COUNT(*) DESC LIMIT 1
============================

 83%|████████▎ | 855/1034 [1:43:05<21:26,  7.18s/it]

SELECT orchestra FROM orchestra WHERE orchestra_id NOT IN (SELECT orchestra_id FROM performance)
SELECT Orchestra FROM orchestra WHERE Orchestra_ID NOT IN (SELECT Orchestra_ID FROM performance)
============================

 83%|████████▎ | 856/1034 [1:43:12<21:16,  7.17s/it]

SELECT orchestra FROM orchestra WHERE orchestra_id NOT IN (SELECT orchestra_id FROM performance)
SELECT Orchestra FROM orchestra WHERE Orchestra_ID NOT IN (SELECT Orchestra_ID FROM performance)
============================

 83%|████████▎ | 857/1034 [1:43:19<21:12,  7.19s/it]

SELECT orchestra FROM orchestra_founded_before_2003 INTERSECT SELECT orchestra FROM orchestra_founded_after_2003
SELECT Record_Company FROM orchestra WHERE Year_of_Founded  <  2003 INTERSECT SELECT Record_Company FROM orchestra WHERE Year_of_Founded  >  2003
============================

 83%|████████▎ | 858/1034 [1:43:26<21:06,  7.20s/it]

SELECT record_company FROM orchestra WHERE year_of_founded < 2003 INTERSECT SELECT record_company FROM orchestra WHERE year_of_founded > 2003
SELECT Record_Company FROM orchestra WHERE Year_of_Founded  <  2003 INTERSECT SELECT Record_Company FROM orchestra WHERE Year_of_Founded  >  2003
============================

 83%|████████▎ | 859/1034 [1:43:33<21:04,  7.23s/it]

SELECT COUNT(*) FROM orchestra WHERE major_record_format = "CD" OR major_record_format = "DVD"
SELECT COUNT(*) FROM orchestra WHERE Major_Record_Format  =  "CD" OR Major_Record_Format  =  "DVD"
============================

 83%|████████▎ | 860/1034 [1:43:41<20:56,  7.22s/it]

SELECT COUNT(*) FROM orchestra WHERE major_record_format = "CD" OR major_record_format = "DVD"
SELECT COUNT(*) FROM orchestra WHERE Major_Record_Format  =  "CD" OR Major_Record_Format  =  "DVD"
============================

 83%|████████▎ | 861/1034 [1:43:48<20:50,  7.23s/it]

SELECT t2.year_of_founded FROM performance as t1 JOIN orchestra as t2 ON t1.orchestra_id = t2.orchestra_id GROUP BY t2.year_of_founded HAVING COUNT(*) > 1
SELECT Year_of_Founded FROM orchestra AS T1 JOIN performance AS T2 ON T1.Orchestra_ID  =  T2.Orchestra_ID GROUP BY T2.Orchestra_ID HAVING COUNT(*)  >  1
============================

 83%|████████▎ | 862/1034 [1:43:55<20:44,  7.23s/it]

SELECT DISTINCT t2.year_of_founded FROM performance as t1 JOIN orchestra as t2 ON t1.orchestra_id = t2.orchestra_id GROUP BY t2.year_of_founded HAVING COUNT(*) > 1
SELECT Year_of_Founded FROM orchestra AS T1 JOIN performance AS T2 ON T1.Orchestra_ID  =  T2.Orchestra_ID GROUP BY T2.Orchestra_ID HAVING COUNT(*)  >  1
============================

 83%|████████▎ | 863/1034 [1:44:02<20:37,  7.24s/it]

SELECT COUNT(*) FROM highschoolers
SELECT count(*) FROM Highschooler
============================

 84%|████████▎ | 864/1034 [1:44:10<20:29,  7.23s/it]

SELECT COUNT(*) FROM highschoolers
SELECT count(*) FROM Highschooler
============================

 84%|████████▎ | 865/1034 [1:44:17<20:23,  7.24s/it]

SELECT name , grade FROM Highschooler
SELECT name ,  grade FROM Highschooler
============================

 84%|████████▍ | 866/1034 [1:44:24<20:17,  7.24s/it]

SELECT name , grade FROM highschooler
SELECT name ,  grade FROM Highschooler
============================

 84%|████████▍ | 867/1034 [1:44:31<20:11,  7.25s/it]

SELECT DISTINCT grade FROM highschooler
SELECT grade FROM Highschooler
============================

 84%|████████▍ | 868/1034 [1:44:39<20:01,  7.24s/it]

SELECT grade FROM highschooler
SELECT grade FROM Highschooler
============================

 84%|████████▍ | 869/1034 [1:44:46<19:50,  7.21s/it]

SELECT grade FROM highschooler WHERE name = "Kyle"
SELECT grade FROM Highschooler WHERE name  =  "Kyle"
============================

 84%|████████▍ | 870/1034 [1:44:53<19:39,  7.19s/it]

SELECT grade FROM highschooler WHERE name = "Kyle"
SELECT grade FROM Highschooler WHERE name  =  "Kyle"
============================

 84%|████████▍ | 871/1034 [1:45:00<19:29,  7.18s/it]

SELECT name FROM highschooler WHERE grade = 10
SELECT name FROM Highschooler WHERE grade  =  10
============================

 84%|████████▍ | 872/1034 [1:45:07<19:20,  7.16s/it]

SELECT name FROM highschooler WHERE grade = 10
SELECT name FROM Highschooler WHERE grade  =  10
============================

 84%|████████▍ | 873/1034 [1:45:14<19:12,  7.16s/it]

SELECT id FROM highschooler WHERE name = "Kyle"
SELECT ID FROM Highschooler WHERE name  =  "Kyle"
============================

 85%|████████▍ | 874/1034 [1:45:21<19:04,  7.15s/it]

SELECT id FROM highschooler WHERE name = "Kyle"
SELECT ID FROM Highschooler WHERE name  =  "Kyle"
============================

 85%|████████▍ | 875/1034 [1:45:29<18:59,  7.16s/it]

SELECT COUNT(*) FROM highschoolers WHERE grade = 9 OR grade = 10
SELECT count(*) FROM Highschooler WHERE grade  =  9 OR grade  =  10
============================

 85%|████████▍ | 876/1034 [1:45:36<18:56,  7.19s/it]

SELECT COUNT(*) FROM highschooler WHERE grade = 9 OR grade = 10
SELECT count(*) FROM Highschooler WHERE grade  =  9 OR grade  =  10
============================

 85%|████████▍ | 877/1034 [1:45:43<18:52,  7.21s/it]

SELECT grade , COUNT(*) FROM Highschooler GROUP BY grade
SELECT grade ,  count(*) FROM Highschooler GROUP BY grade
============================

 85%|████████▍ | 878/1034 [1:45:50<18:46,  7.22s/it]

SELECT grade , COUNT(*) FROM Highschooler GROUP BY grade
SELECT grade ,  count(*) FROM Highschooler GROUP BY grade
============================

 85%|████████▌ | 879/1034 [1:45:58<18:36,  7.21s/it]

SELECT grade FROM highschooler GROUP BY grade ORDER BY COUNT(*) DESC LIMIT 1
SELECT grade FROM Highschooler GROUP BY grade ORDER BY count(*) DESC LIMIT 1
============================

 85%|████████▌ | 880/1034 [1:46:05<18:26,  7.18s/it]

SELECT grade FROM highschooler GROUP BY grade ORDER BY COUNT(*) DESC LIMIT 1
SELECT grade FROM Highschooler GROUP BY grade ORDER BY count(*) DESC LIMIT 1
============================

 85%|████████▌ | 881/1034 [1:46:12<18:20,  7.20s/it]

SELECT grade FROM highschooler GROUP BY grade HAVING COUNT(*) >= 4
SELECT grade FROM Highschooler GROUP BY grade HAVING count(*)  >=  4
============================

 85%|████████▌ | 882/1034 [1:46:19<18:16,  7.21s/it]

SELECT grade FROM highschooler GROUP BY grade HAVING COUNT(*) >= 4
SELECT grade FROM Highschooler GROUP BY grade HAVING count(*)  >=  4
============================

 85%|████████▌ | 883/1034 [1:46:26<18:12,  7.23s/it]

SELECT student_id , COUNT(*) FROM Friend GROUP BY student_id
SELECT student_id ,  count(*) FROM Friend GROUP BY student_id
============================

 85%|████████▌ | 884/1034 [1:46:34<18:05,  7.24s/it]

SELECT COUNT(*) , t1.name FROM friends as t1 JOIN students as t2 ON t1.student_id = t2.id GROUP BY t1.student_id
SELECT student_id ,  count(*) FROM Friend GROUP BY student_id
============================

 86%|████████▌ | 885/1034 [1:46:41<17:59,  7.24s/it]

SELECT t2.name , COUNT(*) FROM friend as t1 JOIN highschooler as t2 ON t1.student_id = t2.id JOIN highschooler as t3 ON t1.friend_id = t3.id GROUP BY t2.name
SELECT T2.name ,  count(*) FROM Friend AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id GROUP BY T1.student_id
============================

 86%|████████▌ | 886/1034 [1:46:48<17:52,  7.25s/it]

SELECT T1.name , COUNT(*) FROM Highschooler as T1 JOIN Friend as T2 ON T1.id = T2.student_id GROUP BY T1.name
SELECT T2.name ,  count(*) FROM Friend AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id GROUP BY T1.student_id
============================

 86%|████████▌ | 887/1034 [1:46:55<17:45,  7.25s/it]

SELECT t2.name FROM friend as t1 JOIN highschooler as t2 ON t1.student_id = t2.id JOIN highschooler as t3 ON t1.friend_id = t3.id GROUP BY t2.name ORDER BY COUNT(*) DESC LIMIT 1
SELECT T2.name FROM Friend AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id GROUP BY T1.student_id ORDER BY count(*) DESC LIMIT 1
============================

 86%|████████▌ | 888/1034 [1:47:03<17:39,  7.25s/it]

SELECT t2.name FROM friend as t1 JOIN highschooler as t2 ON t1.student_id = t2.id JOIN highschooler as t3 ON t1.friend_id = t3.id GROUP BY t2.name ORDER BY COUNT(*) DESC LIMIT 1
SELECT T2.name FROM Friend AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id GROUP BY T1.student_id ORDER BY count(*) DESC LIMIT 1
============================

 86%|████████▌ | 889/1034 [1:47:10<17:32,  7.26s/it]

SELECT t1.name FROM highschooler as t1 JOIN friend as t2 ON t1.id = t2.student_id GROUP BY t2.student_id HAVING COUNT(*) >= 3
SELECT T2.name FROM Friend AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id GROUP BY T1.student_id HAVING count(*)  >=  3
============================

 86%|████████▌ | 890/1034 [1:47:17<17:23,  7.25s/it]

SELECT t2.name FROM friend as t1 JOIN highschooler as t2 ON t1.student_id = t2.id JOIN highschooler as t3 ON t1.friend_id = t3.id GROUP BY t2.name HAVING COUNT(*) >= 3
SELECT T2.name FROM Friend AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id GROUP BY T1.student_id HAVING count(*)  >=  3
============================

 86%|████████▌ | 891/1034 [1:47:24<17:15,  7.24s/it]

SELECT t2.name FROM friend as t1 JOIN highschooler as t2 ON t1.friend_id = t2.id JOIN highschooler as t3 ON t1.student_id = t3.id WHERE t3.name = "Kyle"
SELECT T3.name FROM Friend AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id JOIN Highschooler AS T3 ON T1.friend_id  =  T3.id WHERE T2.name  =  "Kyle"
============================

 86%|████████▋ | 892/1034 [1:47:32<17:08,  7.24s/it]

SELECT t2.name FROM friend as t1 JOIN highschooler as t2 ON t1.friend_id = t2.id JOIN highschooler as t3 ON t1.student_id = t3.id WHERE t3.name = "Kyle"
SELECT T3.name FROM Friend AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id JOIN Highschooler AS T3 ON T1.friend_id  =  T3.id WHERE T2.name  =  "Kyle"
============================

 86%|████████▋ | 893/1034 [1:47:39<17:00,  7.24s/it]

SELECT COUNT(*) FROM friends WHERE student_id = (SELECT id FROM students WHERE name = "Kyle" AND grade = "high")
SELECT count(*) FROM Friend AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id WHERE T2.name  =  "Kyle"
============================

 86%|████████▋ | 894/1034 [1:47:46<16:52,  7.23s/it]

SELECT COUNT(*) FROM friend AS t1 JOIN highschooler AS t2 ON t1.friend_id = t2.id JOIN highschooler AS t3 ON t1.student_id = t3.id WHERE t3.name = "Kyle"
SELECT count(*) FROM Friend AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id WHERE T2.name  =  "Kyle"
============================

 87%|████████▋ | 895/1034 [1:47:53<16:46,  7.24s/it]

SELECT id FROM highschooler EXCEPT SELECT student_id FROM friend UNION SELECT friend_id FROM friend
SELECT id FROM Highschooler EXCEPT SELECT student_id FROM Friend
============================

 87%|████████▋ | 896/1034 [1:48:01<16:39,  7.24s/it]

SELECT id FROM highschooler EXCEPT SELECT student_id FROM friend UNION SELECT friend_id FROM friend
SELECT id FROM Highschooler EXCEPT SELECT student_id FROM Friend
============================

 87%|████████▋ | 897/1034 [1:48:08<16:31,  7.24s/it]

SELECT name FROM highschooler WHERE id NOT IN (SELECT student_id FROM friend) AND id NOT IN (SELECT friend_id FROM friend)
SELECT name FROM Highschooler EXCEPT SELECT T2.name FROM Friend AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id
============================

 87%|████████▋ | 898/1034 [1:48:15<16:20,  7.21s/it]

SELECT name FROM highschooler EXCEPT SELECT t2.name FROM friend as t1 JOIN highschooler as t2 ON t1.friend_id = t2.id JOIN highschooler as t3 ON t1.student_id = t3.id WHERE t3.grade = t2.grade
SELECT name FROM Highschooler EXCEPT SELECT T2.name FROM Friend AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id
============================

 87%|████████▋ | 899/1034 [1:48:22<16:18,  7.25s/it]

SELECT t1.friend_id FROM friend as t1 JOIN likes as t2 ON t1.friend_id = t2.liked_id UNION SELECT t2.friend_id FROM friend as t1 JOIN likes as t2 ON t1.student_id = t2.liked_id
SELECT student_id FROM Friend INTERSECT SELECT liked_id FROM Likes
============================

 87%|████████▋ | 900/1034 [1:48:30<16:12,  7.26s/it]

SELECT t1.friend_id FROM friend as t1 JOIN likes as t2 ON t1.friend_id = t2.liked_id UNION SELECT t2.friend_id FROM friend as t1 JOIN likes as t2 ON t1.friend_id = t2.liked_id
SELECT student_id FROM Friend INTERSECT SELECT liked_id FROM Likes
============================

 87%|████████▋ | 901/1034 [1:48:37<16:05,  7.26s/it]

SELECT t3.name FROM likes as t1 JOIN friend as t2 ON t1.liked_id = t2.student_id JOIN highschooler as t3 ON t2.friend_id = t3.id UNION SELECT t3.name FROM likes as t1 JOIN friend as t2 ON t1.student_id = t2.student_id JOIN highschooler as t3 ON t2.friend_id = t3.id
SELECT T2.name FROM Friend AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id INTERSECT SELECT T2.name FROM Likes AS T1 JOIN Highschooler AS T2 ON T1.liked_id  =  T2.id
============================

 87%|████████▋ | 902/1034 [1:48:44<15:58,  7.26s/it]

SELECT t1.name FROM highschooler as t1 JOIN friend as t2 ON t1.id = t2.student_id JOIN likes as t3 ON t1.id = t3.liked_id ``` SELECT t1.name FROM highschooler as t1 JOIN friend as t2 ON t1.id = t2.student_id JOIN likes as t3 ON t1.id = t3.liked_id WHERE t1.id IN (SELECT friend_id FROM friend) AND t1.id IN (SELECT liked_id FROM likes)
SELECT T2.name FROM Friend AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id INTERSECT SELECT T2.name FROM Likes AS T1 JOIN Highschooler AS T2 ON T1.liked_id  =  T2.id
============================

 87%|████████▋ | 903/1034 [1:48:51<15:51,  7.26s/it]

SELECT COUNT(*) , student_id FROM likes GROUP BY student_id
SELECT student_id ,  count(*) FROM Likes GROUP BY student_id
============================

 87%|████████▋ | 904/1034 [1:48:59<15:43,  7.26s/it]

SELECT COUNT(*) , student_id FROM likes GROUP BY student_id
SELECT student_id ,  count(*) FROM Likes GROUP BY student_id
============================

 88%|████████▊ | 905/1034 [1:49:06<15:34,  7.24s/it]

SELECT T1.name , COUNT(*) FROM highschooler as T1 JOIN likes as T2 ON T1.id = T2.student_id GROUP BY T1.name
SELECT T2.name ,  count(*) FROM Likes AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id GROUP BY T1.student_id
============================

 88%|████████▊ | 906/1034 [1:49:13<15:24,  7.22s/it]

SELECT T1.name , COUNT(*) FROM highschooler as T1 JOIN likes as T2 ON T1.id = T2.student_id GROUP BY T1.name
SELECT T2.name ,  count(*) FROM Likes AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id GROUP BY T1.student_id
============================

 88%|████████▊ | 907/1034 [1:49:20<15:14,  7.20s/it]

SELECT T1.name FROM highschooler as T1 JOIN likes as T2 ON T1.id = T2.liked_id GROUP BY T2.liked_id ORDER BY COUNT(*) DESC LIMIT 1
SELECT T2.name FROM Likes AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id GROUP BY T1.student_id ORDER BY count(*) DESC LIMIT 1
============================

 88%|████████▊ | 908/1034 [1:49:27<15:08,  7.21s/it]

SELECT T1.name FROM highschooler as T1 JOIN likes as T2 ON T1.id = T2.liked_id GROUP BY T2.liked_id ORDER BY COUNT(*) DESC LIMIT 1
SELECT T2.name FROM Likes AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id GROUP BY T1.student_id ORDER BY count(*) DESC LIMIT 1
============================

 88%|████████▊ | 909/1034 [1:49:35<15:01,  7.21s/it]

SELECT T1.name FROM highschooler as T1 JOIN likes as T2 ON T1.id = T2.student_id GROUP BY T2.student_id HAVING COUNT(*) >= 2
SELECT T2.name FROM Likes AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id GROUP BY T1.student_id HAVING count(*)  >=  2
============================

 88%|████████▊ | 910/1034 [1:49:42<14:58,  7.25s/it]

SELECT T1.name FROM highschooler as T1 JOIN likes as T2 ON T1.id = T2.student_id GROUP BY T2.student_id HAVING COUNT(*) >= 2
SELECT T2.name FROM Likes AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id GROUP BY T1.student_id HAVING count(*)  >=  2
============================

 88%|████████▊ | 911/1034 [1:49:49<14:51,  7.25s/it]

SELECT t2.name FROM friend as t1 JOIN highschooler as t2 ON t1.student_id = t2.id JOIN highschooler as t3 ON t1.friend_id = t3.id WHERE t2.grade > 5 AND t3.grade > 5 GROUP BY t2.name HAVING COUNT(*) >= 2
SELECT T2.name FROM Friend AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id WHERE T2.grade  >  5 GROUP BY T1.student_id HAVING count(*)  >=  2
============================

 88%|████████▊ | 912/1034 [1:49:56<14:43,  7.24s/it]

SELECT t1.name FROM highschooler as t1 JOIN friend as t2 ON t1.id = t2.student_id WHERE t1.grade > 5 GROUP BY t1.id HAVING COUNT(*) >= 2
SELECT T2.name FROM Friend AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id WHERE T2.grade  >  5 GROUP BY T1.student_id HAVING count(*)  >=  2
============================

 88%|████████▊ | 913/1034 [1:50:04<14:35,  7.24s/it]

SELECT COUNT(*) FROM likes WHERE liked_id = (SELECT id FROM highschooler WHERE name = "Kyle")
SELECT count(*) FROM Likes AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id WHERE T2.name  =  "Kyle"
============================

 88%|████████▊ | 914/1034 [1:50:11<14:26,  7.22s/it]

SELECT COUNT(*) FROM likes WHERE liked_id = (SELECT id FROM highschooler WHERE name = "Kyle")
SELECT count(*) FROM Likes AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id WHERE T2.name  =  "Kyle"
============================

 88%|████████▊ | 915/1034 [1:50:18<14:20,  7.23s/it]

SELECT AVG(grade) FROM highschooler WHERE id IN (SELECT student_id FROM friend UNION SELECT friend_id FROM friend)
SELECT avg(grade) FROM Highschooler WHERE id IN (SELECT T1.student_id FROM Friend AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id)
============================

 89%|████████▊ | 916/1034 [1:50:25<14:14,  7.24s/it]

SELECT AVG(T2.grade) FROM Friend as T1 JOIN Highschooler as T2 ON T1.friend_id = T2.id JOIN Highschooler as T3 ON T1.student_id = T3.id GROUP BY T3.id
SELECT avg(grade) FROM Highschooler WHERE id IN (SELECT T1.student_id FROM Friend AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id)
============================

 89%|████████▊ | 917/1034 [1:50:33<14:07,  7.25s/it]

SELECT MIN(grade) FROM highschooler WHERE id NOT IN (SELECT student_id FROM friend) AND id NOT IN (SELECT friend_id FROM friend)
SELECT min(grade) FROM Highschooler WHERE id NOT IN (SELECT T1.student_id FROM Friend AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id)
============================

 89%|████████▉ | 918/1034 [1:50:40<14:01,  7.25s/it]

SELECT MIN(grade) FROM highschooler WHERE id NOT IN (SELECT student_id FROM friend) AND id NOT IN (SELECT friend_id FROM friend)
SELECT min(grade) FROM Highschooler WHERE id NOT IN (SELECT T1.student_id FROM Friend AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id)
============================

 89%|████████▉ | 919/1034 [1:50:47<13:54,  7.26s/it]

SELECT state FROM professionals INTERSECT SELECT state FROM owners
SELECT state FROM Owners INTERSECT SELECT state FROM Professionals
============================

 89%|████████▉ | 920/1034 [1:50:54<13:48,  7.27s/it]

SELECT state FROM professionals INTERSECT SELECT state FROM owners
SELECT state FROM Owners INTERSECT SELECT state FROM Professionals
============================

 89%|████████▉ | 921/1034 [1:51:02<13:42,  7.28s/it]

SELECT AVG(T1.age) FROM dogs as T1 JOIN treatments as T2 ON T1.dog_id = T2.dog_id
SELECT avg(age) FROM Dogs WHERE dog_id IN ( SELECT dog_id FROM Treatments )
============================

 89%|████████▉ | 922/1034 [1:51:09<13:36,  7.29s/it]

SELECT AVG(t2.age) FROM treatments as t1 JOIN dogs as t2 ON t1.dog_id = t2.dog_id
SELECT avg(age) FROM Dogs WHERE dog_id IN ( SELECT dog_id FROM Treatments )
============================

 89%|████████▉ | 923/1034 [1:51:16<13:28,  7.28s/it]

SELECT professional_id , last_name , cell_number FROM professionals WHERE state = "Indiana" UNION SELECT professional_id , last_name , cell_number FROM professionals WHERE professional_id IN (SELECT professional_id FROM treatments GROUP BY professional_id HAVING COUNT(*) > 2)
SELECT professional_id ,  last_name ,  cell_number FROM Professionals WHERE state  =  'Indiana' UNION SELECT T1.professional_id ,  T1.last_name ,  T1.cell_number FROM Professionals AS T1 JOIN Treatments AS T2 ON T1.professional_id  =  T2.professional_id GROUP BY T1.professional_id HAVING count(*)  >  2
============================

 89%|████████▉ | 924/1034 [1:51:24<13:19,  7.27s/it]

SELECT t2.professional_id , t2.last_name , t2.cell_number FROM treatments as t1 JOIN professionals as t2 ON t1.professional_id = t2.professional_id WHERE t2.state = "Indiana" GROUP BY t2.professional_id HAVING COUNT(*) > 2 UNION SELECT t2.professional_id , t2.last_name , t2.cell_number FROM treatments as t1 JOIN professionals as t2 ON t1.professional_id = t2.professional_id WHERE t2.state = "Indiana" GROUP BY t2.professional_id HAVING COUNT(*) > 2
SELECT professional_id ,  last_name ,  cell_number FROM Professionals WHERE state  =  'Indiana' UNION SELECT T1.professional_id ,  T1.last_name ,  T1.cell_number FROM Professionals AS T1 JOIN Treatments AS T2 ON T1.professional_id  =  T2.professional_id GROUP BY T1.professional_id HAVING count(*)  >  2
============================

 89%|████████▉ | 925/1034 [1:51:31<13:12,  7.27s/it]

SELECT t2.name FROM treatments as t1 JOIN dogs as t2 ON t1.dog_id = t2.dog_id JOIN owners as t3 ON t2.owner_id = t3.owner_id GROUP BY t2.name HAVING SUM(t1.cost_of_treatment) <= 1000
select name from dogs where dog_id not in ( select dog_id from treatments group by dog_id having sum(cost_of_treatment)  >  1000 )
============================

 90%|████████▉ | 926/1034 [1:51:38<13:04,  7.26s/it]

SELECT t2.name FROM treatments as t1 JOIN dogs as t2 ON t1.dog_id = t2.dog_id JOIN owners as t3 ON t2.owner_id = t3.owner_id GROUP BY t2.name HAVING SUM(t1.cost_of_treatment) <= 1000
select name from dogs where dog_id not in ( select dog_id from treatments group by dog_id having sum(cost_of_treatment)  >  1000 )
============================

 90%|████████▉ | 927/1034 [1:51:45<12:56,  7.25s/it]

SELECT first_name FROM professionals UNION SELECT first_name FROM owners EXCEPT SELECT name FROM dogs
SELECT first_name FROM Professionals UNION SELECT first_name FROM Owners EXCEPT SELECT name FROM Dogs
============================

 90%|████████▉ | 928/1034 [1:51:53<12:49,  7.26s/it]

SELECT first_name FROM professionals UNION SELECT first_name FROM owners EXCEPT SELECT name FROM dogs
SELECT first_name FROM Professionals UNION SELECT first_name FROM Owners EXCEPT SELECT name FROM Dogs
============================

 90%|████████▉ | 929/1034 [1:52:00<12:43,  7.27s/it]

SELECT professional_id , role_code , email_address FROM professionals EXCEPT SELECT professional_id , role_code , email_address FROM treatments
SELECT professional_id ,  role_code ,  email_address FROM Professionals EXCEPT SELECT T1.professional_id ,  T1.role_code ,  T1.email_address FROM Professionals AS T1 JOIN Treatments AS T2 ON T1.professional_id  =  T2.professional_id
============================

 90%|████████▉ | 930/1034 [1:52:07<12:40,  7.31s/it]

SELECT professional_id , role_code , email_address FROM professionals EXCEPT SELECT professional_id , role_code , email_address FROM professionals JOIN treatments ON professionals.professional_id = treatments.professional_id
SELECT professional_id ,  role_code ,  email_address FROM Professionals EXCEPT SELECT T1.professional_id ,  T1.role_code ,  T1.email_address FROM Professionals AS T1 JOIN Treatments AS T2 ON T1.professional_id  =  T2.professional_id
============================

 90%|█████████ | 931/1034 [1:52:15<12:34,  7.33s/it]

SELECT t2.owner_id , t2.first_name , t2.last_name FROM dogs as t1 JOIN owners as t2 ON t1.owner_id = t2.owner_id GROUP BY t2.owner_id ORDER BY COUNT(*) DESC LIMIT 1
SELECT T1.owner_id ,  T2.first_name ,  T2.last_name FROM Dogs AS T1 JOIN Owners AS T2 ON T1.owner_id  =  T2.owner_id GROUP BY T1.owner_id ORDER BY count(*) DESC LIMIT 1
============================

 90%|█████████ | 932/1034 [1:52:22<12:25,  7.31s/it]

SELECT t2.owner_id , t2.first_name , t2.last_name FROM dogs as t1 JOIN owners as t2 ON t1.owner_id = t2.owner_id GROUP BY t2.owner_id ORDER BY COUNT(*) DESC LIMIT 1
SELECT T1.owner_id ,  T2.first_name ,  T2.last_name FROM Dogs AS T1 JOIN Owners AS T2 ON T1.owner_id  =  T2.owner_id GROUP BY T1.owner_id ORDER BY count(*) DESC LIMIT 1
============================

 90%|█████████ | 933/1034 [1:52:29<12:20,  7.33s/it]

SELECT t1.professional_id , t1.role_code , t1.first_name FROM professionals as t1 JOIN treatments as t2 ON t1.professional_id = t2.professional_id GROUP BY t1.professional_id HAVING COUNT(*) >= 2
SELECT T1.professional_id ,  T1.role_code ,  T1.first_name FROM Professionals AS T1 JOIN Treatments AS T2 ON T1.professional_id  =  T2.professional_id GROUP BY T1.professional_id HAVING count(*)  >=  2
============================

 90%|█████████ | 934/1034 [1:52:37<12:14,  7.34s/it]

SELECT t2.professional_id , t2.role_code , t2.first_name FROM treatments as t1 JOIN professionals as t2 ON t1.professional_id = t2.professional_id GROUP BY t1.professional_id HAVING COUNT(*) >= 2
SELECT T1.professional_id ,  T1.role_code ,  T1.first_name FROM Professionals AS T1 JOIN Treatments AS T2 ON T1.professional_id  =  T2.professional_id GROUP BY T1.professional_id HAVING count(*)  >=  2
============================

 90%|█████████ | 935/1034 [1:52:44<12:06,  7.34s/it]

SELECT t2.breed_name FROM dogs as t1 JOIN breeds as t2 ON t1.breed_code = t2.breed_code GROUP BY t2.breed_name ORDER BY COUNT(*) DESC LIMIT 1
SELECT T1.breed_name FROM Breeds AS T1 JOIN Dogs AS T2 ON T1.breed_code  =  T2.breed_code GROUP BY T1.breed_name ORDER BY count(*) DESC LIMIT 1
============================

 91%|█████████ | 936/1034 [1:52:51<11:57,  7.32s/it]

SELECT breed_name FROM breeds JOIN dogs ON breeds.breed_code = dogs.breed_code GROUP BY breed_name ORDER BY COUNT(*) DESC LIMIT 1
SELECT T1.breed_name FROM Breeds AS T1 JOIN Dogs AS T2 ON T1.breed_code  =  T2.breed_code GROUP BY T1.breed_name ORDER BY count(*) DESC LIMIT 1
============================

 91%|█████████ | 937/1034 [1:52:59<11:51,  7.34s/it]

SELECT t2.owner_id , t3.last_name FROM treatments as t1 JOIN dogs as t2 ON t1.dog_id = t2.dog_id JOIN owners as t3 ON t2.owner_id = t3.owner_id GROUP BY t2.owner_id ORDER BY SUM(t1.cost_of_treatment) DESC LIMIT 1
SELECT T1.owner_id ,  T1.last_name FROM Owners AS T1 JOIN Dogs AS T2 ON T1.owner_id  =  T2.owner_id JOIN Treatments AS T3 ON T2.dog_id  =  T3.dog_id GROUP BY T1.owner_id ORDER BY count(*) DESC LIMIT 1
============================

 91%|█████████ | 938/1034 [1:53:06<11:42,  7.32s/it]

SELECT t3.owner_id , t3.last_name FROM treatments as t1 JOIN professionals as t2 ON t1.professional_id = t2.professional_id JOIN owners as t3 ON t2.owner_id = t3.owner_id GROUP BY t3.owner_id ORDER BY SUM(t1.cost_of_treatment) DESC LIMIT 1
SELECT T1.owner_id ,  T1.last_name FROM Owners AS T1 JOIN Dogs AS T2 ON T1.owner_id  =  T2.owner_id JOIN Treatments AS T3 ON T2.dog_id  =  T3.dog_id GROUP BY T1.owner_id ORDER BY count(*) DESC LIMIT 1
============================

 91%|█████████ | 939/1034 [1:53:13<11:33,  7.30s/it]

SELECT t3.description FROM treatments as t1 JOIN dogs as t2 ON t1.dog_id = t2.dog_id JOIN treatment_types as t3 ON t1.treatment_type_code = t3.treatment_type_code GROUP BY t3.description ORDER BY SUM(t1.cost_of_treatment) LIMIT 1
SELECT T1.treatment_type_description FROM Treatment_types AS T1 JOIN Treatments AS T2 ON T1.treatment_type_code  =  T2.treatment_type_code GROUP BY T1.treatment_type_code ORDER BY sum(cost_of_treatment) ASC LIMIT 1
============================

 91%|█████████ | 940/1034 [1:53:20<11:24,  7.28s/it]

SELECT t2.treatment_type_description FROM treatments as t1 JOIN treatment_types as t2 ON t1.treatment_type_code = t2.treatment_type_code GROUP BY t1.treatment_type_code ORDER BY SUM(t1.cost_of_treatment) LIMIT 1
SELECT T1.treatment_type_description FROM Treatment_types AS T1 JOIN Treatments AS T2 ON T1.treatment_type_code  =  T2.treatment_type_code GROUP BY T1.treatment_type_code ORDER BY sum(cost_of_treatment) ASC LIMIT 1
============================

 91%|█████████ | 941/1034 [1:53:28<11:16,  7.28s/it]

SELECT t2.owner_id , t2.zip_code FROM treatments as t1 JOIN dogs as t3 ON t1.dog_id = t3.dog_id JOIN owners as t2 ON t3.owner_id = t2.owner_id GROUP BY t2.owner_id ORDER BY SUM(t1.cost_of_treatment) DESC LIMIT 1
SELECT T1.owner_id ,  T1.zip_code FROM Owners AS T1 JOIN Dogs AS T2 ON T1.owner_id  =  T2.owner_id JOIN Treatments AS T3 ON T2.dog_id  =  T3.dog_id GROUP BY T1.owner_id ORDER BY sum(T3.cost_of_treatment) DESC LIMIT 1
============================

 91%|█████████ | 942/1034 [1:53:35<11:11,  7.30s/it]

SELECT t2.owner_id , t2.zip_code FROM treatments as t1 JOIN dogs as t3 ON t1.dog_id = t3.dog_id JOIN owners as t2 ON t3.owner_id = t2.owner_id GROUP BY t2.owner_id ORDER BY SUM(t1.cost_of_treatment) DESC LIMIT 1
SELECT T1.owner_id ,  T1.zip_code FROM Owners AS T1 JOIN Dogs AS T2 ON T1.owner_id  =  T2.owner_id JOIN Treatments AS T3 ON T2.dog_id  =  T3.dog_id GROUP BY T1.owner_id ORDER BY sum(T3.cost_of_treatment) DESC LIMIT 1
============================

 91%|█████████ | 943/1034 [1:53:42<11:06,  7.33s/it]

SELECT t2.professional_id , t2.cell_number FROM treatments as t1 JOIN professionals as t2 ON t1.professional_id = t2.professional_id GROUP BY t2.professional_id HAVING COUNT(DISTINCT t1.treatment_type_code) >= 2
SELECT T1.professional_id ,  T1.cell_number FROM Professionals AS T1 JOIN Treatments AS T2 ON T1.professional_id  =  T2.professional_id GROUP BY T1.professional_id HAVING count(*)  >=  2
============================

 91%|█████████▏| 944/1034 [1:53:50<10:57,  7.31s/it]

SELECT t2.professional_id , t2.cell_number FROM treatments as t1 JOIN professionals as t2 ON t1.professional_id = t2.professional_id GROUP BY t2.professional_id HAVING COUNT(*) >= 2
SELECT T1.professional_id ,  T1.cell_number FROM Professionals AS T1 JOIN Treatments AS T2 ON T1.professional_id  =  T2.professional_id GROUP BY T1.professional_id HAVING count(*)  >=  2
============================

 91%|█████████▏| 945/1034 [1:53:57<10:52,  7.33s/it]

SELECT t2.first_name , t2.last_name FROM treatments as t1 JOIN professionals as t2 ON t1.professional_id = t2.professional_id WHERE t1.cost_of_treatment < (SELECT AVG(cost_of_treatment) FROM treatments)
SELECT DISTINCT T1.first_name ,  T1.last_name FROM Professionals AS T1 JOIN Treatments AS T2 WHERE cost_of_treatment  <  ( SELECT avg(cost_of_treatment) FROM Treatments )
============================

 91%|█████████▏| 946/1034 [1:54:05<10:49,  7.38s/it]

SELECT DISTINCT t1.first_name , t1.last_name FROM professionals as t1 JOIN treatments as t2 ON t1.professional_id = t2.professional_id WHERE t2.cost_of_treatment < (SELECT AVG(cost_of_treatment) FROM treatments)
SELECT DISTINCT T1.first_name ,  T1.last_name FROM Professionals AS T1 JOIN Treatments AS T2 WHERE cost_of_treatment  <  ( SELECT avg(cost_of_treatment) FROM Treatments )
============================

 92%|█████████▏| 947/1034 [1:54:12<10:37,  7.33s/it]

SELECT t1.date , t2.first_name FROM treatment as t1 JOIN professional as t2 ON t1.professional_id = t2.id
SELECT T1.date_of_treatment ,  T2.first_name FROM Treatments AS T1 JOIN Professionals AS T2 ON T1.professional_id  =  T2.professional_id
============================

 92%|█████████▏| 948/1034 [1:54:19<10:27,  7.30s/it]

SELECT date_of_treatment , t1.first_name FROM treatments as t1 JOIN professionals as t2 ON t1.professional_id = t2.professional_id
SELECT T1.date_of_treatment ,  T2.first_name FROM Treatments AS T1 JOIN Professionals AS T2 ON T1.professional_id  =  T2.professional_id
============================

 92%|█████████▏| 949/1034 [1:54:26<10:23,  7.34s/it]

SELECT t1.cost , t2.treatment_type_description FROM medical_treatment as t1 JOIN treatment_type as t2 ON t1.treatment_type_code = t2.treatment_type_code
SELECT T1.cost_of_treatment ,  T2.treatment_type_description FROM Treatments AS T1 JOIN treatment_types AS T2 ON T1.treatment_type_code  =  T2.treatment_type_code
============================

 92%|█████████▏| 950/1034 [1:54:34<10:14,  7.32s/it]

SELECT cost , treatment_type_description FROM treatments
SELECT T1.cost_of_treatment ,  T2.treatment_type_description FROM Treatments AS T1 JOIN treatment_types AS T2 ON T1.treatment_type_code  =  T2.treatment_type_code
============================

 92%|█████████▏| 951/1034 [1:54:41<10:11,  7.37s/it]

SELECT t1.first_name , t1.last_name , t3.size_description FROM owners as t1 JOIN dogs as t2 ON t1.owner_id = t2.owner_id JOIN sizes as t3 ON t2.size_code = t3.size_code WHERE t2.gender = '1'
SELECT T1.first_name ,  T1.last_name ,  T2.size_code FROM Owners AS T1 JOIN Dogs AS T2 ON T1.owner_id  =  T2.owner_id
============================

 92%|█████████▏| 952/1034 [1:54:49<10:04,  7.38s/it]

SELECT t1.first_name , t1.last_name , t2.size_description FROM owners as t1 JOIN dogs as t3 ON t1.owner_id = t3.owner_id JOIN sizes as t2 ON t3.size_code = t2.size_code
SELECT T1.first_name ,  T1.last_name ,  T2.size_code FROM Owners AS T1 JOIN Dogs AS T2 ON T1.owner_id  =  T2.owner_id
============================

 92%|█████████▏| 953/1034 [1:54:56<10:00,  7.41s/it]

SELECT t2.first_name , t1.name FROM dogs as t1 JOIN owners as t2 ON t1.owner_id = t2.owner_id
SELECT T1.first_name ,  T2.name FROM Owners AS T1 JOIN Dogs AS T2 ON T1.owner_id  =  T2.owner_id
============================

 92%|█████████▏| 954/1034 [1:55:03<09:48,  7.36s/it]

SELECT t2.first_name , t1.name FROM dogs as t1 JOIN owners as t2 ON t1.owner_id = t2.owner_id
SELECT T1.first_name ,  T2.name FROM Owners AS T1 JOIN Dogs AS T2 ON T1.owner_id  =  T2.owner_id
============================

 92%|█████████▏| 955/1034 [1:55:11<09:44,  7.39s/it]

SELECT t2.name , t1.date_of_treatment FROM treatments as t1 JOIN dogs as t2 ON t1.dog_id = t2.dog_id JOIN breeds as t3 ON t2.breed_code = t3.breed_code GROUP BY t3.breed_name ORDER BY COUNT(*) ASC LIMIT 1
SELECT T1.name ,  T2.date_of_treatment FROM Dogs AS T1 JOIN Treatments AS T2 ON T1.dog_id  =  T2.dog_id WHERE T1.breed_code  =  ( SELECT breed_code FROM Dogs GROUP BY breed_code ORDER BY count(*) ASC LIMIT 1 )
============================

 92%|█████████▏| 956/1034 [1:55:18<09:37,  7.40s/it]

SELECT t2.name , t1.date_of_treatment FROM treatments as t1 JOIN dogs as t2 ON t1.dog_id = t2.dog_id JOIN breeds as t3 ON t2.breed_code = t3.breed_code GROUP BY t3.breed_name ORDER BY COUNT(*) LIMIT 1
SELECT T1.name ,  T2.date_of_treatment FROM Dogs AS T1 JOIN Treatments AS T2 ON T1.dog_id  =  T2.dog_id WHERE T1.breed_code  =  ( SELECT breed_code FROM Dogs GROUP BY breed_code ORDER BY count(*) ASC LIMIT 1 )
============================

 93%|█████████▎| 957/1034 [1:55:26<09:29,  7.39s/it]

SELECT t2.first_name , t1.name FROM dogs as t1 JOIN owners as t2 ON t1.owner_id = t2.owner_id WHERE t2.state = "Virginia"
SELECT T1.first_name ,  T2.name FROM Owners AS T1 JOIN Dogs AS T2 ON T1.owner_id  =  T2.owner_id WHERE T1.state  =  'Virginia'
============================

 93%|█████████▎| 958/1034 [1:55:33<09:21,  7.39s/it]

SELECT t2.first_name , t1.name FROM dogs as t1 JOIN owners as t2 ON t1.owner_id = t2.owner_id WHERE t2.state = "Virginia"
SELECT T1.first_name ,  T2.name FROM Owners AS T1 JOIN Dogs AS T2 ON T1.owner_id  =  T2.owner_id WHERE T1.state  =  'Virginia'
============================

 93%|█████████▎| 959/1034 [1:55:40<09:15,  7.41s/it]

SELECT date_arrived , date_departed FROM dogs WHERE abandoned_yn = '1'
SELECT DISTINCT T1.date_arrived ,  T1.date_departed FROM Dogs AS T1 JOIN Treatments AS T2 ON T1.dog_id  =  T2.dog_id
============================

 93%|█████████▎| 960/1034 [1:55:48<09:08,  7.41s/it]

SELECT t1.date_arrived , t1.date_departed FROM dogs as t1 JOIN treatments as t2 ON t1.dog_id = t2.dog_id
SELECT DISTINCT T1.date_arrived ,  T1.date_departed FROM Dogs AS T1 JOIN Treatments AS T2 ON T1.dog_id  =  T2.dog_id
============================

 93%|█████████▎| 961/1034 [1:55:55<09:00,  7.40s/it]

SELECT t1.last_name FROM owners as t1 JOIN dogs as t2 ON t1.owner_id = t2.owner_id ORDER BY t2.date_of_birth LIMIT 1
SELECT T1.last_name FROM Owners AS T1 JOIN Dogs AS T2 ON T1.owner_id  =  T2.owner_id WHERE T2.age  =  ( SELECT max(age) FROM Dogs )
============================

 93%|█████████▎| 962/1034 [1:56:03<08:51,  7.39s/it]

SELECT t1.last_name FROM owners as t1 JOIN dogs as t2 ON t1.owner_id = t2.owner_id ORDER BY t2.date_of_birth DESC LIMIT 1
SELECT T1.last_name FROM Owners AS T1 JOIN Dogs AS T2 ON T1.owner_id  =  T2.owner_id WHERE T2.age  =  ( SELECT max(age) FROM Dogs )
============================

 93%|█████████▎| 963/1034 [1:56:10<08:41,  7.35s/it]

SELECT email_address FROM professionals WHERE state = "Hawaii" OR state = "Wisconsin"
SELECT email_address FROM Professionals WHERE state  =  'Hawaii' OR state  =  'Wisconsin'
============================

 93%|█████████▎| 964/1034 [1:56:17<08:34,  7.34s/it]

SELECT email_address FROM professionals WHERE state = "Hawaii" OR state = "Wisconsin"
SELECT email_address FROM Professionals WHERE state  =  'Hawaii' OR state  =  'Wisconsin'
============================

 93%|█████████▎| 965/1034 [1:56:24<08:26,  7.34s/it]

SELECT arriving_date , departing_date FROM dogs
SELECT date_arrived ,  date_departed FROM Dogs
============================

 93%|█████████▎| 966/1034 [1:56:32<08:18,  7.33s/it]

SELECT date_arrived , date_departed FROM Dogs
SELECT date_arrived ,  date_departed FROM Dogs
============================

 94%|█████████▎| 967/1034 [1:56:39<08:11,  7.33s/it]

SELECT COUNT(DISTINCT dog_id) FROM treatments
SELECT count(DISTINCT dog_id) FROM Treatments
============================

 94%|█████████▎| 968/1034 [1:56:47<08:05,  7.36s/it]

SELECT COUNT(DISTINCT dog_id) FROM treatments
SELECT count(DISTINCT dog_id) FROM Treatments
============================

 94%|█████████▎| 969/1034 [1:56:54<07:57,  7.34s/it]

SELECT COUNT(DISTINCT professional_id) FROM treatments
SELECT count(DISTINCT professional_id) FROM Treatments
============================

 94%|█████████▍| 970/1034 [1:57:01<07:48,  7.33s/it]

SELECT COUNT(DISTINCT professional_id) FROM treatments
SELECT count(DISTINCT professional_id) FROM Treatments
============================

 94%|█████████▍| 971/1034 [1:57:08<07:40,  7.30s/it]

SELECT role_code , street , city , state FROM professionals WHERE city LIKE '%West%'
SELECT role_code ,  street ,  city ,  state FROM professionals WHERE city LIKE '%West%'
============================

 94%|█████████▍| 972/1034 [1:57:16<07:35,  7.35s/it]

SELECT role_code , street , city , state FROM professionals WHERE city LIKE '%West%'
SELECT role_code ,  street ,  city ,  state FROM professionals WHERE city LIKE '%West%'
============================

 94%|█████████▍| 973/1034 [1:57:23<07:26,  7.32s/it]

SELECT first_name , last_name , email_address FROM owners WHERE state LIKE '%North%'
SELECT first_name ,  last_name ,  email_address FROM Owners WHERE state LIKE '%North%'
============================

 94%|█████████▍| 974/1034 [1:57:30<07:19,  7.32s/it]

SELECT first_name , last_name , email_address FROM owners WHERE state LIKE '%North%'
SELECT first_name ,  last_name ,  email_address FROM Owners WHERE state LIKE '%North%'
============================

 94%|█████████▍| 975/1034 [1:57:38<07:10,  7.30s/it]

SELECT COUNT(*) FROM dogs WHERE age < (SELECT AVG(age) FROM dogs)
SELECT count(*) FROM Dogs WHERE age  <  ( SELECT avg(age) FROM Dogs )
============================

 94%|█████████▍| 976/1034 [1:57:45<07:06,  7.35s/it]

SELECT COUNT(*) FROM dogs WHERE age < (SELECT AVG(age) FROM dogs)
SELECT count(*) FROM Dogs WHERE age  <  ( SELECT avg(age) FROM Dogs )
============================

 94%|█████████▍| 977/1034 [1:57:52<06:57,  7.33s/it]

SELECT cost_of_treatment FROM treatments ORDER BY date_of_treatment DESC LIMIT 1
SELECT cost_of_treatment FROM Treatments ORDER BY date_of_treatment DESC LIMIT 1
============================

 95%|█████████▍| 978/1034 [1:58:00<06:49,  7.31s/it]

SELECT MAX(cost_of_treatment) FROM treatments
SELECT cost_of_treatment FROM Treatments ORDER BY date_of_treatment DESC LIMIT 1
============================

 95%|█████████▍| 979/1034 [1:58:07<06:41,  7.30s/it]

SELECT COUNT(*) FROM dogs WHERE dog_id NOT IN (SELECT dog_id FROM treatments)
SELECT count(*) FROM Dogs WHERE dog_id NOT IN ( SELECT dog_id FROM Treatments )
============================

 95%|█████████▍| 980/1034 [1:58:14<06:35,  7.33s/it]

SELECT COUNT(*) FROM dogs WHERE dog_id NOT IN (SELECT dog_id FROM treatments)
select count(*) from dogs where dog_id not in ( select dog_id from treatments )
============================

 95%|█████████▍| 981/1034 [1:58:22<06:29,  7.34s/it]

SELECT COUNT(*) FROM Owners WHERE owner_id NOT IN (SELECT owner_id FROM Dogs)
SELECT count(*) FROM Owners WHERE owner_id NOT IN ( SELECT owner_id FROM Dogs )
============================

 95%|█████████▍| 982/1034 [1:58:29<06:21,  7.34s/it]

SELECT COUNT(*) FROM Owners WHERE owner_id NOT IN (SELECT owner_id FROM Dogs)
SELECT count(*) FROM Owners WHERE owner_id NOT IN ( SELECT owner_id FROM Dogs )
============================

 95%|█████████▌| 983/1034 [1:58:36<06:14,  7.34s/it]

SELECT COUNT(*) FROM professionals WHERE id NOT IN (SELECT professional_id FROM treatments WHERE pet_type = "dog")
SELECT count(*) FROM Professionals WHERE professional_id NOT IN ( SELECT professional_id FROM Treatments )
============================

 95%|█████████▌| 984/1034 [1:58:44<06:05,  7.32s/it]

SELECT COUNT(*) FROM Professionals WHERE professional_id NOT IN (SELECT professional_id FROM Treatments)
SELECT count(*) FROM Professionals WHERE professional_id NOT IN ( SELECT professional_id FROM Treatments )
============================

 95%|█████████▌| 985/1034 [1:58:51<05:59,  7.33s/it]

SELECT name , age , weight FROM dogs WHERE abandoned_yn = 1
SELECT name ,  age ,  weight FROM Dogs WHERE abandoned_yn  =  1
============================

 95%|█████████▌| 986/1034 [1:58:58<05:50,  7.31s/it]

SELECT name , age , weight FROM dogs WHERE abandoned_yn = 1
SELECT name ,  age ,  weight FROM Dogs WHERE abandoned_yn  =  1
============================

 95%|█████████▌| 987/1034 [1:59:06<05:47,  7.40s/it]

SELECT AVG(age) FROM Dogs
SELECT avg(age) FROM Dogs
============================

 96%|█████████▌| 988/1034 [1:59:13<05:39,  7.39s/it]

SELECT AVG(age) FROM Dogs
SELECT avg(age) FROM Dogs
============================

 96%|█████████▌| 989/1034 [1:59:21<05:32,  7.39s/it]

SELECT MAX(age) FROM dogs
SELECT max(age) FROM Dogs
============================

 96%|█████████▌| 990/1034 [1:59:28<05:24,  7.38s/it]

SELECT MAX(age) FROM dogs
SELECT max(age) FROM Dogs
============================

 96%|█████████▌| 991/1034 [1:59:35<05:16,  7.37s/it]

SELECT charge_type , amount FROM charges
SELECT charge_type ,  charge_amount FROM Charges
============================

 96%|█████████▌| 992/1034 [1:59:43<05:09,  7.37s/it]

SELECT charge_type , charge_amount FROM Charges
SELECT charge_type ,  charge_amount FROM Charges
============================

 96%|█████████▌| 993/1034 [1:59:50<05:00,  7.34s/it]

SELECT MAX(charge_amount) FROM charges
SELECT max(charge_amount) FROM Charges
============================

 96%|█████████▌| 994/1034 [1:59:57<04:53,  7.33s/it]

SELECT MAX(charge_amount) FROM charges
SELECT max(charge_amount) FROM Charges
============================

 96%|█████████▌| 995/1034 [2:00:05<04:46,  7.35s/it]

SELECT email_address , cell_number , home_phone FROM professionals
SELECT email_address ,  cell_number ,  home_phone FROM professionals
============================

 96%|█████████▋| 996/1034 [2:00:12<04:38,  7.32s/it]

SELECT email_address , cell_number , home_phone FROM professionals
SELECT email_address ,  cell_number ,  home_phone FROM professionals
============================

 96%|█████████▋| 997/1034 [2:00:19<04:30,  7.31s/it]

SELECT DISTINCT breed_name , size_name FROM dogs AS t1 JOIN breeds AS t2 ON t1.breed_code = t2.breed_code JOIN sizes AS t3 ON t1.size_code = t3.size_code
SELECT DISTINCT breed_code ,  size_code FROM dogs
============================

 97%|█████████▋| 998/1034 [2:00:27<04:22,  7.29s/it]

SELECT DISTINCT breed_code , size_code FROM Dogs
SELECT DISTINCT breed_code ,  size_code FROM dogs
============================

 97%|█████████▋| 999/1034 [2:00:34<04:14,  7.28s/it]

SELECT t3.first_name , t2.treatment_type_description FROM treatments as t1 JOIN treatment_types as t2 ON t1.treatment_type_code = t2.treatment_type_code JOIN professionals as t3 ON t1.professional_id = t3.professional_id
SELECT DISTINCT T1.first_name ,  T3.treatment_type_description FROM professionals AS T1 JOIN Treatments AS T2 ON T1.professional_id  =  T2.professional_id JOIN Treatment_types AS T3 ON T2.treatment_type_code  =  T3.treatment_type_code
============================

 97%|█████████▋| 1000/1034 [2:00:41<04:07,  7.27s/it]

SELECT t1.first_name , t2.description FROM professionals as t1 JOIN treatments as t2 ON t1.id = t2.professional_id
SELECT DISTINCT T1.first_name ,  T3.treatment_type_description FROM professionals AS T1 JOIN Treatments AS T2 ON T1.professional_id  =  T2.professional_id JOIN Treatment_types AS T3 ON T2.treatment_type_code  =  T3.treatment_type_code
============================

 97%|█████████▋| 1001/1034 [2:00:48<04:00,  7.28s/it]

SELECT COUNT(*) FROM singer
SELECT count(*) FROM singer
============================

 97%|█████████▋| 1002/1034 [2:00:56<03:53,  7.30s/it]

SELECT COUNT(*) FROM singer
SELECT count(*) FROM singer
============================

 97%|█████████▋| 1003/1034 [2:01:03<03:45,  7.28s/it]

SELECT name FROM singer ORDER BY net_worth_millions ASC
SELECT Name FROM singer ORDER BY Net_Worth_Millions ASC
============================

 97%|█████████▋| 1004/1034 [2:01:10<03:38,  7.27s/it]

SELECT name FROM singer ORDER BY net_worth_millions ASC
SELECT Name FROM singer ORDER BY Net_Worth_Millions ASC
============================

 97%|█████████▋| 1005/1034 [2:01:17<03:30,  7.26s/it]

SELECT birth_year , citizenship FROM singers
SELECT Birth_Year ,  Citizenship FROM singer
============================

 97%|█████████▋| 1006/1034 [2:01:25<03:22,  7.24s/it]

SELECT birth_year , citizenship FROM singers
SELECT Birth_Year ,  Citizenship FROM singer
============================

 97%|█████████▋| 1007/1034 [2:01:32<03:16,  7.27s/it]

SELECT name FROM singer WHERE citizenship != "France"
SELECT Name FROM singer WHERE Citizenship != "France"
============================

 97%|█████████▋| 1008/1034 [2:01:39<03:08,  7.26s/it]

SELECT name FROM singer WHERE citizenship != "France"
SELECT Name FROM singer WHERE Citizenship != "France"
============================

 98%|█████████▊| 1009/1034 [2:01:47<03:02,  7.29s/it]

SELECT name FROM singer WHERE birth_year = 1948 OR birth_year = 1949
SELECT Name FROM singer WHERE Birth_Year  =  1948 OR Birth_Year  =  1949
============================

 98%|█████████▊| 1010/1034 [2:01:54<02:54,  7.28s/it]

SELECT name FROM singer WHERE birth_year = 1948 OR birth_year = 1949
SELECT Name FROM singer WHERE Birth_Year  =  1948 OR Birth_Year  =  1949
============================

 98%|█████████▊| 1011/1034 [2:02:01<02:46,  7.25s/it]

SELECT name FROM singer ORDER BY net_worth_millions DESC LIMIT 1
SELECT Name FROM singer ORDER BY Net_Worth_Millions DESC LIMIT 1
============================

 98%|█████████▊| 1012/1034 [2:02:08<02:39,  7.26s/it]

SELECT name FROM singer ORDER BY net_worth_millions DESC LIMIT 1
SELECT Name FROM singer ORDER BY Net_Worth_Millions DESC LIMIT 1
============================

 98%|█████████▊| 1013/1034 [2:02:16<02:32,  7.27s/it]

SELECT citizenship , COUNT(*) FROM singer GROUP BY citizenship
SELECT Citizenship ,  COUNT(*) FROM singer GROUP BY Citizenship
============================

 98%|█████████▊| 1014/1034 [2:02:23<02:25,  7.27s/it]

SELECT citizenship , COUNT(*) FROM singer GROUP BY citizenship
SELECT Citizenship ,  COUNT(*) FROM singer GROUP BY Citizenship
============================

 98%|█████████▊| 1015/1034 [2:02:30<02:18,  7.28s/it]

SELECT citizenship FROM singer GROUP BY citizenship ORDER BY COUNT(*) DESC LIMIT 1
SELECT Citizenship FROM singer GROUP BY Citizenship ORDER BY COUNT(*) DESC LIMIT 1
============================

 98%|█████████▊| 1016/1034 [2:02:37<02:10,  7.27s/it]

SELECT citizenship FROM singer GROUP BY citizenship ORDER BY COUNT(*) DESC LIMIT 1
select citizenship from singer group by citizenship order by count(*) desc limit 1
============================

 98%|█████████▊| 1017/1034 [2:02:45<02:04,  7.30s/it]

SELECT citizenship , MAX(net_worth_millions) FROM singer GROUP BY citizenship
SELECT Citizenship ,  max(Net_Worth_Millions) FROM singer GROUP BY Citizenship
============================

 98%|█████████▊| 1018/1034 [2:02:52<01:56,  7.31s/it]

SELECT citizenship , MAX(net_worth_millions) FROM singer GROUP BY citizenship
SELECT Citizenship ,  max(Net_Worth_Millions) FROM singer GROUP BY Citizenship
============================

 99%|█████████▊| 1019/1034 [2:02:59<01:49,  7.32s/it]

SELECT t2.title , t1.name FROM singer as t1 JOIN song as t2 ON t1.singer_id = t2.singer_id
SELECT T2.Title ,  T1.Name FROM singer AS T1 JOIN song AS T2 ON T1.Singer_ID  =  T2.Singer_ID
============================

 99%|█████████▊| 1020/1034 [2:03:07<01:42,  7.30s/it]

SELECT song_title , singer_name FROM songs
SELECT T2.Title ,  T1.Name FROM singer AS T1 JOIN song AS T2 ON T1.Singer_ID  =  T2.Singer_ID
============================

 99%|█████████▊| 1021/1034 [2:03:14<01:35,  7.31s/it]

SELECT DISTINCT t1.name FROM singer AS t1 JOIN song AS t2 ON t1.singer_id = t2.singer_id WHERE t2.sales > 300000
SELECT DISTINCT T1.Name FROM singer AS T1 JOIN song AS T2 ON T1.Singer_ID  =  T2.Singer_ID WHERE T2.Sales  >  300000
============================

 99%|█████████▉| 1022/1034 [2:03:21<01:27,  7.33s/it]

SELECT DISTINCT t2.name FROM song as t1 JOIN singer as t2 ON t1.singer_id = t2.singer_id WHERE t1.sales > 300000
SELECT DISTINCT T1.Name FROM singer AS T1 JOIN song AS T2 ON T1.Singer_ID  =  T2.Singer_ID WHERE T2.Sales  >  300000
============================

 99%|█████████▉| 1023/1034 [2:03:29<01:20,  7.34s/it]

SELECT t1.name FROM singer as t1 JOIN song as t2 ON t1.singer_id = t2.singer_id GROUP BY t1.name HAVING COUNT(*) > 1
SELECT T1.Name FROM singer AS T1 JOIN song AS T2 ON T1.Singer_ID  =  T2.Singer_ID GROUP BY T1.Name HAVING COUNT(*)  >  1
============================

 99%|█████████▉| 1024/1034 [2:03:36<01:13,  7.34s/it]

SELECT t1.name FROM singer as t1 JOIN song as t2 ON t1.singer_id = t2.singer_id GROUP BY t1.name HAVING COUNT(*) > 1
SELECT T1.Name FROM singer AS T1 JOIN song AS T2 ON T1.Singer_ID  =  T2.Singer_ID GROUP BY T1.Name HAVING COUNT(*)  >  1
============================

 99%|█████████▉| 1025/1034 [2:03:44<01:07,  7.52s/it]

SELECT t1.name , SUM(t2.sales) FROM singer as t1 JOIN song as t2 ON t1.singer_id = t2.singer_id GROUP BY t1.name
SELECT T1.Name ,  sum(T2.Sales) FROM singer AS T1 JOIN song AS T2 ON T1.Singer_ID  =  T2.Singer_ID GROUP BY T1.Name
============================

 99%|█████████▉| 1026/1034 [2:03:51<00:59,  7.48s/it]

SELECT t1.name , SUM(t2.sales) FROM singer as t1 JOIN song as t2 ON t1.singer_id = t2.singer_id GROUP BY t1.name
SELECT T1.Name ,  sum(T2.Sales) FROM singer AS T1 JOIN song AS T2 ON T1.Singer_ID  =  T2.Singer_ID GROUP BY T1.Name
============================

 99%|█████████▉| 1027/1034 [2:03:59<00:51,  7.41s/it]

SELECT name FROM singer WHERE singer_id NOT IN (SELECT singer_id FROM song)
SELECT Name FROM singer WHERE Singer_ID NOT IN (SELECT Singer_ID FROM song)
============================

 99%|█████████▉| 1028/1034 [2:04:06<00:44,  7.37s/it]

SELECT name FROM singer EXCEPT SELECT t1.name FROM singer as t1 JOIN song as t2 ON t1.singer_id = t2.singer_id
SELECT Name FROM singer WHERE Singer_ID NOT IN (SELECT Singer_ID FROM song)
============================

100%|█████████▉| 1029/1034 [2:04:13<00:36,  7.35s/it]

SELECT citizenship FROM singer WHERE birth_year < 1955 INTERSECT SELECT citizenship FROM singer WHERE birth_year > 1945
SELECT Citizenship FROM singer WHERE Birth_Year  <  1945 INTERSECT SELECT Citizenship FROM singer WHERE Birth_Year  >  1955
============================

100%|█████████▉| 1030/1034 [2:04:20<00:29,  7.32s/it]

SELECT citizenship FROM singer WHERE birth_year < 1945 INTERSECT SELECT citizenship FROM singer WHERE birth_year > 1955
SELECT Citizenship FROM singer WHERE Birth_Year  <  1945 INTERSECT SELECT Citizenship FROM singer WHERE Birth_Year  >  1955
============================

100%|█████████▉| 1031/1034 [2:04:28<00:21,  7.30s/it]

SELECT COUNT(*) FROM Other_Available_Features
SELECT count(*) FROM Other_Available_Features
============================

100%|█████████▉| 1032/1034 [2:04:35<00:14,  7.30s/it]

SELECT feature_type_name FROM ref_feature_types WHERE feature_type_code = "AirCon"
SELECT T2.feature_type_name FROM Other_Available_Features AS T1 JOIN Ref_Feature_Types AS T2 ON T1.feature_type_code  =  T2.feature_type_code WHERE T1.feature_name  =  "AirCon"
============================

100%|█████████▉| 1033/1034 [2:04:42<00:07,  7.30s/it]

SELECT t2.property_type_description FROM properties as t1 JOIN ref_property_types as t2 ON t1.property_type_code = t2.property_type_code GROUP BY t1.property_type_code
SELECT T2.property_type_description FROM Properties AS T1 JOIN Ref_Property_Types AS T2 ON T1.property_type_code  =  T2.property_type_code GROUP BY T1.property_type_code
============================

100%|██████████| 1034/1034 [2:04:50<00:00,  7.24s/it]

SELECT property_name FROM properties WHERE property_type_code = "House" OR property_type_code = "Apartment" AND room_count > 1
SELECT property_name FROM Properties WHERE property_type_code  =  "House" UNION SELECT property_name FROM Properties WHERE property_type_code  =  "Apartment" AND room_count  >  1
============================

In [8]:
new_df.to_csv('qwen_pred.csv')

In [9]:
predicted_queries = new_df["generated_query"]

with open("Predicted.sql", "w") as f:
    for query in predicted_queries:
        f.write(query + ";\n")

print("The generated query has been written to the Predicted.sql file.")

The generated query has been written to the Predicted.sql file.

In [1]:
import subprocess

# 假设 evaluation.py 在当前工作目录下，或者提供完整路径
script_path = 'eval/evaluation.py'
sql_file_path = 'Predicted.sql'

# 构建命令行命令
command = ['python', script_path, '--input', sql_file_path]

# 运行评估脚本
result = subprocess.run(command, capture_output=True, text=True)

# 打印输出结果
print("STDOUT:", result.stdout)
print("STDERR:", result.stderr)

STDOUT: params as fllows
 Namespace(input='Predicted.sql', gold='eval/eval_data/gold.txt', db='spider/database', table='eval/eval_data/tables.json', etype='all', plug_value=False, keep_distinct=False, progress_bar_for_each_datapoint=False, natsql=False, pred='Predicted.sql')
gseq_one length  1034
pseq_one length 1034
compare pred idx 0
compare pred idx 1
compare pred idx 2
compare pred idx 3
compare pred idx 4
compare pred idx 5
compare pred idx 6
compare pred idx 7
compare pred idx 8
compare pred idx 9
compare pred idx 10
compare pred idx 11
compare pred idx 12
compare pred idx 13
compare pred idx 14
compare pred idx 15
compare pred idx 16
medium pred: SELECT MAX(capacity) , AVG(capacity) FROM stadium;
medium gold: select max(capacity), average from stadium

compare pred idx 17
compare pred idx 18
compare pred idx 19
compare pred idx 20
compare pred idx 21
compare pred idx 22
medium pred: SELECT t2.name , COUNT(*) FROM concert as t1 JOIN stadium as t2 ON t1.stadium_id = t2.stadium_id GROUP BY t2.name;
medium gold: SELECT T2.name ,  count(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id GROUP BY T1.stadium_id

compare pred idx 23
medium pred: SELECT COUNT(*) , t2.name FROM concert as t1 JOIN stadium as t2 ON t1.stadium_id = t2.stadium_id GROUP BY t2.name;
medium gold: SELECT T2.name ,  count(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id GROUP BY T1.stadium_id

compare pred idx 24
compare pred idx 25
compare pred idx 26
compare pred idx 27
compare pred idx 28
compare pred idx 29
compare pred idx 30
compare pred idx 31
hard pred: SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert WHERE year = 2014);
hard gold: SELECT name FROM stadium EXCEPT SELECT T2.name FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  =  2014

compare pred idx 32
hard pred: SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert WHERE year = 2014);
hard gold: SELECT name FROM stadium EXCEPT SELECT T2.name FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  =  2014

compare pred idx 33
compare pred idx 34
medium pred: SELECT t2.concert_name , t2.theme , COUNT(*) FROM singer_in_concert as t1 JOIN concert as t2 ON t1.concert_id = t2.concert_id GROUP BY t2.concert_name;
medium gold: select t2.concert_name ,  t2.theme ,  count(*) from singer_in_concert as t1 join concert as t2 on t1.concert_id  =  t2.concert_id group by t2.concert_id

compare pred idx 35
medium pred: SELECT t1.name , COUNT(*) FROM singer AS t1 JOIN singer_in_concert AS t2 ON t1.singer_id = t2.singer_id GROUP BY t1.name;
medium gold: SELECT T2.name ,  count(*) FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id GROUP BY T2.singer_id

compare pred idx 36
medium pred: SELECT t1.name , COUNT(*) FROM singer as t1 JOIN singer_in_concert as t2 ON t1.singer_id = t2.singer_id GROUP BY t1.name;
medium gold: SELECT T2.name ,  count(*) FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id GROUP BY T2.singer_id

compare pred idx 37
compare pred idx 38
compare pred idx 39
compare pred idx 40
compare pred idx 41
compare pred idx 42
compare pred idx 43
hard pred: SELECT COUNT(*) FROM concert JOIN stadium ON concert.stadium_id = stadium.stadium_id ORDER BY stadium.capacity DESC LIMIT 1;
hard gold: select count(*) from concert where stadium_id = (select stadium_id from stadium order by capacity desc limit 1)

compare pred idx 44
hard pred: SELECT COUNT(*) FROM stadium WHERE capacity = (SELECT MAX(capacity) FROM stadium);
hard gold: select count(*) from concert where stadium_id = (select stadium_id from stadium order by capacity desc limit 1)

compare pred idx 45
compare pred idx 46
compare pred idx 47
medium pred: SELECT weight FROM pets WHERE pettype = "dog" ORDER BY pet_age ASC LIMIT 1;
medium gold: SELECT weight FROM pets ORDER BY pet_age LIMIT 1

compare pred idx 48
medium pred: SELECT weight FROM pets WHERE pettype = "dog" ORDER BY pet_age ASC LIMIT 1;
medium gold: SELECT weight FROM pets ORDER BY pet_age LIMIT 1

compare pred idx 49
compare pred idx 50
compare pred idx 51
compare pred idx 52
compare pred idx 53
compare pred idx 54
hard pred: SELECT COUNT(*) FROM pet AS t1 JOIN student AS t2 ON t1.owner_id = t2.student_id WHERE t1.species = "dog" AND t2.gender = "female";
hard gold: SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T2.petid  =  T3.petid WHERE T1.sex  =  'F' AND T3.pettype  =  'dog'

compare pred idx 55
compare pred idx 56
compare pred idx 57
compare pred idx 58
compare pred idx 59
compare pred idx 60
compare pred idx 61
extra pred: SELECT major , age FROM student WHERE stuid NOT IN (SELECT t1.stuid FROM has_pet as t1 JOIN pets as t2 ON t1.petid = t2.petid WHERE t2.pettype = "cat");
extra gold: SELECT major ,  age FROM student WHERE stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')

compare pred idx 62
extra pred: SELECT major , age FROM student WHERE stuid NOT IN (SELECT t1.stuid FROM has_pet as t1 JOIN pets as t2 ON t1.petid = t2.petid WHERE t2.pettype = "cat");
extra gold: SELECT major ,  age FROM student WHERE stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')

compare pred idx 63
hard pred: SELECT stuid FROM has_pet EXCEPT SELECT t1.stuid FROM has_pet as t1 JOIN pets as t2 ON t1.petid = t2.petid WHERE t2.pettype = "cat";
hard gold: SELECT stuid FROM student EXCEPT SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat'

compare pred idx 64
hard pred: SELECT stuid FROM has_pet EXCEPT SELECT t1.stuid FROM has_pet as t1 JOIN pets as t2 ON t1.petid = t2.petid WHERE t2.pettype = "cat";
hard gold: SELECT stuid FROM student EXCEPT SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat'

compare pred idx 65
extra pred: SELECT t1.fname , t1.age FROM student as t1 JOIN has_pet as t3 ON t1.stuid = t3.stuid JOIN pets as t2 ON t3.petid = t2.petid WHERE t2.pettype = "dog" EXCEPT SELECT t1.fname , t1.age FROM student as t1 JOIN has_pet as t3 ON t1.stuid = t3.stuid JOIN pets as t2 ON t3.petid = t2.petid WHERE t2.pettype = "cat";
extra gold: SELECT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog' AND T1.stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')

compare pred idx 66
extra pred: SELECT t1.fname FROM student as t1 JOIN has_pet as t3 ON t1.stuid = t3.stuid JOIN pets as t2 ON t3.petid = t2.petid WHERE t2.pettype = "dog" EXCEPT SELECT t1.fname FROM student as t1 JOIN has_pet as t3 ON t1.stuid = t3.stuid JOIN pets as t2 ON t3.petid = t2.petid WHERE t2.pettype = "cat";
extra gold: SELECT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog' AND T1.stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')

compare pred idx 67
medium pred: SELECT type , weight FROM pets ORDER BY age ASC LIMIT 1;
medium gold: SELECT pettype ,  weight FROM pets ORDER BY pet_age LIMIT 1

compare pred idx 68
compare pred idx 69
compare pred idx 70
compare pred idx 71
compare pred idx 72
compare pred idx 73
compare pred idx 74
compare pred idx 75
compare pred idx 76
compare pred idx 77
medium pred: SELECT t2.petid FROM student as t1 JOIN has_pet as t3 ON t1.stuid = t3.stuid JOIN pets as t2 ON t3.petid = t2.petid WHERE t1.lname = 'Smith';
medium gold: SELECT T2.petid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.Lname  =  'Smith'

compare pred idx 78
medium pred: SELECT t2.petid FROM student as t1 JOIN has_pet as t3 ON t1.stuid = t3.stuid JOIN pets as t2 ON t3.petid = t2.petid WHERE t1.lname = 'Smith';
medium gold: SELECT T2.petid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.Lname  =  'Smith'

compare pred idx 79
medium pred: SELECT COUNT(*) , t1.stuid FROM has_pet as t1 JOIN pets as t2 ON t1.petid = t2.petid GROUP BY t1.stuid;
medium gold: SELECT count(*) ,  T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid GROUP BY T1.stuid

compare pred idx 80
medium pred: SELECT stuid , COUNT(*) FROM has_pet GROUP BY stuid;
medium gold: select count(*) ,  t1.stuid from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid group by t1.stuid

compare pred idx 81
compare pred idx 82
compare pred idx 83
compare pred idx 84
compare pred idx 85
compare pred idx 86
extra pred: SELECT AVG(age) FROM students WHERE pet_owner = 0;
extra gold: select avg(age) from student where stuid not in (select stuid from has_pet)

compare pred idx 87
compare pred idx 88
compare pred idx 89
medium pred: SELECT t2.continent , t2.contid , COUNT(*) FROM countries as t1 JOIN continents as t2 ON t1.continent = t2.contid GROUP BY t2.continent;
medium gold: SELECT T1.ContId ,  T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.Continent GROUP BY T1.ContId;

compare pred idx 90
medium pred: SELECT t2.contid , t2.continent , COUNT(*) FROM countries as t1 JOIN continents as t2 ON t1.continent = t2.contid GROUP BY t2.continent;
medium gold: SELECT T1.ContId ,  T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.Continent GROUP BY T1.ContId;

compare pred idx 91
compare pred idx 92
compare pred idx 93
compare pred idx 94
compare pred idx 95
hard pred: SELECT model FROM model_list ORDER BY horsepower LIMIT 1;
hard gold: SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id ORDER BY T2.horsepower ASC LIMIT 1;

compare pred idx 96
hard pred: SELECT t1.model FROM car_names as t1 JOIN model_list as t2 ON t1.model = t2.model ORDER BY t2.horsepower LIMIT 1;
hard gold: SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id ORDER BY T2.horsepower ASC LIMIT 1;

compare pred idx 97
extra pred: SELECT model FROM car_names WHERE weight < (SELECT AVG(weight) FROM car_names);
extra gold: SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id WHERE T2.Weight  <  (SELECT avg(Weight) FROM CARS_DATA)

compare pred idx 98
extra pred: SELECT model FROM car_names WHERE weight < (SELECT AVG(weight) FROM car_names);
extra gold: SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id WHERE T2.Weight  <  (SELECT avg(Weight) FROM CARS_DATA)

compare pred idx 99
extra pred: SELECT DISTINCT t3.maker FROM car_names as t1 JOIN cars_data as t2 ON t1.makeid = t2.id JOIN car_makers as t3 ON t1.makeid = t3.id WHERE t2.year = 1970;
extra gold: SELECT DISTINCT T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker JOIN CAR_NAMES AS T3 ON T2.model  =  T3.model JOIN CARS_DATA AS T4 ON T3.MakeId  =  T4.id WHERE T4.year  =  '1970';

compare pred idx 100
extra pred: SELECT DISTINCT t2.maker FROM cars_data AS t1 JOIN car_names AS t3 ON t1.id = t3.makeid JOIN car_makers AS t2 ON t3.make = t2.maker WHERE t1.year = 1970;
extra gold: SELECT DISTINCT T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker JOIN CAR_NAMES AS T3 ON T2.model  =  T3.model JOIN CARS_DATA AS T4 ON T3.MakeId  =  T4.id WHERE T4.year  =  '1970';

compare pred idx 101
extra pred: SELECT make , year FROM car_names JOIN cars_data ON car_names.makeid = cars_data.id ORDER BY cars_data.year LIMIT 1;
extra gold: SELECT T2.Make ,  T1.Year FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id  =  T2.MakeId WHERE T1.Year  =  (SELECT min(YEAR) FROM CARS_DATA);

compare pred idx 102
extra pred: SELECT t1.maker , MIN(t2.year) FROM car_makers as t1 JOIN cars_data as t2 ON t1.id = t2.id GROUP BY t1.maker ORDER BY MIN(t2.year) LIMIT 1;
extra gold: SELECT T2.Make ,  T1.Year FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id  =  T2.MakeId WHERE T1.Year  =  (SELECT min(YEAR) FROM CARS_DATA);

compare pred idx 103
hard pred: SELECT DISTINCT t2.model FROM cars_data as t1 JOIN model_list as t2 ON t1.id = t2.modelid WHERE t1.year > 1980;
hard gold: SELECT DISTINCT T1.model FROM MODEL_LIST AS T1 JOIN CAR_NAMES AS T2 ON T1.model  =  T2.model JOIN CARS_DATA AS T3 ON T2.MakeId  =  T3.id WHERE T3.year  >  1980;

compare pred idx 104
hard pred: SELECT DISTINCT t2.model FROM cars_data as t1 JOIN model_list as t2 ON t1.id = t2.modelid WHERE t1.year > 1980;
hard gold: SELECT DISTINCT T1.model FROM MODEL_LIST AS T1 JOIN CAR_NAMES AS T2 ON T1.model  =  T2.model JOIN CARS_DATA AS T3 ON T2.MakeId  =  T3.id WHERE T3.year  >  1980;

compare pred idx 105
compare pred idx 106
hard pred: SELECT t2.continent , COUNT(*) FROM car_makers as t1 JOIN continents as t2 ON t1.country = t2.contid GROUP BY t2.continent;
hard gold: SELECT T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.continent JOIN car_makers AS T3 ON T2.CountryId  =  T3.Country GROUP BY T1.Continent;

compare pred idx 107
extra pred: SELECT T2.countryname FROM car_makers as T1 JOIN countries as T2 ON T1.country = T2.countryid GROUP BY T2.countryname ORDER BY COUNT(*) DESC LIMIT 1;
extra gold: SELECT T2.CountryName FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country  =  T2.CountryId GROUP BY T1.Country ORDER BY Count(*) DESC LIMIT 1;

compare pred idx 108
extra pred: SELECT T2.countryname FROM car_makers as T1 JOIN countries as T2 ON T1.country = T2.countryid GROUP BY T2.countryname ORDER BY COUNT(*) DESC LIMIT 1;
extra gold: SELECT T2.CountryName FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country  =  T2.CountryId GROUP BY T1.Country ORDER BY Count(*) DESC LIMIT 1;

compare pred idx 109
medium pred: SELECT COUNT(*) , T2.fullname FROM model_list as T1 JOIN car_makers as T2 ON T1.maker = T2.id GROUP BY T2.fullname;
medium gold: select count(*) ,  t2.fullname from model_list as t1 join car_makers as t2 on t1.maker  =  t2.id group by t2.id;

compare pred idx 110
medium pred: SELECT COUNT(*) , T2.maker , T1.id , T1.fullname FROM car_makers as T1 JOIN model_list as T2 ON T1.id = T2.maker GROUP BY T2.maker , T1.id , T1.fullname;
medium gold: SELECT Count(*) ,  T2.FullName ,  T2.id FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker  =  T2.Id GROUP BY T2.id;

compare pred idx 111
medium pred: SELECT t4.accelerate FROM countries as t1 JOIN car_makers as t2 ON t1.countryid = t2.country JOIN model_list as t3 ON t2.id = t3.maker JOIN car_names as t4 ON t3.model = t4.model JOIN cars_data as t5 ON t4.makeid = t5.id WHERE t2.maker = "amc" AND t4.make = "hornet sportabout (sw)";
medium gold: SELECT T1.Accelerate FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id  =  T2.MakeId WHERE T2.Make  =  'amc hornet sportabout (sw)';

compare pred idx 112
medium pred: SELECT t4.accelerate FROM car_names as t1 JOIN model_list as t2 ON t1.model = t2.model JOIN car_makers as t3 ON t2.maker = t3.id JOIN cars_data as t4 ON t1.makeid = t4.id WHERE t1.make = "amc" AND t1.model = "hornet sportabout (sw)";
medium gold: SELECT T1.Accelerate FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id  =  T2.MakeId WHERE T2.Make  =  'amc hornet sportabout (sw)';

compare pred idx 113
medium pred: SELECT COUNT(*) FROM car_makers WHERE country = "france";
medium gold: SELECT count(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country  =  T2.CountryId WHERE T2.CountryName  =  'france';

compare pred idx 114
medium pred: SELECT COUNT(*) FROM car_makers WHERE country = "France";
medium gold: SELECT count(*) FROM CAR_MAKERS AS T1 JOIN COUNTRIES AS T2 ON T1.Country  =  T2.CountryId WHERE T2.CountryName  =  'france';

compare pred idx 115
hard pred: SELECT COUNT(*) FROM car_makers AS t1 JOIN countries AS t2 ON t1.country = t2.countryid WHERE t2.countryname = "usa";
hard gold: SELECT count(*) FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker  =  T2.Id JOIN COUNTRIES AS T3 ON T2.Country  =  T3.CountryId WHERE T3.CountryName  =  'usa';

compare pred idx 116
hard pred: SELECT COUNT(*) FROM car_makers AS t1 JOIN countries AS t2 ON t1.country = t2.countryid WHERE t2.countryname = "usa";
hard gold: SELECT count(*) FROM MODEL_LIST AS T1 JOIN CAR_MAKERS AS T2 ON T1.Maker  =  T2.Id JOIN COUNTRIES AS T3 ON T2.Country  =  T3.CountryId WHERE T3.CountryName  =  'usa';

compare pred idx 117
compare pred idx 118
compare pred idx 119
medium pred: SELECT weight FROM cars_data WHERE cylinders = 8 AND year = 1974 ORDER BY weight ASC LIMIT 1;
medium gold: select min(weight) from cars_data where cylinders  =  8 and year  =  1974

compare pred idx 120
compare pred idx 121
compare pred idx 122
compare pred idx 123
medium pred: SELECT country , id FROM car_makers GROUP BY country HAVING COUNT(*) >= 1;
medium gold: SELECT T1.CountryName ,  T1.CountryId FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId  =  T2.Country GROUP BY T1.CountryId HAVING count(*)  >=  1;

compare pred idx 124
medium pred: SELECT DISTINCT t2.countryname , t2.countryid FROM car_makers as t1 JOIN countries as t2 ON t1.country = t2.countryid;
medium gold: SELECT T1.CountryName ,  T1.CountryId FROM COUNTRIES AS T1 JOIN CAR_MAKERS AS T2 ON T1.CountryId  =  T2.Country GROUP BY T1.CountryId HAVING count(*)  >=  1;

compare pred idx 125
compare pred idx 126
compare pred idx 127
compare pred idx 128
medium pred: SELECT AVG(weight) , AVG(year) FROM cars_data GROUP BY year;
medium gold: SELECT avg(Weight) ,  YEAR FROM CARS_DATA GROUP BY YEAR;

compare pred idx 129
compare pred idx 130
compare pred idx 131
extra pred: SELECT MAX(T2.horsepower) , T1.make FROM car_names as T1 JOIN cars_data as T2 ON T1.makeid = T2.id WHERE T2.cylinders = 3;
extra gold: SELECT T2.horsepower ,  T1.Make FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id WHERE T2.cylinders  =  3 ORDER BY T2.horsepower DESC LIMIT 1;

compare pred idx 132
extra pred: SELECT t1.maker , MAX(t2.horsepower) FROM car_makers as t1 JOIN model_list as t2 ON t1.id = t2.maker JOIN horsepower as t3 ON t2.model = t3.model WHERE t3.cylinders = 3;
extra gold: SELECT T2.horsepower ,  T1.Make FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id WHERE T2.cylinders  =  3 ORDER BY T2.horsepower DESC LIMIT 1;

compare pred idx 133
hard pred: SELECT t2.model FROM cars_data as t1 JOIN model_list as t2 ON t1.id = t2.modelid ORDER BY t1.mpg DESC LIMIT 1;
hard gold: SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id ORDER BY T2.mpg DESC LIMIT 1;

compare pred idx 134
hard pred: SELECT model FROM car_names ORDER BY mpg DESC LIMIT 1;
hard gold: select t1.model from car_names as t1 join cars_data as t2 on t1.makeid  =  t2.id order by t2.mpg desc limit 1;

compare pred idx 135
compare pred idx 136
easy pred: SELECT AVG(horsepower) FROM cars WHERE production_year < 1980;
easy gold: select avg(horsepower) from cars_data where year  <  1980;

compare pred idx 137
medium pred: SELECT AVG(t1.edispl) FROM cars_data as t1 JOIN model_list as t2 ON t1.id = t2.modelid JOIN car_makers as t3 ON t2.maker = t3.id WHERE t3.maker = "volvo";
medium gold: SELECT avg(T2.edispl) FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id WHERE T1.Model  =  'volvo';

compare pred idx 138
medium pred: SELECT AVG(edispl) FROM cars WHERE maker = (SELECT id FROM car_makers WHERE maker = "volkswagen");
medium gold: SELECT avg(T2.edispl) FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id WHERE T1.Model  =  'volvo';

compare pred idx 139
compare pred idx 140
compare pred idx 141